[
    {
        "Name": "ඩී. අජන්ත සී. පීරිස්",
        "Birth Date": "10th January",
        "City": "මාකොල",
        "Biography": "අජන්තා පීරිස් යනු ශ්රී ලංකාවේ ප්රමුඛ ගායනාකරුවෙකු හා බහුකාර්යවාදියෙකි. ඔහු \"වින්සන්ට් මාස්ටර්\" ලෙස හැඳින්වෙන දිවංගත දොන් වින්සන්ට් පීරිස්ගේ පුත්රයාය. ඔහු කැන්ඩි හි උපත ලැබීය. ඔහු මුලදී තම පියාගෙන් සංගීතය හැදෑරූ අතර ඔහු සිය ළමා කාලයේ විශාරා ගිනදාස මාස්ටර් සහ විශාරද විනීතා පල්ලෙලා හි සිසුවියක් විය. විශාරද නිර්මාල් නිර්මලා නිර්මලා රණතුංග සහ මධර්මා සහ විශාදයේ සිට මධර්මා සහ විශාරදයේ විශාදයේ ව්යාපාමාන් සංගීතයේ ඔහු ප්රතාත්මා හැදෑරීය. මේ වන විට ඔහු නවාරා සංගීට් විද්යාලයේ ශ්රී ලංකාවේ තම ලෝකරදයා කියවනවා (ඔහු කොළඹ විශ්ව විද්යාලයේ රුහුනා විශ්ව විද්යාලයේ භූමි විශ්ව විද්යාලයේ සිට පළමු උපාධිය ලබා ගත්තේය. ඔහු බ්රිතාන්ය පරිගණකයේ සාමාජිකයෙකි. ඔහු බ්රිතාන්ය පරිගණකයේ සාමාජිකයෙකි. ඔහු බ්රිතාන්ය පරිගණකයේ සාමාජිකයෙකි සමාජය සහ ශ්රී ලංකාවේ පරිගණක සංගමයේ සාමාජිකයෙක් ද ශ්රී ලංකාවේ රක්ෂණ රක්ෂණයේ ජ්යෙෂ් Senior කළමනාකාරිනියකගේ ශ්රී ලාංකිකාවක් ලෙස ඔහු කටයුතු කර ඇත. මේ වන විට ඔහු ශ්රී ලංකාවේ ජ්යෙෂ් Senior කොමසාරිස්වරයාගේ ජ්යෙෂ් Manager වරයා වන ශ්රී ලංකා සීනුව සහ බෙල් ද්රාවණයේ දී වැඩ කරයි , බෙල් වාසනවල දී මෙල්ස්ටාර් තාක්ෂණයේ අධ්යක්ෂවරයකු සහ විධායක අධ්යක්ෂවරයකු ලෙස.",
        "Lyrics of a song": "මගේ සෙනෙහසින් මෙලොවට බිහිවි කිරිකැටියෙක් මගේ දොතට ආදා අප තනිකර දා වෙනතක ගිය මගේ පියාණන් සිතින් හැදින්නා //\n\nඔබ නොදුටුව දා මගේ සිත සිතුවේ එ සෙනෙහස මට අහිමි කියා හදින් හැදිනෙදා මා එ සෙනෙහස ඔබ විදි දුක දැනි මගේ නෙත හැඩුවා //\n\nහිස පිරිමැද මගේ පුතේ කියන්නට මා ලග නැති විට ඔබත් හඩන්ඇති කිසි දා නොසිදෙන පිය සෙනෙහස ගැන කදු ලැලි හංගා සිතින් තැවෙන්ඇති //",
        "Songs": "බැලුවෙමි මතකයෙන් ඔබෙ රුව, නුඹ මටම රිදවූ තරම්, හීන කඩේ, ගන්ගා නුඹට මා පෙම් කලා, තරු දිලුනා, මගෙ සෙනෙහසින්, පිපුණොත් නුඹ පිපියන් මතු සසරේ, කුප්පි ලාම්පුව එලියෙන් ගෙපැලේ, මොන දේටවත් මාව දැන් ඕන නැහැ",
        "email": "Ajantha.Peiris@srilankasingers.com"
    },
    {
        "Name": "අමල් පෙරේරා",
        "Birth Date": "අමල් පෙරේරා ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "City": "මහරගම",
        "Biography": "",
        "Lyrics of a song": "මායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී\nකවදාවත් රිදවන්නෑ හිමිවේනම් උන්මාදිනී\n\nපාඩම් පොතේ සුවඳ අකුරින් ලියා දුන්\nඋන්මාද ගීතේද ගැයුවේ ඔයා\nඒ පොත් කොනේ ලියුව හසුනත් ඔයාටයි\nමේ පෙම් හැඟුම් නැද්ද දැක්කේ ඔයා\n\nහැමදාම නෙතු කීව ඒ පෙම් කතාවේ\nහිතවත් කමක් නේද දැනුනේ කියා\nකවදා ද ඉටුවන්නෙ මේ ප්රාර්ථනාවන්\nදුක් ගින්දරේ හීන ඇවිලී ගියා\n\nමායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී\n\nමල්හීන හිත බැන්ද කිරිකෝඩු කාලේ\nඑක හිනයක් ගාව මම නැවතිලා\nතරු වාගෙ දිලිහෙද්දි පොඩි ඇස් ඔයාගෙ\nබෑ දැන් කියාගන්න හිත ගොළුවෙලා\n\nදැනගත්තදා ඈත වෙන්වී ගියාදෙන්\nහැමදාම විඳවන්න මා මෙහි තියා\nනොකියාම ඉන්නම් මගේ ප්රාර්ථනාවන්\nමිතුදම් හොඳයි අහිමි වෙනවාට වඩා\n\nමායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී",
        "Songs": "Aphanning ba, heenayakak douve, Hiru Devi, හිරු මුහුද, ලිස්සායි ඒඩාර්, මල්කම්, මල් තසු රේන්",
        "email": "amal.perera@srilankasingers.com"
    },
    {
        "Name": "අමරසිරි පීරිස්",
        "Birth Date": "21-Jul-46",
        "City": "බොරලැස්ගමුව",
        "Biography": "ඔහු 1946 ජූලි 21 වන දින බොන්නේගන්වන්ගේ වැඩිමලා ලෙස උපත ලැබීය. ඔහුගේ පියා ඇල්බට් පීරිස් 1940 ගණන් වලදී ගුවන්විදුලි සිලෝන් ජනප්රිය සම්භාව්ය ශිල්පැල්ලක් විය. ප්රධාන සංගීත ian යාගේ පළමු ගෝලයා වූයේ ඇල්බට් ය. රූපසිංහ. ඔහුගේ මව එම්. කේ. අස්සින් උපත ලැබුවේ මට්ටා හි මෙඩ්වට්ටාහි ය, මාතාරා ගෘහණියක් විය. ඔහුට බාල සහෝදරියන් තිදෙනෙක් - අයිරින්, ශ්රියාත සහ සෝමලතා ඇත. කුඩා කාලයේදී ඔහු තම මාමා පියසෝමා නනායකාරාගේ බලපෑම හේතුවෙන් දුම්රිය රියදුරෙකු වීමට සිහින මැව්වේය. ඔහු ප්රාථමික අධ්යාපනය බොරලාලි ආනන්ද විද්යාලයෙන් සම්පූර්ණ කර පසුව මහාරාගම බුවනෙකබා විද්යාලයට ගොස් උසස් පෙළ පන්තියේ සංගීතය හැදෑරීය. පසුව 1962 දී ඔහු හේවුඩ් කතු ආයතනයට ගියේය. ඔහු විවාහ වී සිටින්නේ එස්රාජ් වාදනය කිරීම සඳහා හේවුඩ් වෙත පැමිණි ශිෂ්යයෙක් වන නන්දා කෝලාගේ ය. මෙම යුවළට එක් පුතෙකු, මාධව සහ දියණියන් සිව්දෙනා සහ ජානකි, අනුරාධ, නදීරා සහ සුබධී යන මහත්වරුන් සිටී. මාධව ගායිකාවක් මෙන්ම දක්ෂ ගිටාරයක් ද වේ. ඔහු ඉතාලියේ ජීවත් වේ. දියණිය ජනකි යනු දේවි බාලිකා විද්යාලයා හි සෞන්දර්යාත්මක උපදේශකයෙකි. අනුරාධ යනු නර්තන ශිල්පිනියකි. ඇය ජීවත් වන්නේ ඕස්ට්රේලියාවේ. නදීරා යනු ලංකා බැංකුවේ මිලගිරියා ශාඛා කළමනාකරු ය.",
        "Lyrics of a song": "හන්තානට පායන හඳ\nලස්සනයිද කියන්න \nමා නොදකින ඒ පුර හඳ\nඔබට හැකිය දකින්න //\n\nඅඳුරු වලා වහිනා කල\nසරසවි බිම තෙමන්න //කුඩේ යටින් ඔබ යන කල\nඑපා තනිය දැනෙන්න\n\nලතා මඬුලු අත වනාවි \nඑපා අහක බලන්න // \nමා ගැන මතකය ගුලි කර\nමහවැලියට දමන්න\n\nහන්තානට පායන...//",
        "Songs": "අමරනියා වෙඩෙනෙනේනා සංගීත වීඩියෝව",
        "email": ""
    },
    {
        "Name": "අමිත් වල්පොල",
        "Birth Date": "",
        "City": "හෝකන්දර",
        "Biography": "අමිත් වල්පොල යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි. ඔහු මහා ධර්මදාස වල්පෝල්ගේ දෙවන පුත්රයාය",
        "Lyrics of a song": "මංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\nවේය සිතෙ සෝකෙන් මේ ආලෙන් මේ බීමෙන්\nවිනාසෙ වැටි වැලපෙනවා සැමා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nරූපෙට රැවටිල ඇති සිත රාගෙන්\nනාස්ති කළේ කාලේ වැරදි තාලෙන්\nමිහිරි රස මිහිරි\nවූ රාගේ වින්දේ ඇයිද විස ලෝකයා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nජීවිතේ මේකද නැහැ තව තේරී\nමේ ලොව සිහිනෙකි මායාකාරී\nමිහිරි විනෝදේ වූ රාගේ\nවින්දේ තේරී තේරී වේදනා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nමේ ලෙස ඇයි ඔබ ලෝකෙ මුලාවෙලා\nආදර මිහිරි විනෝදෙ එපා වෙල\nමායා මේ මායා\nදැලෙහි පැටලී වෙලීල ඇයි අනේ\nමංමුලා වෙලා …………",
        "Songs": "අම්බාරේ, ගංගා යාන් කොහා, ඊෆෝන් ෂෙයාර්, ඊෆියාර්ස් බරයි, මෑන් එහාරි, ඔයායි මීමන්, ගලාවි, ගලාවි, ගලායි",
        "email": "amith.walpola@srilankasingers.com"
    },
    {
        "Name": "අමිතා වැදිසිංහ",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "අමිතා වැදිසිංහ යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "බැද්ද පුරා සුදු රෙද්ද වගෙයි යස \nඉද්ද පනා මල් කැන් පිපිලා.....//\n\nසද්දෙ මොකෝ අවුරුද්ද ඇවිල්ල ද \nසද්දෙ මොකෝ අවුරුද්ද ඇවිල්ල ද \nනැද්ද කනෙයියෙනි රොන් හැදිලා\n\nබැද්දට මල් වරුසාවක් වැහැලද \nනිල් කොළ පිට ඒ මල් පොද ඉහිලද .......//\n\nපාර වටේ ඇති සේරම ගස්\nසරු සාර හැඩයි ගෙඩි හට ගැනිලා \nගෙඩි හට ගැනිලා\n\nපේර දිවුල් පලු වීර ඉදී එන\nවාරෙ වගෙයි මේ පැනි පිරිලා\n\nබැද්දට පැනි වරුසාවක් වැහැලද \nගස් වල ගෙඩි පැනි වැස්සට තෙමිලද .......//\n\nරෑන ගිරා සැළලිහිණි කුරුල්ලන් \nසීනු හඬින් රස ගී ගයලා \nරස ගී ගයලා\n\nතාන තනා තම් දාන කියා\nඑළිමාන වටේ කැරකේ නටලා\n\nබැද්දට ගී වරුසාවක් වැහැලද\n\nගී පොද මේ හොට අස්සට පෙරිලද.....//",
        "Songs": "ස්වභාවය, ඇම්බ්රියෝ, ඇන්ටිඩ් චින්තනයක්, තනි මොහෝත්, ඩොල්, ජිනා ට්රිනා ට්රයිමන්, හොඩාන්ගේ වෑන් රථය",
        "email": "Amitha.Wedisinghe@srilankasingers.com"
    },
    {
        "Name": "ආනන්ද සමරකෝන්",
        "Birth Date": "13-Jan-11",
        "City": "පාදුක්ක",
        "Biography": "එගොඩහගේ ජෝර්ජ් විල්ෆ්රඩ් අල්විස් සමරකූන් (1911 ජනවාරි 13) 1962 අප්රියෙල් 2 අප්රේල් 19) ආනන්ද සමරකූන් ලෙස හැඳින්වේ. ඔහු ශ්රී ලංකාවේ ජාතික ගීය \"නැටෝ නාමෝ මාතා\" රංචුගින්නේ ඇති අතර නූතන ශ්රී ලාංකික ගේටා සාහිත්යයේ (ගීත සාහිත්යය) කලාත්මක සිංහල සංගීතය හා නිර්මාතෘගේ පියා ලෙස සැලකේ. සමරකූන් 1911 ජනවාරි 13 වන දින 1911 ජනවාරි 13 වන දින පදුක්කාවේ ක්රිස්තියානි පවුලක උපත ලැබීය. වර්තමානයේ කෝට්ටේ ක්රිස්තියානි විද්යාලයේ ඔහු සිය ප්රාථමික හා ද්විතීයික අධ්යාපනය ලැබීය. ඔහුගේ සිංහල ගුරු පණ්ඩිත් ඩී.සී. පී.පී. ගමලත්ගේ. පසුව ඔහු තම අල්මා මාතෘකාව සංගීත හා කලාවේ ගුරුවරයෙකු ලෙස සේවය කළේය. සමරකූන් කලාව හා සංගීතය හැදෑරීම සඳහා ඉන්දියාවේ සැන්ටිනික්ටන් විශ්ව විද්යාලයේ විශා-භාරතී විශ්ව විද්යාලයට පිටත්ව ගියේය. මාස හයකට පසු ඔහු සිය අධ්යාපනය අතහැර දමා නැවත ශ්රී ලංකාවට පැමිණ ඔහුගේ නම බුද්ධාගම වැලඳගෙන ආනන්ද සමරකූන් ලෙස වෙනස් කළේය. ඉන්පසු ඔහු 1938 සිට 1942 දක්වා ගාලේ මහින්ද විද්යාලයේ සංගීත ගුරුවරිය ලෙස සේවය කළේය. 1962 දී ඔහු සියදිවි නසා ගත්තේය. සමහර විට සංයුතියක පද රචනයක අනවසර වෙනස්කම් මගින් ධාවනය විය හැක.",
        "Lyrics of a song": "සිරි සරු සාර කෙතේ ගොයම් පැසීලා මහිමේ// \nපිස ගෙන එන සුළගේ කරල් නැමී නැමී දිලේ// \nහා හා ඇසේ ඇසේ////\n\nගොවි දන තුති නද දී කපති ගොයම් තොසේ තොසේ//\nයමු යමු හණික නගෝ අපි ද ගොයම් කපන ලෙසේ//\n\nහිමිදිරියේ.//\n\nහිමිදිරි සිරිය ළඟාවේ//\n\nපාමින තුටු කොමළ සිනා දිනරද අඹරේ නැගෙනා//\nකොවුලන් ගී හඬ ඇසෙනා ලක් මව සැනසේ නිතිනා//\n\nහිමිදිරියේ..//\n\nහිමිදිරි සිරිය ළඟාවේ//\n\nසිරි සරු සාර කෙතේ ගොයම් පැසීලා මහිමේ// \nපිස ගෙන එන සුළගේ කරල් නැමී නැමී දිලේ// \nසිරි සරු සාර කෙතේ....",
        "Songs": "විලෝ හි අනේ මලක් පිපිල, පොසන් පොහොඩා, ආසියේ මධුර, සුඩා, පුංචි සුඩා, නිල්වලූ, පුඩමූ කුසුම්, සුමි සාර කන්ටේ",
        "email": ""
    },
    {
        "Name": "ආනන්ද වීරසිරි",
        "Birth Date": "16th November",
        "City": "කොළඹ",
        "Biography": "ආනන්ද වීරසිරි මහතා අද ශ්රී ලංකාවේ පෙරදිග සංගීතයේ පළපුරුදු හා දක්ෂ සම්පත්දායකයින්ගෙන් කෙනෙකි. බොහෝ සිසුන්ගේ ආදරණීය ගුරුවරයෙකු වීමට අමතරව, ඔහු සෙනෙහික උපදේශකයෙකු ලෙසද ඔහුට ගරු කරනු ලැබේ. බොහෝ තරුණ සංගීත ians යන්ගේ වෘත්තිය හැඩගැස්වීම සඳහා ඔහුගේ ප්ර wisdom ාව බෙදාගත් බව. ප්රසාංගික කලා ආයතනයේ සංගීතය හැදෑරීමෙන් පසු ආනන්ද වීරසිරි මහතා 1972 දී පාසල් ගුරුවරියක් ලෙස සිය සංගීත ජීවිතය ආරම්භ කළේය. ඔහු සුවිශේෂී යෝග්යතාවයක් සහ දක්ෂ සංගීත ian යෙකු වූ අතර බොහෝ සංගීත අධ්යක්ෂවරුන්ගේ හොඳ භාවිතයක් ගන්නා ලදී. ආනන්ද වීරසිරි මහතා නිර්මාණාත්මක සංගීත අධ්යක්ෂවරයකු සහ නිර්මාපකයෙකු වේ. ඔහු වේදිකා නාට්ය හා ටෙලිඩ්රාමා සඳහා සංගීතය අධ්යක්ෂණය කර තිබේ. ගුරුවරියක් ලෙස ඔහුගේ වෘත්තිය තුළ ආනන්ද වීරසිරි මහතා ශ්රී ලංකාවේ ප්රමුඛ පෙළේ පාසල් කිහිපයක සේවය කළ අතර නිලධරයන් හරහා නැගී සිටියේය. කැපවූ ගුරුවරයෙකු හා දැඩි විනයගරුකයක් වීම නිසා, පරිපාලනයකට යාම හෝ අධ්යාපන ist යෙකු ලෙස උසස් තනතුරු ලබා ගැනීමට අවස්ථා කිහිපයක් පැමිණීම පුදුමයක් නොවේ. ගුරුවරයෙක් විශ්රාම යාම දක්වා. ආනන්ද වීරසිරි මහතා \"කලබාහුයි\" හි ආරම්භක අධ්යක්ෂකවරයෙකි. එහි දීර් est තම සේවය කරන සම්පත්දායකයා වීමට අමතරව එහි උපදේශකයා සහ උපදේශක වේ",
        "Lyrics of a song": "මහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nවිදු නැණයෙන් අබිසෙස් ලබමින්නේ\nසඳ මතුපිට පියවර එසවෙන්නේ\nඅප පමණද එක තැන කැරකෙන්නේ\nඅප තනිකර ලෝකය දිව යන්නේ\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\n\nඅපේ හදට සතුටක් මුසු වේ නම්\nඅපේ දුකට සුසුමක් මතු වේ නම්\nඅපේ හිතට දිරියක් ලැබ දේ නම්\nඑදා අපට පෙරමග සූදානම්\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා",
        "Songs": "මහා මෙරාක් ලෙසාටා, ආනන්ද බෝධි සමීන්, අතා නීලා කන්දූ පෙලේ, අතාකරි මිලිනක ගියා පුතිටි, කෝටා වටනාර මල් පයිට්, කෝටා මිලීතා මල්කාන්, එම්.ඒ.ඒ.",
        "email": "Ananda.weerasiri@srilankasingers.com"
    },
    {
        "Name": "අනිල් භාරති",
        "Birth Date": "",
        "City": "පානදුර",
        "Biography": "අනිල් භාරති යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "අද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nසතියේ දින හත, ගැන ගැන මගෙ සිත\nඉරිදා දින මත, මගෙ පැතුම් රැඳි ඇත\nසඳ පායන තුරු, කුමුදු පිපෙන තුරු\nමම ඉමි නිරතුරු, එන ඉරිදා වන තුරු\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඔබෙ සියුමැළි වත, පන ගන්වයි සිත\nපැටලී හදවත, සැමදා පවතිනු ඇත\nඉරිදා දිනකට, ඇති මගේ සහතික\nමැණ බර කිරුමට, හැකි වේවිද කෙනෙකුට\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද",
        "Songs": "සෝයා සඳහා ඉංග්රීසි, ඉංග්රීසි පිදුරු පියාසර කිරීම, නොමිලේ නොවී, ඒඑෆ්ඒ",
        "email": "anil.bharathi@srilankasingers.com"
    },
    {
        "Name": "ඇන්ජලීන් ගුණතිලක",
        "Birth Date": "23-Dec-39",
        "City": "කෝට්ටෙ",
        "Biography": "ඇන්ජලීනා රේචල් ඩි ලැනරෝල් (සිංහල: සිංහල සිනමා කර්මාන්තයේ පසුබිම් ගායකයෙකු ලෙස ශ්රී ලාංකික ගායිකාවක් ලෙස හැඳින්වූ 1939 - 2019 මාර්තු 29).සිංහල සිනමාවේ රිදී සීනුව ලෙස සලකනු ලැබේඇය ශ්රී ලංකා ගුවන්විදුලි සංස්ථාවෙන් උපාධිය ලබා ගත් උසස් පෙළ ගායිකාවක් විය.කොළඹ ශ්රී ලංකාවේ ජාතික රෝහලේ ප්රතිකාර ලබමින් සිටියදී වයස අවුරුදු 79 දී ඇය මිය ගියාය.",
        "Lyrics of a song": "කවදා හෝ සසර කතර අතරමගක දී\nදුටුවා ඔබ මට අමතක නොවන තැනක දී\nඑතැන් පටන් මම එමි සෙවනැල්ල නියා වේ\nකියන්න බෑ මහිමය මා බැන්ද දයාවේ\nකවදා හෝ සසර කතර අතරමගක දී\n\n(මිදුලෙහි ඇති ආලෝකය නිවසට එන්න) //\nසුදු ඔබගේ දෑතට මගෙ දෑතම දෙන්න\n(මිදී දුකින් රස බලන්න සිතමි මීවිතේ) //\nරිදී ඉරකි ඔබ මාගේ අඳුරු ජීවිතේ\nඅඳුරු ජීවිතේ\nකවදා හෝ සසර කතර ................\nකවදා හෝ සසර කතර අතරමගක දී\n\n(පවසනු බැරි නම් ඉදිරියෙ කරුණු ඹබෙ හිතේ) //\nමට පණිවිඩ එවනු මැනවි කුරුල්ලෙකු අතේ\n(දුකයි සැපයි ජයයි පරාජය සැම මැද්දෙන්) //\nඔබෙයි මගෙයි අඳුරු ලොවට සඳ පායද්දෙන්\nසඳ පායද්දෙන්\nකවදා හෝ සසර කතර ................\nකවදා හෝ සසර කතර අතරමගක දී",
        "Songs": "අඩරවන්තයි, ආදරීන් වෙන්වීලා, අදාා",
        "email": ""
    },
    {
        "Name": "ඇනස්ලි මාලේවන",
        "Birth Date": "June 13th, 1947",
        "City": "රත්නපුර",
        "Biography": "ශ්රී ලංකා සංගීත ian යෙකු වන ශ්රී ලංකා සංගීත ian යෙකි.බොහෝ විට \"සිංහල පොප් කුමරු\" ලෙස සලකනු ලැබේමැලේවානා 1947 ජුනි 13 වන දින ශ්රී ලංකාවේ රත්නපුර හි රත්නපුර හි උපත ලැබූ අතර කොළඹ ශාන්ත ජෝශප් විද්යාලයේ සහභාගී විය.ඔහු ස්වර්ණමාලි හා විවාහ වී සිටින අතර යුවළට එක් පුතෙකු හා එක් දියණියක සිටී.දශක තුනකටද ඔහුගේ දශක තුනකට පසු මාලිගානා සහ ක්ලැරන්ස් විසින් කරන ලද ගීත මෑතකදී මෑතකදී පහානා සිප්යූ විසින් ඔවුන්ගේ අද්විතීය සංගීත ශෛලිය ශිල්පයේ බලපෑම් කිරීමට ඔවුන්ට බලපෑම් කිරීමට තරම් ගෞරවයක් ලබා දී ඇත.ඔහුගේ හ voice ලන්ඩන් හි 206 ලන්ඩන් හි පිහිටි බීබීසී රේඩියෝ 206 ලන්ඩන් විසින් නැගෙනහිර ගුවන් විදුලි වැඩපිළිවෙල සහ එක්සත් ජනපදයේ සහ ඕස්ට්රේලියාවේ ප්රජා ගුවන් විදුලිය පිළිබඳ ඔහුගේ කටහ on ට ලන්ඩන් කරුවන් විසින් විභාගයට ගැනේ.",
        "Lyrics of a song": "සිහින පැතුම් විමනේ - රස මිහිර ගෙනා පුතුනේ\nනැලවී නැලවී හිනැහී හිනැහී - නිදියන් පොඩි පුතුනේ\n\nදෑසයි කුඩා ඔබගේ -ළපටි දෙතොල් පුතුනේ - කාගෙයි කියා සිතුවේ\nමුහුණයි රුවයි ඔබගේ - පැහැයයි හැඩයි පුතුනේ මාගෙන් නොවැ ලැබුණේ\nසිහින පැතුම් ...........\n\nමා මෙන් ඔබත් පුතුනේ - මිනිසෙක් වෙලා දෙරණේ - රට දැය කෙරේ බැඳිලා\nමව්බිම ඔබෙයි සිතලා - පණ මෙන් ඔබේ රැකලා - දිරි ගත යුතුයි පුතුනේ\nසිහින පැතුම් ...........",
        "Songs": "සිහින පැතුම් විමනේ, Mathakai Thamath, Ruwanpuren Indala, Thotiya, Manamali, Goyam Kapanawa, Kalu Mame, Mango Nenda, Pawuru Walallak",
        "email": ""
    },
    {
        "Name": "ඇනස්ලි නානායක්කාර",
        "Birth Date": "",
        "City": "මිහින්තලය",
        "Biography": "ඇනස්ලි නානායක්කාර යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි.",
        "Lyrics of a song": "ළපලු ලතා මණ්ඩපයේ\nකඳු යායේ සෙවණැල්ලේ\nලොවේ උකුසු දෙනෙත් වලින්\nසැඟවී ගමු කුමරියනේ\n\nමිහිදුම් සළු සේද සේළ\nඋකුළු තලාවෙහි දවටා\nඅපේ සිඟිති සිහින සිතුම්\nසපුරා ගමු කුමරුවනේ\n\nවසන්තයේ එක් සිහිනෙක\nඔබ මා හා අතිනත් ගෙන\nඅනන්තයට පාවී ගිය\nඅයුරු අද ද සිත්හි නැඟේ \n\nගලා හැළෙන පෙණ බුබුළේ\nමුවග සිපින නලරැල්ලේ\nඒ සිහිනය සැබෑ ලොවේ \nආදරයක් බවට හැරේ\n \nවන වදුලේ රජ දහනේ\nපෙම් රකුසන් පලවා හැර\nසුපිපි කුසුම් දාමයකින්\nඅභිෂේකය උදා කරමු\n\nවන පලවැල නෙළා ගෙනත්\nමුව මීවිත පුරවන්නට\nසදා සොඳුරු සුහද ලොවක්\nඅප වෙනුවෙන් තනා ගනිමු\n\nළපලු ලතා මණ්ඩපයේ\nකඳු යායේ සෙවණැල්ලේ\nලොවේ උකුසු දෙනෙත් වලින්\nසැඟවී ගමු කුමරියනේ\n\nමිහිදුම් සළු සේද සේළ\nඋකුළු තලාවෙහි දවටා\nඅපේ සිඟිති සිහින සිතුම්\nසපුරා ගමු කුමරුවනේ.",
        "Songs": "බුද්ධනා ගම් මැච්ඩේ, බුද්ධනා ගම් මැච්, බුද්ධනා සරන් ගච්චායි (බුද්ධ දීසකරනෝ), හන්සා විලජනානෝ, කයිම්මන් ඩොකානා, කයිළු ලතා, කණ්ඩුල මැන්හටින්, නින්ඩා එම්ඒ නෙට්හයින්",
        "email": "annesley.nanayakkara@srilankasingers.com"
    },
    {
        "Name": "ඇන්ටන් ජෝන්ස්",
        "Birth Date": "3-Jun-37",
        "City": "අලුත්කඩේ",
        "Biography": "(1937 ජුනි - 2016 පෙබරවාරි 3) 2016 පෙබරවාරි 3) ශ්රී ලංකා ගායිකාවක් සහ ගීත රචකයෙකු විය. ශ්රී ලංකාවේ ප්රමුඛ බාය ආලය ගායකයෙකු ලෙස සැලකෙන ජෝන්ස් කුඩා දම්බුමා සහ උයලා පහාලා ඇතුළු පහර කිහිපයක් තිබේ. ඔහුගේ ගීත මේ රටේ සිදු වූ විශේෂ සිදුවීම් පිළිබඳව රචනා කර ඇති අතර එමඟින් සැබෑ සිදුවීම් වලින් ගායනා කළ එකම ගායකයා බවට පත්විය. ඔහු 1937 ජුනි 3 වන දින කොළඹදී හල්ෆ්ට්ස්ඩෝර්ප් හි බර්ගර් පවුලකට උපත ලැබීය. ඔහුගේ පියා ව්යාපාරිකයෙකි. ඔහු හල්ෆ්ට්ස්ඩෝර්ප් ශාන්ත සෙබස්තියන් මහා විද්යාලයේ ආදි ශිෂ්යයෙකි. ඔහුට එක් වැඩිමහල් සහෝදරියක් සිටී. ඔහුගේ සංගීත දිවියේ කාලසීමාව සඳහා ජෝන්ස් 1963 සිට ලංකාවේ බැංකුව සහ පෞද්ගලික සමාගමේ ඉංග්රීසි ස්ටෙනොග්රැෆරයක් ලෙස ද සේවය කළේය. ඔහු වසර 35 ක සේවා කාලය සම්පූර්ණ කළේය. 1950 දශකයේ මුල් භාගයේදී ඔහුගේ මිතුරා වලි බජාසයේ මඟ පෙන්වීම යටතේ ඔහු සංගීතයට පිවිසියේය. ජෝන්ස් බැස්ටියාස්ගේ සංගීත කණ්ඩායමේ සාමාජිකයෙකු ලෙස රඟ දැක්වීය, මුලින් ගායනා කණ්ඩායම සමඟ එක්විය යුතුය. කන්තෝරුවා කන්තෝරුවාගේ ගීතය සමඟ 1958 දී ගුවන්විදුලි සිලෝන් ඉසව්වක් සඳහා සජීවී ප්රේක්ෂකයන් ඉදිරියේ ඔහු පළමු වරට ප්රථම වරට සිදු කළේය. ජෝන්ස් කැසට් හෝ සීඩී තැටි 37 ක් නිකුත් කර ඇති අතර මරු සිරිරා, ආස්පාලා ඒකනායක, කන්තෝරුවන්, ප්රේමාවතී මනම්පෙරි සහ පොඩි විජේ ඇතුළත් විය. ඇන්ජලීන් ගුණතිලකේ සමඟ ඔහු සිය වෘත්තීය දිවියේදී තනි යුගලයක් ගායනා කර තිබුණි. ඔහුගේ බොහෝ ගීත රචනා කර ජෝන්ස් විසින්ම රචනා කරන ලදී. ඔහු ගීත රාශියක් ද රචනා කළේය.",
        "Lyrics of a song": "බුදුන් තුන් වරක් වැඩි ශ්‍රී ලංකදීපය - දහම් සඟුන් සෙවනෙ දරුවො හැදුනු දේශය\nමොකක්ද ශ්‍රී ලංකාවට වුණු විනාශය - තුට්ටු දෙකට මිනී මරනව නැහැනෙ කිසි බිය\n\nපාසල් යන්නට පෙර වැඳ රැගෙන අවසර - සිරිත් පරිදි පාසල වෙත නැගුව පියවර\nඒ වන විට රුදුරු මරුව සිටියෙ ඉව කර - ඒ මොකවත් දන්නෙ නැහැනෙ සමන් කුමාර\nපන්තියෙ පළවෙනිය වුණේ සමන් කුමාර - මොනිටර් කම දැරුවෙත් පොඩි සමන් කුමාර\nමුළු පාසල බැබලුව සිසු සමන් කුමාර - අද පාසල් නාවෙ ඇයිද සමන් කුමාර\n\nලිපියක් ලැබුණා ගෙදරට පොලිසි නොයන්න - ලක්ෂ එක හමාරක් පාසලේ තබන්න\nනැත්නම් වෙන්නේ දරුවට මරුව දකින්න - කොහොම පපුව වාවන්නද අම්මට ඔන්න\nලියුම් ලියාගෙන දරුවට කරල කරදර - සිරිවර්ධන මුදලාලිට යැව්ව බලකර\nඒ මොහොතෙත් දරුව මරල තිබුණු තොරතුර - දැන ගත්තේ පස්සේ විමසුමෙන් දොස්තර\n\nඅපරාෞ නීතිය මෙය සවනට වැටිලා - පව්ලේ හිතවතෙක්ව පොලිසියෙන් සැක කළා\nඔහු අල්ලා ගෙන කරද්දි කරුණු විමසලා - අපරාදේ සුලමුල ඔහු විසින් හෙලි කළා\nපාන්සියේ කඳු යායට පොලිසිය ඇදුනා - ඝන කැලේක ගල් දෙබලක සමන් හමුවුණා\nහදවත සසලව යන මේ පුවත සැලවුනා - උගුරු දණ්ඩ විකා ඔහුව මරාල තිබුණා\n\nඑන්න පුතේ යන්න කියා නංවා සයිකලේ - අරන් ගියා සමන්ට පා බොරුවට ලීලේ\nපපුවක් නැති මිනිසුන් පා මුදලට ආලේ - නොදරුවෙකුගෙ ජීවිතෙ ඇයි මෙහෙම නැති කළේ\nකිරට හඬන කිරි දරුවන් නොදුටු උදවිය - පවක පිනක කිසි වෙනසක් නොමැති මේ අය\nතිරිසන් ලෙස අය්යෝ මේ ලොවට බිහි විය - උන්මයි වෙන්නේ මේ සිරිලකට සාපය\nබුදුන් තුන් වරක් ...........",
        "Songs": "ආසයි බයායි, ​​අබීටා අසමලගා, කහ, අහිනාවාවා - බබා රම්බා, අහින්වාමා, තක්ෂා පනාකායි, තන්තෝතෝවා කන්තෝරුවා",
        "email": ""
    },
    {
        "Name": "අසන්ක ප්‍රියමන්ත පීරිස්",
        "Birth Date": "",
        "City": "මොරටුව",
        "Biography": "අසංක ප්‍රියමන්ත පීරිස් යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "සියඹලා මලක් ඔබේ දෝතේ පිපෙනකොට\nඉගිලිලා යන්න බැහැ ඔය ඇස් දෙකෙන් මට\nපියඹලා ඇදෙන රන් සමණල යුවලකට\nනුඹේ හිතේ පෙම් සුවද ඇති තනි නොතනියට\n\nපෙම් හසුන් ඔබ ලියූ කවි පේලී සුන්දරයි\nරත්තරන් හදවතේ ආදරේ පිවිතුරුයි\nපෙම් හසුන් ඔබ ලියූ කවි පේලී සුන්දරයි\nරත්තරන් හදවතේ ආදරේ පිවිතුරුයි\nතනිවෙන්න දෙන්නෙ නෑ මේ හිත\nඔබට ආදරෙයි\n\nසියඹලා මලක්...\n\nනෙතු සිඹින පුර හද ලස්සනයි රැයකට\nඅමතක කරන්නෙපා මා ඔබේ සදවත\nනෙතු සිඹින පුර හද ලස්සනයි රැයකට\nඅමතක කරන්නෙපා මා ඔබේ සදවත\nහීනෙන් ඇවිදින් මගේ යහනේ\nඉන්න දෙව් දුව\n\nසියඹලා මලක්...",
        "Songs": "ඔහුට සඳා හැවිරිදි ආදම් මෑන් ඔටා හැටා හත්තා ජීආර්නා සතුව ඇත, මෙම ගිංගා, ටර්මාටා මහාර්, ඒසීඒ, පෙටින්, අතුල් හීඩා - අම්මා හැරෙන්න",
        "email": "asanka.priyamantha@srilankasingers.com"
    },
    {
        "Name": "ආත්මා ලියනගේ",
        "Birth Date": "June 1st",
        "City": "කලුතර",
        "Biography": "ආත්මා ලියනගේ යනු ශ්රී ලාංකික ගායකයෙක් සහ ගීත රචකයෙකි.90 දශකයේ මුල් භාගයේදී ඔහු 'ලියිතැම්බර' යන ගීතය සමඟ ජනප්රිය විය.ඔහු සිය නව ගීත සමඟ ජනප්රියත්වය ලබා ගත්තේ ඔහුගේ නව ගීත සමඟ 'අයීමත් ආඩරන්' සහ 'සීතා දූරා හන්ඩා' 'යන්නයි.",
        "Lyrics of a song": "ලියතඹරා මෘදු කුසුමකි ඈ\nතවුසන්ගේ දැහැනේ සම බිඳිනා \nනෑ ලෝකෙ ජීවේ ඇයයි...//\n\nමායාව මායාව ලොව රවටනා \nසිහිනයකි සිහිනයකි අඳුරෙ පාවෙනා \nවීණාව තත් අතර මෘදු ස්වරෙ ඇයමයි \nමා හදට රස ගෙනෙන මදුවිත ඇයයි\n\nලියතඹරා මෘදු කුසුමකි ඈ\n\nමිරිගුවකි මිරිගුවකි අප රවටනා \nදුර ඈත සිතිජයකි ඉම නොපෙනෙනා \nනිල් නයන බිගුකැලකි නෙත් සරය සුමුදුයි \nමගෙ ජීවෙ වැලි කතරෙ දිය බිඳ ඇයයි\n\nලියතඹරා මෘදු කුසුමකි ඈ",
        "Songs": "මේ.පී.",
        "email": "athma.liyanage@srilankasingers.com"
    },
    {
        "Name": "අතුල අධිකාරි",
        "Birth Date": "March 8 in 1966",
        "City": "හලාවත",
        "Biography": "අඩිකාරි මුදියන්සලේගේ පුබුදුදු අතුල අඩිකාරි 1966 දී චිලව් දිස්ත්රික්කයේ මහාවෙව ප්රධානියාට උපත ලැබීය. කුමාරදාස ආඩිකාරි සහ ලලිතා වික්රමනයනායක. ප්රසිද්ධ සිංගර් නෙලූ අඩිකාරි යනු අතුලාගේ එකම බාල සොහොයුරියයි. අතුලාගේ සංගීත පවුලක් විය. ඔහුගේ පියා පාසැලේදී ඉංග්රීසි හා විද්යා විෂයයන් ඉගැන්වූ නමුත් සංගීත භාණ්ඩ හා නර්තන ගුරුවරයෙකු වූ අතුලාගේ මව සමඟ ගායනා කිරීමට ඔහු ප්රිය කළද ඔහු සංගීත භාණ්ඩ හා සංගීත භාණ්ඩ සමඟ ගායනා කිරීමට ප්රිය කළේය. ඔහුගේ දරුවාට සහ දරුවාගේ පසුබිම නිසා ඔහුට ලැබුණේ මේ වන විට ඉහළ මට්ටමක පවතින ආකාරයට ඒවා උපරිමයට පැමිණීමට හේතුව ඔවුන්ගේ වෘත්තිය ලෙස සංගීතය තෝරා ගැනීමේ කිසිදු අදහසක් නොතිබුණි. මේ ලෝකයට උපත ලැබූ සෑම කෙනෙකුම ජීවත්වීමට යම් දක්ෂතා දැක්වෙනවා. ඔවුන්ට නැගිය හැකි උස කුමක්ද යන්න තීරණය වන්නේ ඔවුන්ගේ පෙර කොමා (යහපත් ක්රියාවන්) විසිනි. කෙනෙකුගේ දෛවයෙහි මාවත හරවා යැවීමට ඔබ කොතරම් උත්සාහ කළත් එය වෙනස් නොවේ. අතුලාගේ ද එවැනිම කතාවක් විය. අතියුලා හෝඩිය පළමුවෙන්ම හැඩගස්වා ගත්තේ ඔහුගේ මව ගුරුවරියක් වූ චිලාව් ආනන්ද විද්යාලයේ ය. පසුව ඔහු පස්වන ශ්රේණියේ ශිෂ්යත්වයක් මගින් කොළඹ රාජකීය විද්යාලයට ඇතුළු විය. අතුලා ත්රිත්ව විද්යාලය පියානෝ සංගීතය 5 ශ්රේණිය දක්වා අධ්යයනය කළේය. ගිටාරය සැමවිටම ආකර්ෂණයකි. ඔහුගේ මවගේ ගායනය කිරීමේදී ඔහු නැගෙනහිර සංගීත සටහන් ඉගෙන ගත්තේය. ඔහුගේ විනෝදාංශ ස්වල්ප දෙනා අතර සංගීතය ඔහුගේ බලකාය, ටෙනිස් සහ බැඩ්මින්ටන් ය. අතුලාට වසර කිහිපයක ජ්යෙෂ් man ජ්යෙෂ් man ජ්යෙරාවක් වූ නීල් වර්නකුලසූරිය ද මහාවාවේ එම ගම්මානයේ සිටම විය. නීල් කොළඹ තර්ස්ටන් විද්යාලයේ සහ ඔහුගේ විභාගවලින් පසුව ඔහු තමාගේම සංගීත කණ්ඩායමක් පිහිටුවීමට තීරණය කළේය. නීල් සහ අතුල දරුවන් වූ දින සිට එකිනෙකා දැන සිටියහ. මහ සංගීත ians යන් සොයමින් සිටි නීල් ආනන්ද විද්යාලය නැවත ඇතුළත් කළ පරිදි තරුණ සංගීත ians යන් සොයා සිටි නීල් විසින් ඔවුන් හා එක්වන ලෙස අතුලට ආරාධනා කළහ. චිලාව් හි මල් පිපී ඇති 'සූරියකාර්' සිය ජනප්රිය සුවඳක් දූපත පුරා කෙටි කාලයක් තුළ පැතිර ගියේය. මේ අතර අතුලා 1984 දී උසස්පෙළ සඳහා පෙනී සිටීමට සමත් වූ අතර, සංගීත කණ්ඩායම සමඟ ඔහුගේ හවුල්කාරිත්වය අනිවාර්යයෙන්ම ශක්තිමත් කළේය. 'සූරියකාන්ත' 1986 දී ඔවුන්ගේ පළමු කැසට් පටය නිකුත් කළේය. අතුල යතුරුපුවරුව වන අතර ඔහුගේ දක්ෂතා ගායිකාවක් ලෙස උත්සාහ කර නැත. එහෙත්, 1988 දී ඔහු සිංගර්වරයෙකු ලෙස සිය වාසනාව අත්හදා බැලූ අතර ඔහුගේ පළමු ඒකල `රන් පලඩියේ 'නිදහස් කළේය. 12 න් ගීත හයක් පහර විය. හුදෙක් ගැහැණු ළමයින් නොව, කුඩා අය, මැදිවියේ හා වැඩිහිටියන් වැඩි කල් නොගොස් ඔහුගේ රසිකයන් බවට පත්විය.",
        "Lyrics of a song": "මගේ කියා ඈත් වෙලා වේදනා දුන්න \nහිත ළග පෙම් සිහින වල හිදින්නේ ඔබම \nඇස් දෙක ආයේ ඔබේ ඉතින් හිමිවෙන් නැතිවාට \nකදුළු මතක අපේ සිහින කර හඩන්නෙ තනිව \nඅඩන්නේ තනිව...\n\nදුර රැදිලා කදුළු දරන් මට හිදින්න බෑ \nමා තනිවම විදිනවා දුක ඔයා දන්නෙ නෑ \nනාඳුනනා ලෙස හැරදා මට ඉන්නට බෑ \nකවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ \nයලි හිමිවෙන්නෙ නෑ..\n\nහිත දවනා මතක තියන් මට හිදින්න බෑ \nරෑ තනිවම හැඩුව තරම් ඔයා දන්නෙ නෑ \nමේ දෑසට යලි කිසිදා ඔබ හමුවන්නේ නෑ \nකවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ \nයලි හිමිවෙන්නෙ නෑ...\n\nමගේ කියා.....",
        "Songs": "ආඩරා සිතුරන, ඒඩා සූර්යනය, ඇඩාරේ - පිනි වෝල් වෝල් අමූ, අහිනාන්යා ඊඒ, ඩයිවේ සීඒ, ඩයිවේ සරදුම, ඩයිවේ සරදාමින්, ඩාවලාල් එලී, එකා සිනාසෙමින්, ගුරුවරයා, හීන්න් ඊකා,",
        "email": ""
    },
    {
        "Name": "බන්දුල විජේවීර",
        "Birth Date": "",
        "City": "අලව්ව",
        "Biography": "බන්දුල විජේවීර යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "කුල ගෙදරින් දුම්බර කඳු වැටියේ\nකැන්දන් එනවා දුම්බර මැණිකේ\nමනු කුල සිරිතට පති කුලයට අද\nකැන්දන් එනවා දුම්බර මැණිකේ //\n\nවන ලන්දෙ හැංගුණු\nමූණ පොඩ්ඩක් කෝල වෙයි\nගම් මණ්ඩියේ...\nගහ වැල් පිපී සුවඳින් පිරී අද\nපෙම් කෙළි වැව් කණ්ඩියේ //\n\nවාසනාවන් හරි වාසනාවන් ////\n\nකුල ගෙදරින්...\n\nදඹ රත්තරං හැඩ දා සොඳින් කළ\nරූපයක් ඇඹුමක් වගෙයි\nඔහෙ ඇස් වහක් නැත හෝ වහක් නැත\nආකහේ තරුවක් වගෙයි //\n\nවාසනාවන් හරි වාසනාවන් ////\n\nකුල ගෙදරින්...",
        "Songs": "ANE PEYSE, Dotha Pura, ඩුපපුහුගේ, ගාත් මහිටියා, ගුරු ගෙදර, හිටා හීලා න, ඉසලා හීලා රයිසිලා, කන්ද සරඳු, කුලා ගෙඩරින්-හුලා වොලි",
        "email": "bandula.wijeweera@srilankasingers.com"
    },
    {
        "Name": "භාතිය ජයකොඩි",
        "Birth Date": "22-Dec-76",
        "City": "කොළඹ",
        "Biography": "භාතිය ජයකොඩි උපත ලැබුවේ හමුදා පවුලක ය. ඔහුගේ පියා අභාවප්රාප්ත මේජර් ජෙනරාල් නිහාල් ජයකොඩි සහ මව් මෝහියිනි ජයකොඩි ය. ඔහුගේ ගායන හැකියාවන් ඔහුගේ මවගේ පැත්තේ සිට පැමිණේ. මහනුවර හිල්වුඩ් විද්යාලයේ හිල්වොඩ් විද්යාලයෙන් පැවතියේ ඔහුගේ මාතෘ ආච්චි සෝමි මීමිකා බස්නායක විද්යාලයේ ගායනා ගායනාධය සහ ඔහුගේ මව වන අතර එය සම්භාව්ය පුහුණුව ලත් පියානෝවක සහ පියානෝ උපදේශකයෙකු විය. බතියට වයස අවුරුදු හතේ සිට ශාස්ත්රීය පියානෝ සංගීතය ආරම්භ කළ අතර ඔහුගේ පාසල් ජීවිතය පුරාම සංගීතයේ එක්සන්ත විය. ඔහු අධ්යාපනය ආරම්භ කළේ ඉන්දියාවේ හොලොවේ ප්රාථමික පාසලේ සහ 1984 දී ඔහු කෙටි කාලයක් සඳහා කොළඹ ඉසිපතාන විද්යාලයට ඇතුළත් විය. 1988 දී ඔහු කොළඹ ආනන්ද විද්යාලයට එක් වූ අතර පසුව 1995 දී නියෝජ්ය ප්රධානීන්ගේ තනතුර හෙබවූ අතර 1994 දී බාලදක්ෂ හමුදාවේ මුලභූන්යා පත් විය. ආනන්ද විද්යාලයේ ඔහුගේ ද්විතීයික අධ්යාපනයෙන් පසුව ඔහු උපාධිය සම්පූර්ණ කර ලබා ගත්තේය එක්සත් රාජධානියේ මැන්චෙස්ටර් මෙට්රොපොලිටන් විශ්ව විද්යාලයේ BSc (ගරු) ව්යාපාර. පසුව ඔහු ශ්රී ලංකා සංගීත ශිල්පික ශිල්පිනිය වන දිලප් ගබ්දමුදුරුදිග් සමඟ සංගීත තාක්ෂණය ඉගෙන ගැනීමට පටන් ගත්තේය. ඔහු විවාහ ann න් ගායිකාවන් කොළඹට බැඳුණු අතර මේරි ant න් මියගිය ගායිකාවක් වන ඩේවිඩ් පාසල යටතේ ජනාධිපති සහ බ්රෝඩ්වේ ගායනය ආරම්භ කළේය. 90 දශකයේ අගභාගයේදී බතුලා ගුවන්විදුලි ජලෙසල් සහ වෙළඳ දැන්වීම් සඳහා නිදහස් ගායිකාකාර ගායනය ලෙසත් රංගා දසනායක සමඟ වැඩ කළහ. මෙම කාලය තුළ බතියා ජයකොඩි සහ සන්තූෂ් වීරමන් ව්යාපෘති කිහිපයක් මත සහයෝගයෙන් කටයුතු කළ අතර එය Bns සෑදීමට හේතු විය. ඔවුන් පසුගිය දශක දෙක තුළ ශ්රී ලංකාවේ වඩාත්ම වාණිජමය වශයෙන් සාර්ථක සංගීත පනහක් වී තිබේ.",
        "Lyrics of a song": "චාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ\n\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\n\nසන්සුන් සුසුම් ද කැළඹි\nඇයිද මොකදැයි ඇහුවා\nරාගයේ චන්ද්ර හැඟුමන්\nරණ්ඩු කෙරුවා\n\nමං කෙසේ කොයි ලෙසේ මුමුණ\nමේ ශෝක ගීතේ\nකවුරුවත් දන්නෙ නෑ දැන් මේ\nමං ඉන්නෙ හිරගේ\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\n\nදිවි ගිම් නිවෙන්න පැතුවේ\nමදුර ස්වරයයි ඔබගේ\nආදරේ හීනයක් නම්\nහැබෑ නොවෙනා\n\nමං කෙසේ දැවි දැවී ඉන්නෙ\nමේ වේදනාවෙන්\nඇස් අගින් ඔබ ලියූ කවි ගී\nමුමුණන්න මුවඟින්\n\nඔය මන්දහාසයෙන්\nසැනහේවි ජීවිතේ\nසෝතාප සඟවන්න\nඔබ එන්න ආදරෙන්\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ",
        "Songs": "අසූඩියිනි එල්ලීනා, ඒ.අයි.",
        "email": ""
    },
    {
        "Name": "සී. එල්. ෆොන්සේකා",
        "Birth Date": "",
        "City": "මොරටුව",
        "Biography": "ප්රවීණ ගායකයා, ගීත රචක, සංගීත අධ්යක්ෂ ස්ටේට් සහ ටෙලි නාට්ය නළු සී.එල්.'සොනී' ලෙස ෆොන්සේකා 'සොනී' ලෙස හැඳින්වූයේ කලාත්මක ක්ෂේත්රයේ සිය කැපී පෙනෙන සේවාවන් වෙනුවෙන් කලා භවුෂානා සම්මානය \"යහනා 'සම්මානයෙනි.C.l වයස අවුරුදු නවයේ සිට ගායනා කරමින් සිටි අතර, පසුව 'රුක්මානි දේවි' වැනි අභාවප්රාප්ත 'රුක්මානි දේවි' වැනි පෞරුෂත්වයන් සමඟ වේදිකාවට ගියේය.මොරටුවා කලා සංසදයේ තේමා ගීතය \"සිරිිබරා මොරතු ගේම් 'යන තේමාව යන තේමා ගීතය නම් මොරටුවා ගීතය සඳහා ඔහු සංගීත කණ්ඩායම ද ලබා දුන්නේය.පණ්ඩිත් ඩබ්ලිව්. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී. ඩී.",
        "Lyrics of a song": "\"දැන් ඉතින් සමුගන්න වෙලාවයි\nඔය කදුලු ඇස් දෙකට බර වැඩී\nමට දෙන්න ඒ කදුලු තනි කමට ලග ඉන්න\nමට අකැප ඒ ලොවට දැන් ඉතින් ඔබ යන්න..\"",
        "Songs": "Aadare Saadaya, Aluyama Hirikada Pinne, Deegeka Yannata, දැන් ඉතින් සමුගන්න වෙලාවයි, Ena Walin Death Pa, Ko Ran Ethana, Mal Mal Mal, Mangala Me Suba Mohothe",
        "email": "CL.Fonseka@srilankasingers.com"
    },
    {
        "Name": "සිරිල් ටියුඩර් ප්‍රනාන්දු",
        "Birth Date": "28-Jan-21",
        "City": "කොළඹ",
        "Biography": "1921 - 17 ඔක්තෝබර් 1977 ඔක්තෝබර් 28) සී.ටී. ලෙස හැඳින්වේ.ප්රනාන්දු ශ්රී ලංකා ගායිකාවක් සහ රචනාකරුවෙකු වූ බව ප්රනාන්දු.ශ්රී ලංකාවේ පළමු පොප් ගායකයා ලෙස හැඳින්වෙන ශ්රී ලාංකික සංගීතයේ වඩාත් ජනප්රිය ගායකයා වන ප්රනාන්දු \"වනා බමාරු\" \"සහ\" රෝසා පිරිමින් වැනි ය.\"ඔහුගේ අනෙක් ජනප්රිය ගීත අතරට \"LA ADA NINDE\", \"ගිල්ලේ පිරිමි තාරාවා\" සහ \"මාරියා මාවු කෞතුකාගාරය\" ඇතුළත් වේ.",
        "Lyrics of a song": "ලෝ අඩ නින්දේ මේ රෑ යාමේ \nසඳ රැස් වතුරේ කිමිඳෙන්නේ \nරන් තරු බැබලේ නිල් ආකාසේ \nලස්සන මල් වාගේ\n\nකිරල ගසේ ගෙඩි දිය මත වැටිලා \nපහලට බැස යයි දිය රැල්ලේ \nනාමල් පිපිලා නැලවෙති සුළඟේ \nසුවඳ හමා දසතේ\nසෝබන මේ නදියේ සෝබන මේ නදියේ \nසඳරැස් වැතිරෙන්නේ\nලෝ අඩ නින්දේ…………\n\nඇල් කෙතකින් එන දැරියක ගේ හඬ \nදැන් දැන් මා හද නළවන්නේ \nමහ රෑ හින්දයි ඇයගෙ රිදී හඬ \nදසතම පැතිරෙන්නේ\nකවුරුද ඇල්හේනේ කවුරුද ඇල්හේනේ\nගී හඬ පතුරන්නේ\nලෝ අඩ නින්දේ…………",
        "Songs": "වානා බිල්වින්ඩා නෙල්වා උකුලේ, රෝසා පිරිමි, ජේල් පිරිමි තාරාවා, මිරියා මාවු කෞතු, පුන්සන් මව්නානි, රන්වාන් දුවනවා",
        "email": ""
    },
    {
        "Name": "චම්පා කල්හාරි ජයසේකර",
        "Birth Date": "26-Mar-74",
        "City": "පිලියන්දල",
        "Biography": "කල්තාරි උපත ලැබුවේ කොළඹ, සංගීත ian යෙකුගේ දියණිය සහ කොළඹ සෞන්දර්යාත්මක විශ්ව විද්යාලයේ කථිකාචාර්යවරයකු වන සංගීට් විශාරාද් එච්.ඩී.සේ.ඇය 2004 දී හෙට්ටියාරච්චිගේ දොන් සාචිත් ජයසේකරගේ මවකි.ඇය 1994 දී සංගීට් යුධ සහ 2015 දී සංගීට් නිපුන් ද කළාය. ඇය දැනට වාසය කරන්නේ නුගෙගෝඩාවේ ය.",
        "Lyrics of a song": "මල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ \n\nමල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ\nකවදත් මේවාගේ...මල් හිනැහෙන පාරේ \nකවදාද යන්නේ ඉස්කෝලෙ ආයේ \nසුවඳත් අද වාගේ..සිරවේ හද යායේ \nසමුගන්න කඳුළින් දෙනුවන් පිරිලා \nමේ අපේම පන්තියේ යහළු යෙහෙළියෝ දමා \nහැරයන්න මට බෑ පාසැල් බිමෙන් එහා\n\nමල් යායෙ සමනල්ලු කෝ..පාලුවී ගිහින්\nඉස්කෝලෙ අන්තිම දවසයි අපේ \nමල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ\n\nවැහිදාට පාරේ මඩ බිංදු ඉහිලා \nසුදුපාට ගවුමේ සිතුවම් පිරිලා \nපාඩම් කියෝලා..ගී සිංදු කියලා \nවේලාව නොගෙවා ගුරු සිත් නිවාලා \nජීවිතේ කතන්දරේ.. හෝඩියේ ඉදන් ලියූ\nඉස්කෝලෙ යුගයේ නිමවේ වි දුකෙනී..\n\nමල් යායෙ සමනල්ලු කෝ..පාලු වී ගිහින්......",
        "Songs": "ආජාස් නෙගෙද, අජේ",
        "email": "champa.kalhari@srilankasingers.com"
    },
    {
        "Name": "චාන්දනී හෙට්ටිආරච්චි",
        "Birth Date": "",
        "City": "නුගේගොඩ",
        "Biography": "චාන්දනී හෙට්ටිආරච්චි යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "ලස්සන සමනලයෝ කොහෙන්ද ඔය පාට\nදිස්වෙන පබලු එකින් එක දිලිසෙන දාට \nලෝකෙට සුර ලෝකෙට ලස්සන පිවිතුරු පාට \nරන් මුතු බබලයි රන් මෙහෙසිය වූ දාට...//\n\nවිලාසිතා මන බඳිනා විලාසිතා \nවිලාසිතා නෙතු රැක්ෂෙනා විලාසිතා \nදිලෙන තරු වලින් නැහැවෙන විලාසිතා \nමලට පෙති වගේ බබලන විලාසිතා\n\nහමනා සුළඟට එක පැහැයක් එක් වූ වොත්\nගලනා මුහුදේ රළවල පැහැයක් වූවොත් \nඅදට වඩා හෙට උපදින නව දවසක් වුවොත් \nඅලුත් අලුත් දේවල් තව ලෝකෙට එක් වූවොත්...//\n\nවිලාසිතා මන බඳිනා විලාසිතා...\n\nලස්සන සමනලයෝ කොහෙන්ද ඔය පාට...\n\nවිලාසිතා මන බඳිනා විලාසිතා...//",
        "Songs": "සාහිත්යය, ඇඩ්රන් දාතා ලාන් වැන්, ආනවතා මහතුනි), අහිමිවාජ් ඩි hana ාතාර් ඩි hanah hanahhari, Ai minsune, Ai anandanea rahahrie, Aunandanea mah pahah, පැය",
        "email": "chandani.hettiarachchi@srilankasingers.com"
    },
    {
        "Name": "චන්ද්‍රලේඛා පෙරේරා",
        "Birth Date": "1-Dec-61",
        "City": "කුරුණෑගල",
        "Biography": "පෙරේරා උපත ලැබුවේ කුරුණෑගල මධ්යම පන්තික පවුලට ය.දරුවෙකු ලෙස ඇය බොහෝ විට නිවසේදී ගායනා කළාය.පාසැලේදී ඇය නිතරම අන්තර් පාසල් තරඟවලට නිතරම ගායනා කළාය.ඇය අධ්යයනය කරමින් සිටියදී කුරුනේගලෙහි \"වසන්ත කාලය\" යන සංගීත කණ්ඩායම සඳහා ගායනා කළාය.ඇයගේ අනාගත සැමියා රූකාන්ත ගූනාතිලකේ 1976 දී ඔහු සංගීත කණ්ඩායම සඳහා යතුරුපුවරු වාදකයෙකු ලෙස කටයුතු කළාය.පෙරේරා 1989 දී රූකාන්ත ගූනාතිලකේ සමඟ විවාහ වූ අතර ඇයට දියණියන් තිදෙනෙකු සහ පුතෙකු සිටී.ඇගේ පෙර විවාහයෙන් දරුවන් දෙදෙනෙක්;දියණිය ශ්යාාමිට නදීෂා සහ පුතා යොහාන් කුමාරගේ.ඇයට රූකාන්ත, වැසි චාරුකා සහ සුළං සහිත දියණියන් දෙදෙනෙක් සිටී.",
        "Lyrics of a song": "වන සිව්පාවුන් වැනි මිනිසුන් මැද\n\nදෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන්\n\nමනු ලෝ තලයේ වාසනාවන්\n\nවල්මත් වුවන් දැක මහ වන මැද යායුතු මාවත පෙන්වා\n\nඒ දෙස බලමින් සැනසෙන මිනිසුන් ඉටු දෙවියන් ලොව සිටිනා\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද\n\nදෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nකඳුළු සලන්නන් කඳුළින් ගොඩ ගෙන\n\nමුවගේ හසරැල් රඳවා තුටු කඳුළින් නෙතු සරසන දෙවියන් පුද දෙමු දෙවොලට කැඳවා\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත..\n\nඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්",
        "Songs": "ン",
        "email": "chandralekha.perera@srilankasingers.com"
    },
    {
        "Name": "චන්ද්‍රසේන හෙට්ටිආරච්චි",
        "Birth Date": "7-Sep",
        "City": "කොළඹ",
        "Biography": "චන්ද්රසේන හෙට්ටියාරාච යනු ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයෙකි.සාධාරණයි.කණ්ඩායම් ගායිකාවක් ලෙස තරුණ ගායනා කණ්ඩායමෙන් හෙට්ටියාරච්චිට පත්වූ හෙට්ටියාරච්චිට තම දක්ෂතා පෙන්වීමට හැකි වූ අතර මෝල් මල් නපුරු ගීත කිහිපයක්, අම්මා ජීවනා, ඔයාකාත් සහ නවාලා අන්නස්සි වැනි ජනප්රිය ගීත කිහිපයක් ගායනා කර තිබේ.",
        "Lyrics of a song": "කවදාවත් යලි ඔබ නාවත් අමතක කරන්න බෑ තාමත්\nඅමතක කරන්න බෑ තාමත්\nඔබ වෙන්වුණු බව දැන දැන උන්නත් ආදරෙයි මා ඔබට තවත්\nආදරෙයි මා ඔබට තවත්\nආයේ දවසක හමුවීලා... ඉන්නට ආසයි ලංවීලා //\n\nඅපි හමුවුන තැන් තාමත් එහෙමයි වෙනස්වුණේ ඔබවිතරයි\nකාලය ගෙවුනත් දුක තව එහෙමයි\nසිත විමසන්නේ ඔබ ගැනමයි\nආයේ දවසක හමුවීලා ඉන්නට ආසයි ලංවීලා //\n\nඅපි ඈත් වෙලා ඉමු කීවත් සිහි වෙන්නේ ඔබ ගැනමයි\nඔබ තනිකල සිත කවුරුත් නොපතයි\nහැමදාටම මං ආදරෙයි\nආයේ දවසක හමුවීලා ඉන්නට ආසයි ලංවීලා //",
        "Songs": "සරතීම්, මල් ලේවෙල්, අම්මා ජීවනා, ඔයා.",
        "email": "chandrasena.hettiarachchi@srilankasingers.com"
    },
    {
        "Name": "චරිතා ප්‍රියදර්ශනී පීරිස්",
        "Birth Date": "19-Oct-67",
        "City": "නුගේගොඩ",
        "Biography": "ප්රියදර්ශනී 1967 ඔක්තෝබර් 19 වන දින නුගෙගොඩ මිරිහානාහි උපත ලැබීය.ඇයට එක් වැඩිමහල් සහෝදරියක් සිටී, මාලිකා.ඇගේ පියා ආරියදාස පීරිස් ජනප්රිය ගුවන් විදුලි කලාකරුවෙකු සහ චිත්රපට නිෂ්පාදකයෙකි.ඇගේ මව පුෂ්පා විජරත්න, කෙටි අසනීපයකින් පසු 2001 දී මියගිය ගෘහණියක්.ප්රියදර්ශනී විසින් නුගෙගෝඩයේ අනුලා විද්යාලයෙන් අධ්යාපනය සම්පූර්ණ කරන ලදී.සෑම පාසල් උත්සවයකදීම ඇය සමඟ ගායනා කළේ ඇගේ පංතියේ මිතුරිය වන දීපිකා ප්රියදර්ශනී සමඟය.පාසැලේදී චරිතා දයා නල්ලම්පිටියා සහ ක්රිස්ටීන් දිසානායක මහතා යටතේ කැන්ඩියන් නටීම හැදෑරීය.ඇය පාසලේ නැගෙනහිර සංගීත කණ්ඩායමේ ක්රියාකාරී සාමාජිකයෙකු වූ අතර මග පෙන්වූ හා නෙට්බෝල් සඳහා සහභාගී වූවාය.චරිතාට විවාහක එඩ්වඩ් ජයකොඩි සමඟ විවාහ වී සිටී.මෙම යුවළට එක් පුතෙකු, චන්ද්රීයපා සහ එක් දියණියක් වන ෂුමනා රෂ්නෝඩි ඇත.1994 සිට එක්සත් ජනතා නිදහස් සන්ධානයේ දේශපාලන ව්යාපාරවල කලාකරුවන් ලෙස එඩ්වඩ් සහ චරිතා එකට වැඩ කර ඇත.",
        "Lyrics of a song": "පන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ\n\nමේ බවක් තේරුණේ නැති කමින් ලෝකයේ\nනැති කමයි රජ වුනේ දුක් නොවවු මිනිසුනේ\nමේ බවක් තේරුණේ නැති කමින් ලෝකයේ\nනැති කමයි රජ වුනේ දුක් නොවවු මිනිසුනේ\n\nහෙට වුනත් නෑ පමා\nපණ පොවා ජීවිතේ\nරළ පෙළක් සේ නැගෙව්\nමියැදුනත් හාමතේ\n\nවීරියෙන් රට නැගූ දහදියෙන් බිම තෙමු\nජීවිතේ වේදනාවෙන් සදාකල් ගෙවූ\nවීරියෙන් රට නැගූ දහදියෙන් බිම තෙමු\nජීවිතේ වේදනාවෙන් සදාකල් ගෙවූ\n\nමිනිසුනේ හදවතේ\nලේ වලින් පණ ලැබු\nපරපුරක් බිහි කරව්\nමාවතේ තනි නොවූ\n\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ",
        "Songs": ", ආනන්ද වේනා, අන්දරාකාමා, අවාසෙනියම් පාලා, අවාසුයි.",
        "email": "charitha.priyadarshani@srilankasingers.com"
    },
    {
        "Name": "චාමික සිරිමාන්න",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "චාමික සිරිමාන් යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි.චාමිකාගේ සීයා වසන්ත සඳනායකගේ සැමියා වන ධර්මදාස පෙරේරාගේ ous ාති සහෝදරයෙකි.චාමිකාගේ පියා දක්ෂ සැක්සෝෆෝනිස්ට් සුසිල් සිරිමාන් ය.",
        "Lyrics of a song": "අපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nඅපි එක්වුණ මතකය සිහියට එනවිට\nකඳුළුයි දෑස තෙමන්නේ\nමම ඔබ ගැන හිත හිත දුක් වෙන හැමවිට\nමනසයි වන්දි ගෙවන්නේ\n\nහිතන්න බෑ හිත කීරිගැහෙනවා\nඔය සුදු මූණ මතක් වී\nසිඹින්න බෑ මුව අහක බලනවා\nමගෙ මුව එක්ක තරහ වී\nකියන්න බෑ අපෙ ආදර කතාව\nකඳුළුත් එක්ක සිනාසී\nසොයන්න බෑ තව ඔයා වගෙ කෙනෙක්\nආදරෙ කරන්න පෙර සේ\n\nඅපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nසුන්දර සිනාව සුරතල් සිනාව\nදකින්න ආසයි අඳුරේ\nදැවටුණ හැටි ආදරෙයි කියා මට\nදැනෙනවා කිති කැවි යහනේ\nතොල් පෙති සිඹින්න ආසයි ඇත්තට\nතුරුලට ගෙන ඔබ පෙර සේ\nආදරෙ කියන්න තව එක සැරයක්\nවෙන්වී යන්නට මත්තෙන්\n\nඅපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nඅපි එක්වුණ මතකය සිහියට එනවිට\nකඳුළුයි දෑස තෙමන්නේ\nමම ඔබ ගැන හිත හිත දුක් වෙන හැමවිට\nමනසයි වන්දි ගෙවන්නේ",
        "Songs": "පිළිතුර",
        "email": "Charmika.Sirimanne@srilankasingers.com"
    },
    {
        "Name": "චිත්‍රාල් සෝමපාල",
        "Birth Date": "4-Nov-66",
        "City": "කොළඹ",
        "Biography": "පෙරගස්වට් චන්දනා චිකන (1966 නොවැම්බර් 4 නොවැම්බර් 4), අකා චිටා චිකිත්සාව ශ්රී ලංකාවේ දෘ hard පාෂාණ හා බැර ලෝහ හ al නාශය සහ සංගීත අධ්යක්ෂකවරයෙකි.ඔහු යුරෝපීය බල ලෝහ පටි ෆයර්වොන්ඩ්, පවර් ගවේෂණය, ඇවලෝන්, ෆාරෝ, රතු පරිපථය සහ ශිෂ්ටාචාරය සමඟ ඔහුගේ වැඩ කටයුතු සඳහා ප්රසිද්ධය.1998 දී නිකුත් කරන ලද ඔහුගේ සිංහල ලුහුබැඳීම හේතුවෙන් සෝමපාල සිය සිංහල ලුහුබැඳීම හේතුවෙන් ඔහුගේ මව් රට තුළ ජනප්රියත්වයක් ලබා ඇත.සංගීත ians යන්, සංගීත අධ්යක්ෂවරුන් සහ නිෂ්පාදකයින් විය.විවේචකයන්ට මිශ්ර කිරීම සඳහා \"දම්බුලූ ගලේ\" සෝමපාල විසින් \"දම්බුලූ ගේල්\" සෝපාලා විසින් ප්රතිනිර්මාණය කරන ලදී.ඔහුට සහෝදරයන් තිදෙනෙක් සිටී: ප්රසන්න, රොහාන්, නාලින් සහ එක් සහෝදරියක් වන පියුමි.සෝමපාල අධ්යාපනය ලැබුවේ කොළඹ පිහිටි පිරිමි ළමයින් සඳහා ජාතික පාසලක් වන ඉසිපතාන විද්යාලයේ (විධිමත් ග්රීන්ලන්ඩ්ලන්ඩ්ස්) හි) ය.ඔහු එහි සිටියදී ක්රිකට්, පාපන්දු (පාපන්දු) සහ හොකී ක්රීඩා කළේය.",
        "Lyrics of a song": "නදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ\n\nසුළං රැල්ලේ දැවටිලා මන්ද මාරුතයේ\nසොයා යන්නෙමි\n\nගලා එන මන්දාකිණී\nහභා යමි හමුවෙන තුරා\nජීවිතේ උතුම් පැතුමන් හා\nනිරතුරුව අභිමානයෙන්\nමංමුළා නොවේ කිසිදා\nජවය මා සතු වේ\nදිරිය ගන්නෙමි\n\nගලා යන දහසක් නදී\nබලා සිටී මා එන තුරා\nනිරතුරුව අභිමානයෙන්\n\nනදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ\nනදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ",
        "Songs": "නදී ගංගා තරණයේ, Malakuth Thibuna, Dambulugale, දෙදුනු රන් ඔවිල්ලේ, Sinha Lokaye Sinhaya",
        "email": ""
    },
    {
        "Name": "ක්ලැරන්ස් විජේවර්ධන",
        "Birth Date": "3-Aug-43",
        "City": "කොළඹ",
        "Biography": "(1943 අගෝස්තු 3 - 1943 - 13 දෙසැම්බර් 13) ශ්රී ලාංකික ගායකයෙක්, රචනා සහ සංගීත ian යෙක් විය. ශ්රී ලංකාවේ වඩාත්ම ගෞරවනීය සංගීත ian යෙකු ලෙස සැලකේ විජේවර්ධන 1960 ගණන්වල සිංහල සංගීතයේ විදුලි ගිටාරය භාවිතා කරමින් ශ්රී ලංකාවේ සිංහල පොප් සංගීතය විප්ලවීය වෙනසක් කළේය. ඔහු සිංහල පොප් සංගීතය කෙරෙහි ඇති බලපෑම නිසා, ඔහු බොහෝ විට ශ්රී ලංකාවේ පොප් සංගීතයේ පියා ලෙස නම් කර ඇත. ක්ලැරන්ස් විජේවර්ධන 1943 අගෝස්තු 3 වන දින ශ්රී ලංකාවේ හපුටේල් හි වතු වෛද්ය වෘත්තිකයෙකුට උපත ලැබීය. ඔහුගේ පවුලේ අය රත්නපුර බට්ගගෙදර වෙත පදිංචියට ගිය අතර ක්ලැරන්ස් පූර්ණ කාලීන සංගීතය ලුහුබැඳීම සඳහා වැළුමක් ලෙස ක්ලැරන්ස් කිනිතුල්ලක් අතහැරියේය. ඔහු හැටන් හයිලන්ඩ් විද්යාලයේ සිට යටවත්ත මහනේ විද්යාලයෙන් අධ්යාපනය සම්පූර්ණ කළේය. ඔහු ෂෙලා රාමදාස සමඟ විවාහ වූ අතර ඔවුන්ට එක් දියණියක් වූ අමිලා ප්රියදර්ශනී සිටියේය. උග්ර දියවැඩියාව නිසා කැඩී බිඳී ගිය ආමාශයික වණ හා ගැන්ග්රීන් වලට එරෙහි දීර් ques කාලයක් ශ්රී ලංකාවේ විජේවර්ධන 1996 දෙසැම්බර් 13 වන දින ශ්රී ලංකාවේදී මිය ගියේය.",
        "Lyrics of a song": "ආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\n\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\n\nතටු සිදිලා වැළපෙනවා.\nසිත ඇදිලා... හිනැහෙනවා...\nමල් ඇතිරූ... සුව යහනේ...\nමල් අතුරා පවන් සැලූ\nආදරවන්තයින් පෙළූ...\nබොළඳ කතා...\nආදරේට කියන කතා බොළඳ උනාට\n\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\nආදරේට කියන කතා බොළඳ උනාට\n\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට...\nමල් ගොමුවේ...\n\nතුරු සෙවනේ...\n\nහමුවෙනවා...\nවෙන් වෙනවා...\nඋයන් කොනේ...\nඅවන් හලේ...\nඋයන් කොනේ හමුවෙනවා\nඅවන්හලේ වෙන් වෙනවා\nබොළඳ කතා...\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට",
        "Songs": "සයිටිලා මාතේ, ගේන් ලීකා, ගෝමූ, හඩා විලේ, මිරෝ සඳගාවි, ජ්යාටා කැල්සා, ජ්යාටා කැට්සා - මාජ් පර්සිසා, කිමාඩා, කිමාඩා, කිමාඩා සීනා, කිරි සීනා කලම්බල ජනවා, කිරි දෙවන ස්ථානයට පත්විය",
        "email": ""
    },
    {
        "Name": "ඩැල්රීන් සුබී",
        "Birth Date": "",
        "City": "පිලියන්දල",
        "Biography": "ඩැල්රීන් සුබී යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි.ඩල්රීන් සුබී (ආර්නෝල්ඩා) යනු 1970 දශකයේ මුල් භාගයේ දී සිය වෘත්තීය ජීවිතය ආරම්භ කළ ශ්රී ලංකාවේ ජනප්රිය පොප් ගායකයෙකි.ඇගේ පෙර පහරවල් වලින් එකක් වූයේ 70 දශකයේ දී එළියට ආ \"නාඳුනන පිරිමි ළමයා\" ය.ඇය ඉංග්රීසි හා සිංහල යන දෙඅංශයෙන්ම ගමන් කරයි.ඇය මෑතකදී කැනඩාව සහ එක්සත් ජනපදය ජිප්සීස් සමඟ සංචාරය කළාය.",
        "Lyrics of a song": "ටික්කි ටිකිරි ටිකිරි සිනා පාලා..\n\nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..\nටික්කි ටිකිරි ටිකිරි සිනා පාලා.. \nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..\n\nපුංචි පුංචි මල් වැටිච්ච රෙද්ද ලස්සනයි\n\nදකින දකින අයගේ ඇස් පිනයි..... \nපරවී කිරිල්ලි වගේ ඉගිල්ලී........ \nපරවී කිරිල්ලි වගේ ඉගිල්ලී\nඈ යයි මුකුළු පෙන්නලා\nටික්කි ටිකිරි ටිකිරි සිනා පාලා.. \nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නල\n\nපුංචි නිලමේ හැංගි හැංගි ඇගේ රුව බලා\n\nආදරේට විහිළුවක් කලා...\n\nමැණිකේ ඔරවලා නිලමේ දෙස බලා\n\nමැණිකේ ඔරවලා නිලමේ දෙස බලා \nඈ යයි මුකුළු පෙන්නලා.......\n\nටික්කි ටිකිරි ටිකිරි සිනා පාලා..\n\nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..",
        "Songs": "ටික්කි ටිකිරි ටිකිරි සිනා පාලා, Adara Loke, Apa Dedena Pamanak, Chuda Manike, Gepelata Aawa, Kelle Kelle, Nalawena Mawu Ukule, Oba Ha Semada, Oba Ma Sathuwei Kiya",
        "email": "dalreen.suby@srilankasingers.com"
    },
    {
        "Name": "දමයන්ති ජයසූරිය",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "දමයන්ති ජයසූරිය යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "උන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nඔබ හදවත මා හඳුනාගත් සේ\nමා හදවත ඔබ හැඳින ගනීදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nචන්ඩ මාරුතේ ඉන්ද්රකීලයක් වගේ\nනොසැලී ඉන්නට වරම් ලැබේදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nඉඳුනිල් දෙනයන සටහන් වේ\nසමනල වසන්ත යෞවනයේ\nඉඳුනිල් දෙනයන සටහන් වේ\nහා-හා-හහා-හා-හහා-හා\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්",
        "Songs": "ඒඒ මාගා කෙට්ටි, ඒ.ඒ. මාගා කෙට්ටි, ඒ.ඒ.",
        "email": "damayanthi.jayasuriya@srilankasingers.com"
    },
    {
        "Name": "දමිත් අසන්ක",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "දමිත් අසංක යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "මං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා\n\nඅහස් මාළිගා නැහැ ඔබ නිසා මැවී\nසැක සංකා නැහැ ඔබ ගැන හිතේ රැදී\nහිමිකම් නොකියමි ඔබට මගේ කිසිදා\nඋරන නොවන්නෙමිඔබ අන්සතු වූ දා\n\nමං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා\n\nඅතැඟිලි බන්ඳන නපතමි පෙමින් බැඳී\nඔබ සිරකරලන දොරගුලු දමනු බැරී\nනෑකුල සිරිතෙන් සැලෙනා පෙමක් නොවේ\nපෙමට පෙමින් යන පෙම් ලොව මෙයයි අපේ\n\nමං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා",
        "Songs": "Adarara hitvawa, Adara ar Adare",
        "email": "damith.asanka@srilankasingers.com"
    },
    {
        "Name": "දසුන් මධුෂාන්",
        "Birth Date": "2-Feb-96",
        "City": "රත්මලාන",
        "Biography": "දසුන් මධුෂාන් (උපත 1996 පෙබරවාරි 2) ශ්රී ලාංකික ගායකයෙකි.ඔහු සිරාසා සුපර්ස්ටාර්ගේ පස්වන සමයේ ජයග්රාහකයා වේ.ඔහු මොරටුවා හි වේල්ස් විද්යාලයේ ප්රින්ස් හි අධ්යාපනය ලැබීය.මෙම තරගයේදී ෂිහාන් මිහිරංග බෙනට්ගේ කණ්ඩායමට මධුෂාන් සහභාගී විය.ඔහු විසින් කරන ලද සමහර ගීත, \"සීනියෝ\", \"සිංහ රෝගය\", \"මෙනික් අප්සුරාවි\", ඩෙකා ෆියානා ලෙස \"ප්රන්ෂා යුවතියලියන්\" හොඳ පිළිගැනීමක් ලැබීය.ඔහුගේ පළමු ගීතය වන්නේ ඔහු සිරා සුපර්ස්ටාර් කන්නයේ 3 ජයග්රාහක ශමිකා මඩුමාලි සමඟ ගායනා කළ ස්වප්නා තේමා ගීතයයි.පසුව ඔහු තම පළමු ඒකල ගීත \"අන්තරතු වී\" සහ \"මාජ් තරම් මාජ්\" ලෙස රචනා කළේය.",
        "Lyrics of a song": "සෙවනැල්ලට පාට ගේනා\nදේදුන්නක වර්ණ තවරලා\nදිගු ගමනක යන්න මා හා\nපය නොගැටෙන මාවතක් සොයා\n\nසීමා නැති ජීවිතේ\nපියඹමු අරමුණු සොයා\nතාමත් ඇත හදවතේ\nකාටත් නොකියා ලියා තියා\n\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ,\nඅපේ කාලේ\nකාටවත් කිසිදා අත නොපා සදා\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ,\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා\nහසරැල්ලක වාරු සොයලා\nනොපැකිලිව ම එන්න පියඹලා\nහෙට දවසට අර්ථයක් සොයා\nඅද වෙහෙසෙමු කාලයෙන් එහා\n\nසීමා නැති ජීවිතේ\nපියඹමු අරමුණු සොයා\nතාමත් ඇත හදවතේ\nකාටත් නොකියා ලියා තියා\n\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා",
        "Songs": "Sinhayo, Menik Apsaravi, Pransha Yuwathiyan, As deka Piyaana, Ansathu Wee, Mage As Walin, සෙවනැල්ලට පාට ගේනා",
        "email": ""
    },
    {
        "Name": "දයාන් විතාරණ",
        "Birth Date": "18-Apr-62",
        "City": "රාජගිරිය",
        "Biography": "දයාන් විතාරණ (1962 අප්රියෙල් 18), ශ්රී ලාංකික ගායකයෙක් සහ ඡායාරූප ශිල්පියෙකි. ඔහු බොහෝ ප්රභේදයක් හරහා ගීත 330 කට වඩා ගායනා කර ඇත. ඔහු 1962 අප්රියෙල් 18 වන දින නුවර එලියා හි වැඩිමහල් සහෝදරියන් දෙදෙනෙකු සමඟ පවුලේ ලාබාලතමයා ලෙස නුවර එලියාගේ උපත ලැබීය - නිරංජලී සුනේත්රා සහ නිර්මාල්ලි සාවතීරි. ඔහුගේ පියා පියසේන විතරණ පළාත් පාලන නිලධාරියෙකු වූ අතර මව නාලිනී ඩෙසිබෙල් ජයසූරිය ගෘහණියක් විය. ඔහු 1962 සිට 1967 දක්වා නුවර එලියා හි ජීවත් වූ අතර 1978 දී මහනුවර මහනුවරට ගියේය. ඔහු මහනුවර ධර්මරාජා විද්යාලයේ ප්රාථමික අංශයට ඇතුළු වූ අතර පසුව 1986 දී මාතලේ ශාන්ත තෝමස් විද්යාලයට ඇතුළත් වූ ඔහු කොළඹ ශාන්ත තෝමස් විද්යාලයට පිවිසියේය පවුල සමඟ සහ 1992 දී ස්ථිරවම පදිංචිව සිටින්නේ රාජගිරියේ කමතවට්ටේ ය. 1976 ජනවාරි 6 වන දින දයාන්ට වයස අවුරුදු 13 දී ඔහුගේ පියා වයස අවුරුදු 54 දී හෘදයාබාධයකින් මිය ගියේය. ඔහුගේ පියාගේ අභාවයෙන් පසු, ඔහුගේ මව ආහාර කුකීවත් පංතියක් සහ ඉඳිකටු වැඩ ආරම්භ කළහ. ඔහුගේ මව පිළිකා රෝගයෙන් පෙළුණු අතර වසර ගණනාවක් පුරා ඇය 2006 අප්රියෙල් 25 වන දින මිය ගියහ. හිටපු පාර්ලිමේන්තු මන්ත්රී ගාමිනි ජයසූරිය දයාන්ගේ මවගේ ous ාති සහෝදරියයි. දයාන් තනිකඩ වන අතර, ඔහු බුදුදහමට අනුව ජීවත් වන බැවින් අනාගතයේ දී විවාහ නොවන බව ඔහු පැවසීය.",
        "Lyrics of a song": "ඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සෙනෙහස ගොඩ ගලයි\nඋණුසුමට මාව තෙමෙයි...\n\nමා ඔබෙයි ඔබම කියයි\nඔබ මගෙද මටම භයයි\nමා ඔබෙයි ඔබම කියයි\nඔබ මගෙද මටම භයයි\nඔබ සදක් වගේ හැඩයි...\nහෙට අමාවක ද සැකයි...\n\nඔබ හැගුම් බරව දොඩයි\nඒ වදන් කවිම තමයි\nඔබ හැගුමබරව දොඩයි\nඒ වදන් කවිම තමයි\nඔබ වසන්තයක් වගෙයි...\nහෙට ගිමන්හල ද සැකයි...\n\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සෙනෙහස ගොඩ ගලයි\nඋණුසුමට මාව තෙමෙයි...",
        "Songs": "අහසා වජ්, ඇලන් නාල, ඒ.අයි.පී.",
        "email": "dayan.witharana@srilankasingers.com"
    },
    {
        "Name": "දයාරත්න පෙරේරා",
        "Birth Date": "",
        "City": "බත්තරමුල්ල",
        "Biography": "දයාරත්න පෙරේරා යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි.",
        "Lyrics of a song": "ඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nලවන් හසකැන් නුවන් කැල්මන් හොදින් හදුනන්නේ ආදරේ\nනුවන් රැහැනින් බැදෙන්නට පෙම්\nනොමැතිදො මා කෙරේ\nමගේ විජිතේ සිනහ නොමැතේ විඩාපත් වේද ජීවිතේ\nඔබෙ ඇසුරෙ ඔබේ සෙවනෙ නවාතැන් වෙද මා වෙතෙ\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nඔබෙ පෙම් ලොල් හදෙ නොකැලැල් ලැගුම් සොයමින් නුවන් අයා\nයොවුන් බිගු දැල් හෙලු හසරැල්\nමසිත සුසුමන් දවා ගියා\nමගේ විජිතේ සිනහ නොමැතේ විඩාපත් වේද ජීවිතේ\nඔබෙ ඇසුරෙ ඔබේ සෙවනෙ නවාතැන් වෙද මා වෙතෙ\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි",
        "Songs": "අතෝතෝ කොමිටා, අත්තතයි ඩී.",
        "email": "Dayarathne.Perera@srilankasingers.com"
    },
    {
        "Name": "දීපිකා ප්‍රියදර්ශනී පිරීස්",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "සාහිත්යය යනු ශ්රී ලාංකික ගායිකාවක්. ශ්රී ලංකාවේ වඩාත් ජනප්රිය කාන්තා ගායිකාවක් වන ඇය ගුසුයි සාම ත්යාගය පිරිනැමීමේ එකම ශ්රී ලාංකික හ call යයි. දීපිකා ප්රියදර්ශනී විසින් ජූලි 13 වන දින කලුබොවිල ප්රදේශයේ පවුලේ තුන්වන දරුවා ලෙස උපත ලැබීය. ඇගේ පියා, සුමනදාස පීරිස් ඉංජිනේරුවෙකි. ඇගේ මව කරුණා පීරිස් විශ්රාමික හෙදියක්. ඇය නුගෙගොඩ අනුලා විද්යාලයේ අධ්යාපනය සම්පූර්ණ කළාය. ඇයට වයස අවුරුදු 3 ක් වන විට මියගිය වැඩිමහල් සහෝදරයෙක්, අජිත් පීරිස් සහ එක් වැඩිමහල් සහෝදරියක් වන අජන්තා පීරිස් ඇත. ඇගේ බාල සොහොයුරිය වන ෂාලිකා පීරිස් ය. මුල් කාලයේ ඇගේ මව ශ්රී ලංකා ගුවන් විදුලිය පිළිබඳ විවිධ වැඩසටහන් සඳහා ගායනා කර තිබේ. මවගේ සහෝදරිය ප්රියා ගුණවර්ධන ද ගායකයෙකි. ඇය 1990 දී ඉන්දියාවේ බුතහන්න්ඩේ විශ්ව විද්යාලයේ (1 වන පන්තිය) (1 පන්තිය) (1 පන්තිය) (1 වන පන්තිය) සහ 2007 දී කෙලනියා විශ්ව විද්යාලයෙන් ජන සන්නිවේදනය පිළිබඳ ශාස්ත්රපති උපාධිය ලබා ගත්තාය. පසුව ඇය 2002 දී අධ්යාපන උපාධිය ලබා ගත්තාය. 15 වන දින 2018 අගෝස්තු 201, දීපිකා ඔහුගේ වෘත්තියෙන් බැංකුකරුවෙකු වන ලෝන්ග්ටිම් ටෝර්ස් හර්ට් චම්කා හේරත් සමඟ විවාහ විය. ගීත රචකයෙකු ලෙස චාමිකා දීපිකා විසින් ගූත ගායනා කරන ලද බොහෝ ප්රසිද්ධ ගීත රචනා කළේය.",
        "Lyrics of a song": "සමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\n▪︎▪︎▪︎\nනිල් වන රේඛාවේ රෑ කෝකිල ගී රාවේ\nකාලය පැන යයි එන්න ඉගිල්ලී - තාමත් සඳ ඇවිලෙයි\nනිල් වන රේඛාවේ රෑ කෝකිල ගී රාවේ\nකාලය පැන යයි එන්න ඉගිල්ලී - තාමත් සඳ ඇවිලෙයි\nදෙසිතක පෙම් සුවඳ නොහිම් - විඳිමු ඉතින් සමනළයෝ\n\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\n▪︎▪︎▪︎\nසුන්දර මල් වාරේ මල් සුවඳයි ගං තීරේ\nහිම කඳු යායේ පෙම් රජ දහනේ රෑටත් මල් පීදේ\nසුන්දර මල් වාරේ මල් සුවඳයි ගං තීරේ\nහිම කඳු යායේ පෙම් රජ දහනේ රෑටත් මල් පීදේ\nමියුරු සුරම් ගී මනරම් ගයමු ඉතින් සමනළයෝ\n\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා",
        "Songs": "අහසා namba Metharae, අහීනා ඩබ්ලිව්.ඒ.ඒ ඇස්, අනා වෝ කිරිකිකා, අයදාරාමන් ආර්කිකා, බෝදුකාර ආර්.ඒ.එස්.ඒ.ඒ.ඒ.ඒ.",
        "email": "deepika.priyadarshani@srilankasingers.com"
    },
    {
        "Name": "ඩෙස්මන්ඩ් ද සිල්වා",
        "Birth Date": "",
        "City": "මාතර",
        "Biography": "දශක හතරක ප්රසාංගික ක්රියාකාරිත්වය එතරම් වෙනස් වී ඇති \"බයිලා රජු\" ලෙස සැලකූ ඔහුගේ තරුණ හ voilder ට ඩෙස්මන්ඩ් ද සිල්වා ශ්රී ලාංකික ගායිකාවක් හා විනෝදාස්වාදියෙකි.දකුණු ශ්රී ලංකාවේ මාතරා හි උපත ලැබූ ද සිල්වා ලොව පුරා ප්රසංග ශාලා පැවරීම සඳහා දරා තිබේ.ඔහු විවාහ වී සිටින්නේ ඩෙනා ද සිල්වා සහ යුවළට පුතුන් දෙදෙනෙකු සිටින බැවිනි.වැඩිහිටි පුත් ස්ටීව් ද සිල්වා සිටියේ නර්තන ශිල්පියෙකි.කෙටි රෝගයකින් පසු ස්ටීව් කොළඹ පෞද්ගලික රෝහලකදී මිය ගියේය.",
        "Lyrics of a song": "ආයා දොම්පෙ ආයා දුකට සැපට කදිම දොම්පෙ ආයා\nදොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා \nඅංගො මන්ගො ලයිසා ලුසියා සිලියා මිසියා ඇගියා මැගියා\nපපිනගෙ දුව මහත ඩොලිය පුංචි බේබි කිව්වා මැණිකා\nගියා ගියා යන්ට ගියා ගමට ගිහින් එන්න ගියා \nනෑ නෑ තවමත් නෑ නෑ\nඑහෙම යයිද අපේ දොම්පෙ ආයා \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nපළල් උකුල ගස්ස ගස්ස ආයා යනකොට \nකොළඹ හතේ බෙන්ස් කාර් එනවනෙ ලඟට \nලක්සන ආයගෙ හැඩරුව හින්ද කරුමෙට \nනෝනා එනවා මහත්තයත් එක්ක යුද්දෙට \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nදොම්පෙ ඉඳලා කොළඹ ආවේ පුංචි ආයා දැන්\nහරි ලස්සන වෙලා මගේ නෝනා වාගේ පෙම් \nආදරේට අතින් ඇදල රහස කීවේ මං \nකැමති නැතුව වගේ යන්නෙ මොකද රත්තරන් \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nආයා වරෙන් මගේ ලඟට ගෝල් ෆේස් එකට යන්න\nඋඹේ ලස්සන රෝස පාට තොල් පෙති වල රස බලන්න\nරස බල බල අයිස් කිරිම් බාල්දියක් අරන් දෙන්න \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා",
        "Songs": "මේ සඳහා ඇමරිකානු බන්චා, මෙම පරාසය, ගැපේයි, ගැසෙබින්, හිස්ව ඇත",
        "email": ""
    },
    {
        "Name": "ධනපාල උඩවත්ත",
        "Birth Date": "1-Nov",
        "City": "මොරටුව",
        "Biography": "ධනපාල උඩවත්ත (නොවැම්බර් 1 වන දින), අදියර මගින් ජනප්රිය වූ නොවැම්බර් 1), ජනප්රිය, ශ්රී ලාංකික ගායිකාවක්.එළිමහන් අවධියේ අත්යවශ්ය ගායකයෙක්, තම දක්ෂතා පෙන්වීම සහ ඒ.ඊ.අයි.අයි.අයි.අයි.අයි.ඒ.",
        "Lyrics of a song": "මා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nඅව්ව වැස්ස රෑ දහවල් එකයිනෙ අපට\nඑකම සිතින් අවිත් ඉන්නෙ අපි සේවයට\nකිසිම බයක් දැනෙන්නෙ නෑ කොහොමත් හිතට\nසේවය කරනෙමි මිය යන තුරු ලක්බිමට\nමම සේවය කරනෙමි මිය යන තුරු ලක්බිමට\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nවීර පුතුන් බිහි කර රට රකින්න පුදනා\nඅම්මවරුන් පායුග වැඳ පුදන්න ඕනා\nඅම්මේ ඔබ කළ සේවය සදහට අගනා\nඉතිහාසයේ ලියවෙයි මතු දිනයක සොඳිනා\nලක් ඉතිහාසයේ ලියවෙයි මතු දිනයක සොඳිනා\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nඅම්මේ මම සිතුවේ මේ ලිපිය ලියන්න\nමේ සටනින් මා මියගිය දිනයක ඔන්න\nමා මෙහි නැති අඩුපාඩුව මකා දමන්න\nබාල පුතත් හමුදාවට බාර කරන්න\nඔබේ බාල පුතත් හමුදාවට බාර කරන්න\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි",
        "Songs": "Ae Neela Warala, මා ආදරණීය මගේ අම්මා වෙතටයි, Man Italiye Thani Una, Nelum Wile Nelum Nelana, Ranga Nadeeka",
        "email": "danapala.udawattha@srilankasingers.com"
    },
    {
        "Name": "ධනිත් ශ්‍රී",
        "Birth Date": "22-Dec-94",
        "City": "මහනුවර",
        "Biography": "(උපත 1994 දෙසැම්බර් 22) ශ්රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකු \"ලෙස උපත ලැබීය.ඔහු ශ්රී ලංකාවේ වඩාත් ජනප්රිය කලාකරුවන්ගෙන් කෙනෙකු ලෙස සැලකේ.ධනිති ප්රධාන ධාරාවේ සංගීත කර්මාන්තයට ඇතුළු වූයේ 2018 සිය 2018 සිය 2018 \"පණ්ඩමා\" පහරීය.මෙම ගීතයේ විකල්ප පාෂාණ හැඟීම අනුපූරක වන්නේ ඔහුගේ ඉහළ තන්ත්රයන් සහ ශ්රී ලංකාවේ සාම්ප්රදායික ඩ්රම් බීට්ස් සහ සංස්තරතීන් විසිනි.එය සහ ඊට සමගාමීව රූපවාහිනී සහ ගුවන්විදුලි ප්රචාරක වල අංක එකේ එක් අයෙකු බවට පත්විය.ධනිත් ශ්රී 1994 දෙසැම්බර් 22 වන දින ශ්රී ලංකාවේ මහනුවර උපත ලැබීය.ඔහු අධ්යාපනය ලැබුවේ මහනුවර විද්යර්ථ විද්යාලයේ සහ මහනුවර කිංස්වුඩ් විද්යාලයේ ය.ඔහු විදුලි හා ඉලෙක්ට්රොනික ඉංජිනේරු විද්යාව පිළිබඳ විශේෂ උපාධියක් සහිත පෙරඩෙනියා විශ්ව විද්යාලයෙන් උපාධිය ලබා ගන්නා ලදී.",
        "Lyrics of a song": "පන්දම රැගෙන යන්න එන්න මා හදවතට\nනෙතු දැහැන් බිඳිනා රන් සලුව ඇඳ\nලියතඹර ලෙලවා හද මඬල යට\nදෙන්න මැණිකෙ මගෙ පපුවට ගින්දර\n\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\nහදවත පතුලේ යකු බෙර වැයුනේ\nතම්දෙන තානේනේ නා\nඅනේ මගේ යකුනේ නටපන් හනිකේ\nතම්දෙන තානේනේ තානේනේ තානානේ\n\nතම්දෙන තානේනේ නා\n\nඉණ වට බැන්දා වූ මුතු පොට සැලෙනකොට\nපන්දම දැවෙනවා හද ගිනි ලවාගෙන\nවැහි කළුව එනවා නුඹ නැති දාට\nසිත් අහසම පුරවා අන්ධකාරෙක\n\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\n\nහදවත පතුලේ යකු බෙර වැයුනේ\nතම්දෙන තානේනේ නා\nඅනේ මගේ යකුනේ නටපන් හනිකේ\nතම්දෙන තානේනේ තානේනේ තානානේ",
        "Songs": "නෞකාව, පන්දම, සඳගනාව, ගින්දර, එහෙම දේවල් නෑ හිතේ මගේ, ආලෝකවර්ෂ, ආදරියේ, නිවාලන්න මා, රෝජා, වේදිකාවේ",
        "email": ""
    },
    {
        "Name": "දුශ්‍යන්ත් වීරමන්",
        "Birth Date": "7-Jun-80",
        "City": "කොළඹ",
        "Biography": "දුෂියන්ත් වීරමන් යනු ශ්රී ලංකාව, සිංගර්, නර්තන ශිල්පියෙකු වන අතර රියලිටරි දක්ෂතාවයේ ජයග්රාහකයා 2008 දී \"සිරාසා නර්තන තාරකා\" පෙන්වයි. ඔහු 2013 දී ශ්රී ලංකා සම්මානය ප්රදානය කරන ලද තරුණයින් 10 දෙනාගේ ජයග්රාහකයෙකිශ්රී ලාංකික පොප් - යුගල, බතියියා සහ සන්තුෂ් වලින් අඩක් වන සන්තූෂ් ද වූ තරුණ සහෝදරයා ද වේ.",
        "Lyrics of a song": "වාසනා ලොවක් ගෙනාව දිව්‍ය ලෝකෙ ඉඳලා ආව කෙල්ලේ \nසුරූපි කෙල්ලේ \nවේදනා ලොවින් මෙමාව ගලවගත්ත මා සුරූපි කෙල්ලේ \nසුරූපි කෙල්ලේ\n\nදුගී පැලක තරුණයෙක් අතේ \nරිදී මැණිකෙ රත්තරං නැතේ \nමාළිගාව හැරදමාලා ආවෙ ඇයි කඳේ\n\nදෙමාපියන් මුදල් වතුපිටි \nඑපා කියා පැලට ආ හැටි \nලොවට පෙන්නුවානෙ \nනියම ආදරේ හැටි\n\nරිදී ඉරයි වැහි වලාකුලේ\n\nපිපී සුවඳ දෙන නෙළුම් මලේ \nමගේ අන්ධකාර දවිය ඔබයි එළි කලේ",
        "Songs": "Pana Senehasa, Jeththu None, Vasana Lovak, Dedunna Wage, Mathake Hasarel, Nelum Vilen Pena, Omari Latha, Obawa Mata Himi Na, වාසනා ලොවක් ගෙනාව",
        "email": ""
    },
    {
        "Name": "එඩී ජයමාන්න",
        "Birth Date": "15-Feb-15",
        "City": "මීගමුව",
        "Biography": "එඩී ජයමාන්න, ඔහු 1911 පෙබරවාරි 15 ​​වන දින කිතුනු පවුලක් සමඟ ක්රිස්තියානි පවුලක් වන පෙරියමුල්ලාහි සහෝදර සහෝදරියන් හත් දෙනෙකුගෙන් යුත් පවුලේ ලාබාලම ලෙස ඉපදුණු ය. ඔහුගේ පියා වන ඩොන් තෝමස් මාරිස් ස්ටෙලා විද්යාලයේ ගුරුවරියකි. නෙගම්බෝ ශාන්ත පීතර විද්යාලය, නෙගම්බෝ සහ මාරිස් ස්ටෙලා විද්යාලයේ ශාන්ත පීතර විද්යාලය, නෙගම්බෝ හි පිහිටි ගෝනියාවේ හරස් විද්යාලයේ දී ඔහු අධ්යාපනය ලැබීය. ඔහුගේ වැඩිමහල් සහෝදරයා බී. ඒ. ඩබ්ලිව්. ජයමාන් සුප්රසිද්ධ සිනමාකරුවෙකු සහ නිෂ්පාදකවරයෙකි. එඩී විවාහක සෙසු මින්ඩර් ට්රෝරුප් ක්රීඩක රුක්මානි දේවි එකම නාට්යවලට සම්බන්ධ වීමෙන් ආදරයෙන් බැඳී සිටියේය. දේවිගේ දෙමාපියන් ඔවුන්ගේ විවාහ ගිවිස ගැනීම අධිකරණයට අභියෝග කළ නමුත් ඔවුන්ගේ විවාහය සමඟ ඔවුන්ට ඇතුළුවීමට ඔවුන්ට අවසර ලැබුණි. 1981 ජූලි 25 වන දින එඩී හෘදයාබාධයකින් මිය ගියේය. ඔහු අන්තිම දවස් කාලය තුළ 172, හන්දාලේ පල්ලියවත්ත පදිංචිව සිටියේය. ඔහුගේ මරණය අසල්වැසියෙකු විසින් වාර්තා කරන ලදී, පී.කේ. පියදාසා. ඔහුව නෙගම්බෝ හි \"හවලූකානා\" සුසාන භූමියේ තැන්පත් කරන ලදී.",
        "Lyrics of a song": "කොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nපිටකොටුවද මේ අනේ කඩ සාප්පු බොහො තිබේ\n\nපාර මැද්දෙ පීලි උඩින් ට්‍රැම් කාර් යනවනේ\n\nමහා පුදුමෙ මේක වේ තට්ටු දෙකේ බස්ය මේ ඒ පාරෙන් මේ පාරෙන් හරව හරව යනවනේ කොළොඹ ජැටියටා යමි නැව් බලන්නටා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nකොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nහන්දියෙ අර හිටන් ඉන්න රාළහාමි අත්දෙක මැෂින් එකක් වගේ නිකන් අර පැත්තට මේ පැත්තට හරව හරව පිටිපස්සට කාර් ලොරි බර කරත්ත බස් ඉස්ටොප් වෑන් එක මෙතන වදේ හරි ජරමර\n\nමොකද බොලේ මේ තරම්ම සෙනග කිව් එකේ අපේ ගමේ නාඩගමක් ඇවිල්ල ද මෙහේ කලිසම් ඇඳ බයිසි කලේ තරුණ තරුණියෝ ලැජ්ජ නැතුව යනව මොවුන් ගෝල් පීස් එකේ\n\nහො ගාන පොකුණටා යමි පා තෙමන්නටා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රී යා\n\nකොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රී යා",
        "Songs": "Thakkita Tharikita Udapana Natanna Hithuna, කොළොම්පුරේ ශ්‍රියා",
        "email": ""
    },
    {
        "Name": "එඩ්වඩ් ජයකොඩි",
        "Birth Date": "6-Apr-52",
        "City": "නුගේගොඩ",
        "Biography": "ජයකොඩි අරච්චිගේ දොන් එඩ්වඩ් ජයකොඩි මහතා ලෙස ජනප්රිය වූ අතර එය ශ්රී ලංකා සංගීත ian යෙකු, සිංගර් සහ රචනාකරුවෙකි. ජයකොඩි සංගීතය සිය ගණනක් සිංහල චිත්රපට සහ රූපවාහිනී අනුක්රමික සඳහා අධ්යක්ෂණය කර ඇති අතර ළමා ක්රමලේඛනය සඳහා (\"කොප්රා කොන්ෆාප්පා\") ගීත රාශියක් රචනා කර තිබේ. ගෙදරා බුඩුන් අම්මා චිත්රපටයේ හොඳම පිරිමි ගායකයා සඳහා ජයකොඩි 1987 දී ස්වර්ණ සංඛා සම්මානය දිනා ගත්තේය. ඔහු 1979 සහ 1980 දී හොඳම සංගීත අධ්යක්ෂවරයා වූ නාදාන් සහ උපපරෝදනිය සහකා සහා දණ්ඩුවමා යන නාට්ය සඳහා දිනා ගත්තේය. ජයකොඩි 1952 අප්රියෙල් 6 වන දින බාලම දරුවා දොන් අප්ෆියල් ජයකොඩි සහ හෙට්ටිමුල්ලා හි හෙට්ටිමුල්ලා, වික්ටෝරියා ජයකෝඩි සහ වික්ටෝරියා ජයකෝඩි සහ වික්ටෝරියා ජයකෝඩි සහ ශ්රී ලංකාවේ වික්ටෝරියා ජයකෝඩි සමඟ උපත ලැබීය. ඔහුගේ මව 2017 අප්රේල් 29 වන දින මිය ගියේය. ජයකොඩි බණ්ඩාරනායක කනිෂ් School පාසලේදී සිය මුල් අධ්යාපනය ලැබූ අතර ද්විතීයික අධ්යාපනය කෙගල් කෙගල්ලේ ශාන්ත මරියා විද්යාලයේ දී ලබා ගත්තේය. ඔහු පල්ලියේ ගායනයට සම්බන්ධ වූ අතර ශාන්ත මරියා නම් ශාන්ත මරියා හි පිහිටි සංගීතයට ඉගෙන ගත් අතර ශාන්ත මරියා හි ගුරු (එච්. ජයකොඩි විවාහ වන්නේ 1991 ජනවාරි 17 වන දින මංගල උත්සවය සමරනු ලැබූ ජනප්රිය ගීත රචක චරිතා ප්රියදාර්ෂානි සමඟ ය. මෙම යුවළට එක් පුතෙකු, චන්ද්රීයපා සහ එක් දියණියක් වන ෂරානි රාස්ෝඩි.",
        "Lyrics of a song": "මාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී\nහිතේ භෘංග සේනා කිපී රොන් මතින්\nසොයන්නේ නුරා පැන් තිගේ මල් මුවින්\nහිතේ භෘංග සේනා කිපී...\nආ... ආ... ආ...\nහිතේ භෘංග සේනා කිපී රොන් මතින්\nසොයන්නේ නුරා පැන් තිගේ මල් මුවින්\nසනසාලනූ ඒ පිපාසා...\nමාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී\nප්රභා රන් කැළුම් දී සලා නේත්රයන්\nනිවාපන් ළඳේ චිත්ත පීඩා නොහිම්\nප නි ස රි\nප නි ස ග\nනි ස ග ප නි ස නි ප ග ස නි\nප නි රි ස ස ග\nප නි නි ස ග රි රි රි ග රි ප ම ග රි ස නි\nම ග ස නි\nප්රභා රන් කැළුම් දී සලා නේත්රයන්\nනිවාපන් ළඳේ චිත්ත පීඩා නොහිම්\nරශ්මි දෙවා චන්ද්රයා සේ...\nමාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී",
        "Songs": "Adalayath Muhuda Deage, Adawan deain, Afawan ila, Afacha iman supehak, great ma or ma jagar Agawemak, Ana balage samein, Ana argar Sanda, Ana an an an an an an an",
        "email": "edward.jayakody@srilankasingers.com"
    },
    {
        "Name": "ෆීලික්ස් ඇන්ටන්",
        "Birth Date": "",
        "City": "බත්තරමුල්ල",
        "Biography": "ෆීලික්ස් ඇන්ටන් යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "නිලම්බරේ කැලුම් පිර් සරා සඳ වගේ මගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ නිලම්බරේ කැලුම් පිරී සරා සඳ වගේ ඔබේ හදේ සදා රැඳී ඉන්න මට සිතේ\n\nමියුරු තෙපුල් පවසා මා හද සනසනු මැනේ සිරිකත මෙන් මගෙ පැල තුල රැඳෙන්න පියබඳේ සුව සහනය මිහිර මවා එන්නෙමි ඔබ වෙතේ ඔබේ හිතට ආලෝකය වෙන්නෙමි හැම වෙලේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nමගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nඔබේ හදේ සදා රැඳී\n\nඉන්න මට සිතේ\n\nදිවිය සුමුදු මලින් පිරුණ සුව යහනක් නොවේ හිරිහැර මැද කඳුළ සුසුම ඇතිවිය හැක ලොවේ ඒ හැමටම මුහුණ දෙන්න සිතේ දිරිය ඇතේ\n\nපැමිණෙන සැප දුක එකලෙස විඳගමු ජීවිතේ\n\nනිලම්බරේ කැලුම් පිරී සරා සඳ වගේ මගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nඔබේ හදේ සදා රැඳී ඉන්න මට සිතේ\n\nලා ලා ලාලා ලා... ලාලා\n\nලා... ලා ලාලා\n\nලා... ලාලලා...",
        "Songs": "ආනාරා ප්රියා ලෑන්ඩ්, ඩිනිංග, දිනපාත අපපා, එක්මා ඉවාාවුව, හඩා ගී පොතේ, මාවා හඩ්, මල් මැඩබාස්, මල් නෙලාලා.",
        "email": "felix.anton @srilankasingers.com"
    },
    {
        "Name": "ෆෙ‍්‍රඩී සිල්වා",
        "Birth Date": "6-Feb-38",
        "City": "මොරටුව",
        "Biography": "හූප් ලියානගේ අතුකෝරලා මොරිස් ෆ්රෙඩී සිල්වා (1938 ඔක්තෝබර් 06 - 2001 ඔක්තෝබර් 06) සහ 2002 සිට 2002 දක්වා පෙනී සිටි ශ්රී ලංකා සිනමා නළුවා සහ පසුබිම් ගායකයෙකි. ෆ්රෙඩි වඩාත් ජනප්රිය ශ්රී එකක් ලෙස ප්රසිද්ධ විය 1960 සහ 1980 දශකයේ 1960 දශකයේ ලංකා විකට නළුවන්. ඔහු චිත්රපට 400 කට අධික සංඛ්යාවක පෙනී සිටි අතර සිංහල සිනමාවේ වසර පනහක් උත්සවයේදී 300 ක් ප්රදර්ශනය කෙරිණි. සිල්වා හි මොරටුවා පුවෙලාකාබා හි හූප් ලියානගේ අතුකෝරලා මොරිස් ජෝශප් රණබාහු ජෝශප් රණබාහු, එකම දරුවෙකි. සිල්වාගේ පියා මොරටුවා නාගරික කවුන්සිලයේ අවේක්ෂකයෙකු වූ අතර ඔහුගේ මව ගැලවීමේ හමුදාවේ සාමාජිකයෙකි. වැඩීම වැඩීම සහ ගායනය හා නැටුම් ගැන පුදුමයට පත් විය. ශාන්ත සෙබස්තියන් විද්යාලය ඔහුගේ අල්මා මාතෘකාව විය. 1950 දශකයේ දී සිල්වා සිල්වා විසින් ශ්රීමත් ජෝන් කෝටෙවලාවල ඉදිරිපිට \"බාර් තීරු තීරුව\" විසින් ඉටු කරන ලද අතර එය උණුසුම් ලෙස ලැබුණි. ගුවන්විදුලි ශිල්පීන්ගේ රැකියාවක් ලබා ගැනීම සඳහා ඔහු ගුවන්විදුලි සිලෝන් හි ලෞරි ලංකාවේ ලෞතික සිලෝන් වෙත ඉදිරිපත් කරන ලද කොටෙලවල නිර්දේශ කිරීමේ ලිපියක් ලබා ගැනීමට ඔහු මෙම අවස්ථාව භාවිතා කළේය. සිල්වාගේ පළමු පටිගත කිරීම \"මොට්පාල්\" ය. ඔහු \"බාර් තීරු බාර්\" සමඟ ගීතය අනුගමනය කළේ පී. එල්. සෝමපාල විසිනි. එය සාර්ථක විය. පසුකාලීනව ප්රේමකීර්ති ද අල්විස් සමඟ සිල්වා සමත් විය. ඔවුන්ගේ වැඩවලට \"අරොන් මාමා\", \"පැන්කිරිටා\", \"නෙදිරිට්ටා\", \"හන්යා මාමා\", \"කෙකිල් රාජ්ජුරුවෝ\" (ලොකුමා උනා කෝට්) සහ \"පරානා කබාය\" වැනි. සිල්වාගේ කිරුළු පළඳන ජයග්රහණය සුන්බුමානි \"කුන්ඩුමානි ලෙස සැලකේ.",
        "Lyrics of a song": "පාන් කිරිත්තා තක්කිට තරිකිට උඩ පැන පැන නටතෙයි පාන් කිරිත්තී රබාන අරගෙන කරබාගෙන වයතෙයි උන්ගේ පැටවුන් වටේට ඉඳගෙන දෑතින් හඬ තලතෙයි මේවා බල බල තනි කෑදැත්තෙක් කීචි බීචි කියතෙයි\n\nපාන් කිරිත්තා තමන්ගෙ පාඩුවෙ නැටුම පටන් ගත්තේ අහල පහළ කිසිවෙකුටත් ඒකෙන් හිරිහැරයක් නැත්තේ කොහේද ඉඳ පැමිණුනු කෑදැත්තා වහලා අර අත්තේ.. උන්ගේ නැටුමට බාධා කරමින් ගීය පටන් ගත්තේ\n\nපාන් කිරිත්තා තක්කිට තරිකිට උඩ පැන පැන නටතෙයි පාන් කිරිත්තී රබාන අරගෙන කරබාගෙන වයතෙයි උන්ගේ පැටවුන් වටේට ඉඳගෙන දෑතින් හඬ තලතෙයි මේවා බල බල තනි කෑදැත්තෙක් කීචි බීචි කියතෙයි\n\nපාන් කිරිත්තා නැටුම නවත්තා කේන්තියෙන් ආවා කෑදැත්තාගේ කළු අත්තටුවෙන් අල්ලා සෙලවුවා ඊට පස්සෙ ඌ සට සට ගාලා මොන මොනවද කීවා.. ළඟට කිට්ටු වී මා ද ගොළුවතින් ඊට සවන් පෑවා\n\nඅනුන්ගේ වැඩ ගැන විවේචනය කර කර ඉන්නවට වඩා තමන් දන්න දේ හරියට කරපන් කියලා කීය හඬා\n\nඅනුන්ගේ වැඩ ගැන විවේචනය කර කර ඉන්නවට වඩා\n\nතමන් දන්න දේ හරියට කරපන් කියලා කීය හඬා",
        "Songs": "Aron Mama, පාන් කිරිත්තා, Nedeyo, Handa Mama, Kekille Rajjuruwo, Parana Coa, Kundumani",
        "email": ""
    },
    {
        "Name": "ෆැලන් ඇන්ඩ්‍රියා",
        "Birth Date": "13-Sep-95",
        "City": "කලුතර",
        "Biography": "ශ්රී ලාංකික ගායකයෙක් සහ රංගන ශිල්පියෙක් විය හැකියි.ඇය සංගීතය ආරම්භ කළේ ඩෙරානා ඩ්රීම් ස්ටාර් සමයේ IX හි මාතෘකාව දිනා ගැනීමෙන් පසුවය.ඇය බොහෝ ප්රභේදවල විවිධාකාර ගායකයෙකි.ෆෑන් ඇන්ඩ්රියා 1995 සැප්තැම්බර් 13 වන දින ශ්රී ලංකාවේ කළුතාරා, රෙක්ස් ජැන්සන් හි වැඩිමහල් දරුවා ලෙස කළුතරා හි කළුතර සහ රජයේ නිලධාරියෙකු සහ රජයේ ගුරුවරියක වන රේණුකා ජැන්සන් ලෙසත් උපත ලැබීය.ඇයට බාල සහෝදරියන් දෙදෙනෙක් සිටී.හොලාන් සහභාගී වූයේ බම්බලපිටිය ශුද්ධ ගෘහ කන්යාරාමයට සහභාගී වූ ඇය ප්රධාන වශයෙන් පෙරදිග සංගීතය හැදෑරූ බවයි.පසුව ඇය ආචාර්ය නන්ද මාලිනීගේ පෙරදිග සංගීතය ඉගෙන ගත්තාය.ඇය උසස් පාසලෙන් පිටව ගොස් පෞද්ගලික සමාගමක සේවය කිරීමෙන් පසු මානව සම්පත් කළමනාකරණය හැදෑරූහ.",
        "Lyrics of a song": "මත් මධු පිරෙනා සද්දේ පල්ලා ප්‍රේම කරලා නෑ අත් අල්ලා පාරේ නින්දෙදි පෙනෙනා හීන හලාලා ආලෙට ලොල් වී හීන මැකීලා නෑනේ\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ\n\nනිතඹේ දෙනෙතේ පැටළේවී මාගේ\n\nපැටලී වෙන දේ නොදනීවී වාගේ //\n\nමා දිහා බලනා මල් සරුන් ඇස් ගසා මට නගනා සුරල් නැවතුම් නොම වේවි මා වෙත ළංවෙලා නෙත් වසා දහසක් බැමි මුදන් හිත් සොරා ගන්නම් ගී සරීන් කෙළවර නැති ප්‍රේම වේවි මංමුලා\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ.\n\nනිතඹේ දෙනෙතේ පැටළේවී මාගේ පැටලී වෙන දේ නොදනීවී වාගේ//\n\nමත් මධු පිරෙනා සද්දේ පල්ලා ප්‍රේම කරලා නෑ අත් අල්ලා පාරේ නින්දෙදී පෙනෙනා හීන හලාලා ආලෙට ලොල්වී හීන මැකීලා නෑනේ\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ.\n\nනිතඹේ දෙනෙතේ පැටළේ වී මාගේ පැටලී වෙන දේ නොදනීවී වාගේ //",
        "Songs": "දියණියයි ඈ, පෙම්මානේ, පැටලී, හාදු, ළමැද හොවාලා, මල්සර හීසර මානේ",
        "email": ""
    },
    {
        "Name": "ගාමිණී පතිරණ",
        "Birth Date": "",
        "City": "මොරටුව",
        "Biography": "ගාමන් පතිරාන මහතා අද ශ්රී ලංකාවේ පෙරදිග සංගීතයේ වඩාත්ම පළපුරුදු හා දක්ෂ සම්පත්දායකයින්ගෙන් කෙනෙකි.",
        "Lyrics of a song": "( ලෝකයා මැවූ දෙවි පියාණෙනි\nදෙවි පියා මැවූ පුත්‍රයාණෙනි...//)\nලොවට සැමට සෙත සදන්න\nලොවට ඉපදුණේ ජේසු තුමණි....\n\nදිළිඳු පැලක සීත රැයක බෙත්ලෙහෙම් පුරේ\nචමත්කාර තරු එළියෙන් ලොවට හෙළි කළේ \nජේසු නමින් අප මුදවන කුමරු ඉපදුනේ කුමරු ඉපදුණේ.....\n\nලෝකයා මැවූ....\n\nඅප වෙනුවෙන් දිවි පුදකළ වීරයාණෙනි \nසුමග දකින පාර කියන නියමුවාණෙනි\nපාප බිමට දහම් දෙන ජේසුතුමනි ජේසුතුමනි.....\n\nලෝකයා මැවූ....",
        "Songs": "රත්තරන් සීනා, නිල් ඩේස්, සීතා නිල්, නේහෝ athho Nawa, ඩොනි, ඔටෝමෝ, අෂේව්, සන්ධි ගායනා කරන්න",
        "email": "Gamini.Pathirana@srilankasingers.com"
    },
    {
        "Name": "ග්‍රේෂන් ආනන්ද",
        "Birth Date": "15-Mar-57",
        "City": "තංගල්ල",
        "Biography": "බජ්ජාල වලාව්වේ ග්රෙරීස් ආනන්ද අබේකූන් (1957 මාර්තු 15 - 2010 දෙසැම්බර් 15), 2010 දෙසැම්බර් 15), 2010 දෙසැම්බර්ප්රවීණ චිත්ර ශිල්පී ජෝතිපාල අගභාගයේ සිට මෙ.ආර්.ඔහු කොළඹ ශ්රී ලංකා ජාතික රෝහලේ ප්රතිකාර ලබමින් සිටියදී වයස අවුරුදු 52 දී මිය ගියේය",
        "Lyrics of a song": "හිම රේණු වැටෙනා සීතලේ\nනෙත ගාව රදවා ආදරේ\nසුදු සේල සුළඟේ පා කලේ\nඔබ නේද මාගේ බිසෝ\n\nරන් තෝඩු සැලෙනා රාවයේ\nසිත ගාව බැන්ඳු මාලිගේ\nරතු රෝස යහනා සෑදුවේ\nමට නේද මගෙ මල් සරෝ\n\nමදු පානයක් සේ ගෑවිලා\nයනවා ද දෙතොලේ ගෑවිලා\nමනමාලයන්ගේ චේතනා\nනොකියා ද පාලා සිනා\n\nමුතු මාලයක් සේ යාවුනේ\nඅපි ආත්ම ගණනේ පෑ සෙනේ\nමනමාලියන්ගේ චේතනා\nපවසාවි දෑසේ ලතා",
        "Songs": "අදාසා සීනී, අල්හායි සාගරි මා හැඩ් මැන්ඩෙයාර්, අකාශා ගංගා පැවේ ජෙනා, ඕලා සේරා, බේල් පන්කුල් නලා, දතා ලෙනා බන්ඩි වලලු, ඩැතාන ලෙනා බන්ඩාලේ.",
        "email": ""
    },
    {
        "Name": "ගුණදාස කපුගේ",
        "Birth Date": "7-Aug-45",
        "City": "ඇල්පිටිය",
        "Biography": "එලමුල්ලා කප්ගේ ගුණදාස (1945 අප්රියෙල් 7 අගෝස්තු 2003) ශ්රී ලාංකික ගායිකාවක්, සංගීත ian යෙකු, සංගීත අධ්යක්ෂ සහ පසුබිම්, මිතුරියක් වන සංගීත ian යෙකු විය.ඔහුගේ වැඩ සඳහා තෝරාගත් ඔහුගේ සංගීතය විදැහුම්භාවයේ සහ පද රචනා වල දාර්ශනික පසුබිම හේතුවෙන් ඔහු ශ්රී ලාංකිකයන් අතර හොඳින් ප්රසිද්ධ විය.",
        "Lyrics of a song": "බිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.\n\nට්රැක්ටරේ යකඩ ගජසෙන්\nකුංචනාදයෙන් ඇළලුණ\nවෘක්ෂ දේවතාවුන් බිම වැටී පණ ගසයි\nමිනී මල් පිපුණු සීතල\nනිම්න භූමියේ ඇටකටු\nසතර රියන් කඩ අහිමිව\nවිලාපය නඟයි.විලාපය නඟයි.!\n\nබිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.\n\nකැලෑ මල් පිපී රතු තොල්වලින්\nකෑ ගසා ඉල්ලන ජාතියේ නිධානය\nරන් රුවන් කරඩු කොයි.\nවෑකන්ද කඩා බිම් කටු\nකම්බියෙන් බෙදා මේ රණ\nබිමේ හිස ගසා දමනා\nකඩුව බිම දමවු... කඩුව බිම දමවු...!\n\nබිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.",
        "Songs": "ආන් නේජ් සල් අත්තට්, අබි.සරිකාආම් මාලු, ඒ.ඊ.",
        "email": ""
    },
    {
        "Name": "එච්.ආර්. ජෝතිපාල",
        "Birth Date": "12-Feb-36",
        "City": "කොළඹ",
        "Biography": "හෙට්ටියාරාචිගේ රෙජිනෝල්ඩ් ජිනෝල්ඩ් ජෝතිපාල (1936 පෙබරවාරි 12 - 1987 ජූලි 12), ජනප්රියව. ج00 සිංහල සිනමාවේ ශ්රී ලංකා පසුබිම් ගායකයෙකු මෙන්ම සිනමා නළුවෙකු විය. ශ්රී ලංකා චිත්රපට ඉතිහාසයේ හොඳම පසුබිම් ගායිකාව ලෙස ජෝතිපාල ඔහුගේ හ voice එඩි ජයමාන් සිට රන්ජන් රාමනායක දක්වා දිවුරුම් දුන්හ. ඔහු ඔපෙරා ගායකයෙකු ලෙස ද සේවය කළේය. ඔහු 1987 ජූලි මාසයේදී වයස අවුරුදු 51 දී හෘද අත්අඩංගුවට ගැනීමෙන් මිය ගියේය. හැට ගණන්වල අගභාගයේ සහ හැත්තෑව දශකය තුළින් සාදන ලද චිත්රපටවල අවිවාදිත තේරීම ජෝතිපාල මහතාය, ඔහු ක්රියා කිරීමට පටන් ගත්තේය. විශේෂයෙන් මොහොමඩ් රෆිහි ජනප්රිය හින්දි ගීතවල නාදවලට ගායනා කිරීම ගැන ජෝති විවේචනයට ලක්වුවද, ඔහු පී.වී. නන්දසිරි, ප්රේමසිරි කෙමදාස, සරත් දසනායක සහ මිල්ටන් මල්ලවරාච්චි. ජෝතිපාල ශ්රී ලංකාවේ පසුබිම් ගායනයේ කොඳු නාරටිය ලෙස සැලකේ. ඔහු සිය යුගයේ දශක ගණනාවක් තිස්සේ පුළුල් නළු වර්ග රාශියක් ප්රකාශ කර තිබේ. ගායනා කිරීමට අමතරව ඔහු චිත්රපට 33 කදී රඟපෑවාය.",
        "Lyrics of a song": "ආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nවේදනා කන්දේ ඉඳලා\nආදරේ දැක අත වනලා\nසුළඟේ පාවී සුසුම් හෙළා වී\nදුලීකා. දුලීකා. දුලීකා. දුලීකා.\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nචංචල සිතුවිල්ලේ මංගල ඕවිල්ලේ\nනැළ වී යන්නේ ඈ මෙසේ\nපෙම් මල් උයනට දෝ\nකඳුලැලි මුහුදට දෝ\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...",
        "Songs": "ආෂා රොනින් පිරුණී, අද්දතරා රාජා පුතා, ආදනාරි ආයි. අඩා",
        "email": ""
    },
    {
        "Name": "හෙන්රි කල්දේරා",
        "Birth Date": "19-Aug-37",
        "City": "මරදාන",
        "Biography": "ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි. කැල්ඩෙරා උපත ලැබුවේ 1937 අගෝස්තු 19 වන දින ය. වයස අවුරුදු 14 දී සම්පූර්ණයෙන්ම අන්ධව ඔහු සීටුවා බිහිරි හා අන්ධ පාසලට ඇතුළත් විය. එහිදී, අන්ධ සිසුන් සඳහා පන්ති පැවැත්වූ මාස්ට්රෝ සුනිල් ශාන්ත යටතේ කැල්ඩෙරා, මාස්ට්රෝ සුනිල් ශාන්තව අධ්යාපනය ලැබීය. පාසලෙන් පිටව ගිය පසු, කල්දේරා ශාන්ත ශාන්තව ජා-එලාහි දෙහියාගතාහි සිය නිවසේදී ඉගෙන ගත්තේය. කැල්ඩෙරා 1968 දී ගුවන් විදුලි ශිල්පික නිලධාරියෙකු බවට පත්විය. 1977 දී ඔහුගේ පළමු පහර ගීත කට්ටලය තාරා පෙටියම් හතර දෙනෙකු පටිගත කළේය. ඔහු සිය ජීවිත කාලය තුළ ශ්රව්ය කැසට් තුනක් සහ සංයුක්ත තැටි දෙකක් නිකුත් කළේය. ඔහුගේ බොහෝ ගීත වූයේ ඒකල සහ ළමා ගීත ය; කැල්ඩෙරා බොහෝ විට තමාගේම දරුවන් සහ මුණුබුරන් සඳහා ගායනා කළ බව පැවසේ. 1979 දී ශ්රී ලංකා අග්රාමාත්ය රණසිංහ ප්රේමදාස, කම්ල්ඩෙරා සඳහා නිවසක් පරිත්යාග කළේය. 1993 දී කැල්ඩෙරා කලාභහානා සම්මානය හිමි සම්මානය (කලාකරුවන් විසින් රාජ්යය විසින් රජය විසින් ලබා දෙන දෙවන ඉහළම සම්මානය). විශ්ව විද්යාල සහ රාජ්ය නොවන සංවිධානවල ශිෂ්ය ආයතන ජන සංගීතයට කළ සේවය අගය කිරීම ඔහුට ගෞරව කළේය.",
        "Lyrics of a song": "ඊයේ උදයේ ඔබ පොරුව මත දුටුවා හිතවතෙකු මගේ ඔබගේ ඔය සුරත දරා සිටියා....\n\nපුරුදු ලෙස මා ඔබ දකින්නට පැමින මංගල සිරියකි දුටුවේ.... සබේ කිසිවෙකු ඉබේ වත් නැත ඇසක් මා දෙස යොමා බැලූවේ කිමද මේ අරුමේ මට නොහැගේ ප්‍රිය සොන්දුරේ\n\nසොඳුර හෙට අප අළුත් ලොවකට පා නගන්නට සැරසෙන අතරේ එසේ මා දුටු එවන් සිහිනය මෙසේ අද මා හිතට වද දේ කිමද මේ අරුමේ මට නොහැඟේ ප්‍රිය සොන්දුරේ",
        "Songs": "තාරා පතාරයා, පෙනිනා සුවය, මිථ්යූලය සුරු, ලංකා මාජ් ලංකාව, මොකාඩා නාගෝ, සයිසිලා පෙවෙයාර්, සිසිල වෙලිවේ, මල් නපු වෙන්නි,",
        "email": ""
    },
    {
        "Name": "ඉන්ද්‍රානි පෙරේරා",
        "Birth Date": "15-Feb",
        "City": "බොරැල්ල",
        "Biography": "ශ්රී ලාංකික ගායිකාවක් සහ පසුබිම් ගායකයෙකි. ඉන්ද්රානි සහ ක්ලැරන්ස් විජේවර්ධන සහ ඇනස්ලි මැලේවානා සමඟ \"මුල් සිංහල පොප් ට්ටියෝ\" ලෙස හැඳින්වේ. ඇය පෙබරවාරි 15 ​​වන දින බොරෙල්ලා හි උපත ලැබූවාය, පවුලේ ගැහැණු ළමයින් තිදෙනාගෙන් දෙවැන්නයි. ඇගේ පියා අබේපාල පෙරේරා බෞද්ධයා සහ මවක් වූ අතර මියියෙල් පෙරේරා කිතුනුවෙකි. ඇයට එක් වැඩිමහල් සහෝදරියක් වන මල්ලිකා සහ එක් බාල සොහොයුරියක් වන ඉරංගනී ඇත. ඉන්ද්රානි රීජන්ට් වීදියේ ප්රෙස්බිටේරියානු බාලිකා පාසලේ අධ්යාපනය ලැබීය. ඇය පාසලේ කන්දියන් නර්තනය හැදෑරුවා. ඇගේ සහෝදරිය මල්ලිකා 1965 සිට 1965 සිට ගායනය කරමින් සිටි අතර එහිදී ඇය සමාජ චිත්රපටයේ පසුබිම් ගායකයා විය. ඇය 1979 දී ජේම්ස් ශ්රී නිව්වාසන් සමඟ විවාහ වී ඇත. මෙම යුවළට එක් දියණියක්, අංජලී චාරුචි සහ එක් පුතෙකු වූ දේවෝතෝ නිමේන්ද්ර ධනන්ජය. නයිමේන්ද්ර රොෂානි සමඟ විවාහ වී සිටී. ඔහු ශාන්ත තෝමස් විද්යාලයට ගියේය. ඊට පස්සේ ඔහු රාජකීය ආයතනයේ උසස් පෙළ හැදෑරුවා. පසුව 2009 දී නයිමේන්ද්ර ව්යාපාර අධ්යයනය පිළිබඳ උපාධියක් ලබා ගත්තේය.",
        "Lyrics of a song": "සුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසිහිනෙන් වගේ මැවිලා පෙනේ\nමාගේ හදේ මිහිරක් දැනේ\nසිහිනෙන් වගේ මැවිලා පෙනේ\nමාගේ හදේ මිහිරක් දැනේ\nආලේ ඔබේ මටනේ ප්රියේ\nආලේ ඔබේ මටනේ ප්රියේ\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nමධු මල් පිපෙන්නේ අපි දෙන්න හින්දයි\nබඹරුන් හඬන්නේ මල් හී විදින්නයි\nදෙනෙතේ රැඳෙන්නේ ඔබගේම රුවමයි\nමන මත් කරන්නේ මල් හී සරාමයි\nහිතවත් කියන්නේ ඔබ මාගේ හින්දයි\nහිතවත් කියන්නේ ඔබ මාගේ හින්දයි\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා",
        "Songs": "අදාරා නංගි, අඩාරා කියානා ඩැනන් එන්ඒ, අහසතා සඳ, අන්දර, අන්දර ආටා, අහිනා සුඩූ අහාටා, අත්තහමි නෙත් ඩේල්, අහිගිලි නෙත් ඩේල්, අත්තගිලි නෙත් ඩේල්, හග් එෆ්.අයි.ඊ.",
        "email": "indrani.perera@srilankasingers.com"
    },
    {
        "Name": "ඉශාක් බෙග්",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "ඉශාක් බෙග් යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "කෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකැදැල්ලෙ උන් කිරිල්ලී\nඅන්න ගියා ඉගිල්ලී\nකැදැල්ලෙ උන් කිරිල්ලී\nඅන්න ගියා ඉගිල්ලී\nළමෝ ලපටි උදම් වී\nඅර ගයා නටති මගුල් ගී\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකුරුළු කෙළි බලන්නේ\nකිචි බිචි ගා අඬන්නේ\nකුරුළු කෙළි බලන්නේ\nකිචි බිචි ගා අඬන්නේ\nසද්දෙට පොඩි ළමුන්නේ\nඅනේ පුංචි එකා බයයි නේ\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nකෝටුකෑලි සොයාලා\n\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා",
        "Songs": "අ.",
        "email": "isaq.beg@srilankasingers.com"
    },
    {
        "Name": "ඉන්ද්‍රචාපා ලියනගේ",
        "Birth Date": "13-Jan-82",
        "City": "කොළඹ",
        "Biography": "ශ්රී ලාංකික ගායිකාවක් ද වේ.ඔහු සිය පළමු ඇල්බමයේ අබින්ෂ්ක්රමනයා (නැවත සකස් කිරීම) සම්පූර්ණ කර ඇති නමුත් එය නිල වශයෙන් තවමත් නිදහස් කර නොමැත.ඉන්ද්රකූප ලියානගේ 1982 ජනවාරි 13 වන දින ශ්රී ලංකාවේ කොළඹ, හොරානා හි රාජකීය විද්යාලයේ උපත ලැබීය. කොළඹ ආනන්ද විද්යාලය.ඔහුගේ සංගීත වෘත්තිය ආරම්භ වූයේ 2000 වර්ෂයේ ය.ඔවුන් හරිත නිම්නායි නම් ඇල්බමයක් නිකුත් කළ අතර එය ඉතා සාර්ථක නිවේදනයක් වන අතර ඇල්බමය ඔවුන්ව විශාල විදුලි පංකාවකට හඳුන්වා දුන්නේය.නමුත් 2004 සහ 2005 වර්ෂවලදී ඔවුහු තම ව්යාපෘතිය වසා දමා වරින් වර එකට වැඩ කළද, ඔවුන් තමන්ගේම සංගීතය ලබා ගත්හ.",
        "Lyrics of a song": "හේමන්ත නිද්රාවේ\nගිලෙන හැන්දෑවක\nනිසලතාවයේ මතු වෙන්නේ\nඔබෙ දෑස පත්ලේ ඇවිලෙනා\nප්රේමා ධ්යාශයයි\n\nසිහිනේ උමතු නිම්නේ\nමා හුදකලාවේ නොහෙලා\nආදරේ දෙවඟන හැම රාත්රියකම\nහැම හිමිදිරියක හැම දහවලකම\nවෙලී ගයන්න එනු මැන සුප්රානො හඬින්\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් නාද සංරචනයේ\nහැම ස්වරයකින්ම වෑහෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\n\nසඳ දිය දහරාවේ\nපෙඟෙන ලැම බෙයද\nනග්න තලාවේ මතු වෙන්නේ\nඔබේ සියුමැලි සිරුරේ උමතු ආලිංගනයයි\n\nසිහිනේ උමතු නිම්නේ\nමා හුදකලාවේ නොහෙලා\nආදරේ දෙවඟන සදහටම එකට\nඑක ආදරයක එක මිහිරියාවක\nගිලී රඟන්න එනු මැන පිලුම් මතින්\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් රංග වින්යාසයේ\nහැම රැඟුමකින්ම මැවෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් නාද සංරචනයේ\nහැම ස්වරයකින්ම වෑහෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\nහැම රැඟුමකින්ම මැවෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි",
        "Songs": "අබිෂ්නායා, අන්සරීයා, ජිනීඩල්, ඉරදුනා අතතී, සිංගයෝ, උඛකපතියාක්, අශුද්ධ",
        "email": ""
    },
    {
        "Name": "ජනක වික්‍රමසිංහ",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "ජනක වික්රමසිංහ යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "දෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nදෙතනේ ලෙලෙනා\nරන් මිනි තෝඩු දවටන්ො\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා\nදෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nසමනල මලුවෙරන් වැලි වෙහෙරේ මුදුනත සේම මට දැනෙනා\nසොබනිගෙ සෙනෙහේj\nගෙපැලට වඩනා සුබ හෝරාව ලං වෙනවා\nයමු රජුනෙ පමා වෙනවා\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා\nගොම මැටි ඇති රැැ\nතනිකඩ ගෙපැලේ\nසිරිලිය සේම ඇැ හිදුවා\nගමිමානෙ පුරා\nකල එලි කරවා\nමම හද්දා මගුල් කනවා\nමෙි පිං උබට පිහිටනවා\nදෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nදෙතනේ ලෙලෙනා\nරන් මිනි තෝඩු දවටන්ො\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා",
        "Songs": "Api Katha Nokara Imu Sina Novi Imu Tika Dawasak, Balikaviyan Taksala Doren Issilila Horen Balavi, Kohe Ho Oba Hindinam Sathutin, Ranchu Gasena Kolu Rane Sindu Kiyana, Saumya Wanthiye Sitha Sanasana, දෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා",
        "email": "Janaka.Wickramasinghe@srilankasingers.com"
    },
    {
        "Name": "ජයතිස්ස හෙට්ටිආරච්චි",
        "Birth Date": "",
        "City": "හෝමාගම",
        "Biography": "ජයතිස්ස හෙට්ටිආරච්චි යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "මහමෙව්නා උයනේ සිරි මා බෝ සෙවණේ\nසල් මල් පෙත්තක් දුටුවා හේවිසි හඬ මැද්දේ\nඒ ඔබදෝ මෑණියනේ //\n\nඔබ මා අත හැර ලොවින් නික්ම ගිය\nදවස තාම මතකයි//\nපියාණනේ ඔබ හෙළ විරුවන්\nගැන කියූ අයුරු මතකයි.\n\nලෝවාමහාපායේ පෙරළුණු ගල් අතරේ\nනිදිකුම්බා මල් පොකුරක් \nහිනැහේ මා දකිමින්\nඒ ඔබදෝ පියාණනේ //\n\nදින දින මා සෙවණේ පණ ගන්වා\nඋණුසුම මට ගෙනදී//\nකුසගිනි නොතකා\nමා කුස පුරවා හැදූ නිබඳ පණ දී\n\nඒ මල් පෙති අතරේ සුවඳ දැනෙන අරුමේ\nතවමත් මිනිසුන් අතරේ රැඳුනා මා ඔබ මෙන් \nජීවිතේ රැඳී ඉමි \n\nඒ ඔබදෝ මෑණියනේ \nඒ ඔබදෝ පියාණනේ//",
        "Songs": "සඩාවන් සංගලා, සඩා හායි කුමුදුයි, මිනි මුතු කුලා, ඩෙන්සි තියුලා, නවිටිමා, නීලාහිමාටා, සදතිමටා, සදතිමටා, සදතිමටා, සදතිමටා",
        "email": "Jayathissa .Hettiarachi@srilankasingers.com"
    },
    {
        "Name": "මිල්ටන් පෙරේරා",
        "Birth Date": "5-May-38",
        "City": "කොළඹ",
        "Biography": "මිල්ටන් පෙරේරා ලෙස ජනසිංහ අරච්චිිග්, ශ්රී ලංකා සිනමාවේ ගායකයෙක්, රචනාකරුවෙකු සහ පසුබිම් ගායකයා විය. ශ්රී ලංකාවේ වඩාත්ම ගෞරවනීය කලාකරුවෙකු වන මිල්ටන් පෙරේරා විසින් දශක තුනකට වැඩි කාලයක් තිස්සේ පැවති වෘත්තියක බොහෝ චිත්රපට සඳහා ක්රීඩක ක්රීඩිකාවන් රාශියක් විවිධාකාර කලාකරුවන් සඳහා සිය හ voice ට ය. ඔහු 1960 සහ 1970 දශක සමයේදී ශ්රී ලංකා සිනමාවේ ප්රමුඛ පසුබිම් ගායිකාවක් විය. මිල්ටන් උපත ලැබුවේ 1938 මැයි 5 වන දින ජේ. ඒ. එඩ්වින් පෙරේරාගේ පුත් ජේ. එඩ්වින් පෙරේරාගේ පුත් ජේ. එඩ්වින් පෙරේරා විසින් සිදු කරන ලද තබ්ලා ප්ලේයරයෙකු වන තබ්ලා පොඩි අප්පුහාමි ලෙසද හැඳින්වේ. ඔහුගේ මව ප්රේමා වික්රමරාච්චි ය. ඔහුගේ පියාගෙන් ආනුභාව ලත්, මිල්ටන් තබ්ලා ගැන තරුණ වියේදී ප්රවීණ විය. පෙරේරා පොඩි අප්පුරාමිගේ කෙට්ටු, අහිංසක තරුණයෙකි. ඔවුන් ජීවත් වූයේ හරිත වීදිය නමින් හැඳින්වෙන කොටහේන සංගමත්ත මවාටා හි ය. ඔහුගේ පියා වීදිය දිගේ ඉඩමක කුඩා නිවාස මාලාවේ ආඩම්බර හිමිකරුවෙකි. පියා සහ මිල්ටන් ජීවත් වූයේ එම නිවසක ය. අනෙක් සියලුම නිවාස කුලියට දෙන ලදී. පොඩි අපහාම්හි පළමු නිවස කුලියට ගත් අතර එම මිනිසාට හිමාලාතා නම් මිනිසාට ලස්සන දියණියක් සිටියේය. ඇය හරිම ලස්සනයි, සරාගී පෙනුම, හරිත වීදියේ අසල පිහිටි පාසලේ අසල පිහිටි පාසලේ ඉගෙනුම ලැබූ අතර, කොටහේනා මධ්ය මහා විද්යාලය ලෙස හැඳින්වේ. මිල්ටන් මැලේ හම්පලතාට තම ආදරය ප්රකාශ කිරීමට උත්සාහ කරයි. ඇය ජනප්රිය වූයේ මාලා ලෙසයි. ඔහු පාසල්වල වෙනත් සිසුන් හරහා ආදර ලිපි යැවූ අතර ඔවුන් කිසිදු වේලාවක ආදරයෙන් බැඳී සිටියහ. ඉතින් මිල්ටන් ගායනා, 'අරන්නා අදාරයි) ඔහුගේ පෙම්වතිය වෙනුවෙන් කැප කර ඇත. ඔවුන් විවාහ වී ඇත්තේ දරුවා පමණක් ලෙසයි. පසුව මාලා මිල්ටන් අතහැර මුස්ලිම් මිනිසෙකු සමඟ ජීවත් විය. මිල්ටන් පසුව නිළියක් වූ කල්යානායි පෙරේරා සමඟ විවාහ විය. ඔවුන්ගේ විවාහ මංගල්යය 1969 සැප්තැම්බර් 26 වන දින සමරනු ලැබීය. ඔවුන්ට පුතුන් තිදෙනෙකු සිටියහ. චලක චැම්පාති, අරොසා අසංග සහ පමෝඩා පියුෂාන්. මිල්ටන් 1991 ඔක්තෝබර් 24 වන දින මිය ගියේය. මිල්ටන්ගේ මතකයේදීම ප්රියංකරේරා පෙරේරා සහ චලකර චැම්පතිෙයි පෙරේරා මහතා ජේ.ඒ. මිල්ටන් පෙරේරාගේ ගීත දිගටම කරගෙන යයි. වැඩිමහල් පුත් ප්රියංකර පෙරේරා කීවේ සුප්රසිද්ධ නිළියක් වන දිලානි ඒකනායක සහ ඔවුන්ට එක් පුතින් දිල්මමින් පෙරේරා සිටී. ඔහුගේ දෙවන පුත් චලක චමුපති පෙරේරා පද්යි රණසිංහ සමඟ විවාහ වී ඇති අතර ඔවුන්ට එක් දියණියක් අංජන දසුන් පෙරේරා සහ එක් පුතෙකු වන චමත් චමුති පෙරේරා සිටී",
        "Lyrics of a song": "මගෙ දෑසෙ කඳුළු තව දෑසක\nසතුටු කඳුළු වෙයි\nඅද ඇත ඇය මට හිමි නැති\nමගුල් පෝරුවේ //\nමට ඇය දුන් වේදනා\nඇගෙ දෑසින් තේරුණා //\nමිලින කළේ ඇයි මැණිකේ\nපරම චේතනා\nපරම චේතනා\nමගෙ දෑසෙ කඳුළු තව දෑසක...\nනොඉඳුල් පෙම මා පැතූ\nඔබ කළ හැටි අන් සතූ //\nමට දුන් දුක නොදෙනු මැනවි\nඔහුට මින් මතූ\nඔහුට මින් මතූ\nමගෙ දෑසෙ කඳුළු තව දෑසක... //",
        "Songs": "ඇඩෙයි සමන් වල්, අඩාර් රන් ඔන් ඔෆ් අහාසා රන් ඔවෙන්ට, ආහාසා අබු ෆන්චි පුතා, ඇලෙහ් සන්තෝවාක් ඉන්න්, ආසා රන්දුණ තන්නවල, අන්ද",
        "email": ""
    },
    {
        "Name": "ජගත් වික්‍රමසිංහ",
        "Birth Date": "10-Apr-66",
        "City": "කොළඹ",
        "Biography": "ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි. ඔහු ශ්රී ලංකා ගුවන් විදුලි සංස්ථාවේ වත්මන් සභාපති වේ. වික්රමසිංහ ඉංජිනේරුවෙකු ලෙස වෘත්තියක් අනුගමනය කළ නමුත් පසුව ඔහුගේ දෙමාපියන් මෙන් සංගීත ian යෙකු වීමට තීරණය කළේය. ශ්රී ලංකා ගුවන්විදුලි සංස්ථාවට අයත් දුම්රිය ස්ථානවල ඔහුගේ ගීත වාදනය කිරීමෙන් පසුව ඔහුගේ වෘත්තිය ආරම්භ විය. ඔහු සීසන් සුපර්ස්ටාර් හි පළමු විනිසුරුවන් තිදෙනාගේ පළමු විනිසුරුවන් තිදෙනා 1 සිට 3. ඔහු උපත ලැබුවේ 1966 අප්රේල් 10 වන දින කොලොන්නාවේ ය. ඔහුගේ පියා එල්.කේ. කේ. කේ. කේ. ඔහුගේ දෙමව්පියන් බොහෝ දුරට ශ්රී ලංකාවේ සංගීත වැඩසටහන් රාශියක් සමඟ සම්බන්ධ වී සිටියහ. එමනිසා, ඔහු තම දෙමව්පියන් තම පෙරහුරුව අතරතුරදී කළ ඕනෑම දෙයක් ගායනා කර සෙල්ලම් කළා. ඒ දවස්වල ඔහුගේ ගායන හා ක්රීඩා කරන උපකරණවල හැකියාව ඔහුගේ දෙමාපියන් විසින් සොයා ගන්නා ලදී. 1972 දී ඔහු මරදාන අශෝක කනිහතා විද්යාලයේ අධ්යාපනය ලැබූ අතර 5 ශ්රේණියේ ශිෂ්යත්වය ලබා ගනිමින් ඔහු ආනන්ද විද්යාලයට ඇතුළත් වූ අතර ඔහුගේ දෙමව්පියන් තම දෙමාපියන්ට අනපේක්ෂිත ලෙස මාරුවීමක් ලබා දී ඇත අනුරදාපුර. පාසැලේදී, ඔහු ඉංජිනේරු නැඹුරු වී ජී. සී. උසස් පෙළ / එල්එස් සඳහා ගණිතය අධ්යයනය කළේය. පසුව ඔහු සිවිල් ඉංජිනේරු පා course මාලාවක් හැදෑරූ අතර ගොඩනැගිලි ඉදිකිරීම සඳහා විශේෂිත වූවකි. සුෂිත් විශාරද තෙවන කොටස හා මියුසල්ස් ඩිප්ලෝමාව, ඉන්දියාව, සංගීත ඩිප්ලෝමා හි සංගීත ඩිප්ලෝමාව පිළිබඳ සංගීතය (VOCAL) අනුගමනය කරමින් වික්රමසිංහ සිය සංගීත දැනුම ඉටු කළේය. ඔහු, ඔහු බාර්කැන්දේ සංගීත ආයතනයේ තබ්ලා තබ්ලා තබ්ලා විසින් ප්රතාතමා විභාග සංගීතය (උපකරණ) තබ්ලා කළේය. ඔහු බටහිර සංගීත ත්රිත්ව විද්යාලයේ ශිෂ්යයා විය. වර්ෂ 2000 දී ඔහු ගයානි කොහොනා සමඟ විවාහ වුණා.",
        "Lyrics of a song": "ඔබත් මමත් හිඳිනා මේ ලොව තුළ\nකඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nඅවිගැටෙනා බිම් තලය පුරා\nයුධයේ ගිණිදැල් පැතිරෙන්නේ\nදුක් විළාපයයි මිනිසුන්නේ යුධ වැදී කුමට මේ එකම පොළොව මත\nඑකම ලෙයින් අප සැඳුනේ\nඑකම සුසුම් ළය රැඳුනේ\nඔබත් මමත් හිඳිනා මේ ලොව තුළ\nකඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nරකිමු මිනිස්කම් භේද නොවී\nකුළගොත් උස් මිටි කම් දුරලා\nසතුරු සිතුම් අත් හැරලා\nකුසගින්න අවිදරා දැවේ ළපටි සිත්\nකඳුළු පිසිමු දරුවන්නේ\nසතුට බෙදමු මිහිමඩලේ\nඔබත් මමත් හිඳිනා මේ ලොව\nතුළ කඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු",
        "Songs": "ආඩරියා සඳුන් ඩේන්, අඩරා හි පුදුනා, අද්මාරි පාවරි, අම්මා වහීඒ, ඇම්මා, ඇන්ඩ්රා බවාන්, ඇම්මා, ඇන්ටා එක්කා, අසතා ආසා හමුන්වානා ඩී, ඒ.ඒ.ඒ.ඒ.ස",
        "email": ""
    },
    {
        "Name": "කමල් අද්දරආරච්චි",
        "Birth Date": "5-Feb-62",
        "City": "කොළඹ",
        "Biography": "ශ්රී ලංකා චිත්රපට හා ටෙලිඩ්රාමා නළුවා, සිංගර් සහ ඉදිරිපත් කරන්නා යන උපත ලැබූ) වේ. ඔහු 1981 දී ගාමිනි ෆොන්සේකාගේ සගරායාක් මෙඩා හි නළුවෙකු ලෙස ආරම්භ කළේය. ඔහු තවමත් පාසලේ ශිෂ්යයෙක් විය. 1970 දශකයේ අග භාගයේ ඔහු බොහෝ චිත්රපට හා ටෙලිඩ්රාමා වල විවිධ භූමිකාවන්හි පෙනී සිටියේය. අද්දරච්චි චිත්රපට 40 කට අධික, ටෙලිඩ්රාමා 20 ක්, අදියර 6 කට අධික ප්රමාණයක් උපයා ඇති අතර 1993 දී ඇග්නිඩියා හි සොබානාගේ චරිතය වෙනුවෙන් සරසවිය හොඳම නළුවාගේ සම්මානය දිනා ගෙන තිබේ සප්තා කන්යා චිත්රපටයේ දැක්වූ දමයන්ති ජයසූරිය සමඟ. සිරාසා සුපර්ස්ටාර්, යථාර්ථයේ සංදර්ශනයක්, යථාර්ථයේ සංදර්ශනයක්, සහ හිරු මෙගා තාරකාවන්ගේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ පළමු කන්නයේ සත්කාරකයා ද ඔහු ද විය. එච්. ආර් ඔහු කොළඹ වෙස්ලි විද්යාලයෙන් අධ්යාපනය සම්පූර්ණ කළේය. ඔහු කලා කෘති කෙරෙහි මූලික උනන්දුවක් දැක්වූ අතර, ඔවුන් සංගීතය, සිංහල සාහිත්යය, කන්දියන් නැටුම් හා විවාදය, සියල්ලටම එකවරම කිරීමට පෙලඹුණි. ඔහු පාසලේ සිටියදී 'සිංහල සාහිත්ය සමාජයේ' ලේකම් ලෙස පවා සේවය කළේය. ඔහු අනුරානි අද්දරච්චි සමඟ විවාහ වී ඇති අතර පුතුන් දෙදෙනෙකි. ඔහු ඉංග්රීසි ගුරුවරයෙක් විය.",
        "Lyrics of a song": "උන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nඔබ හදවත මා හඳුනාගත් සේ\nමා හදවත ඔබ හැඳින ගනීදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nචන්ඩ මාරුතේ ඉන්ද්රකීලයක් වගේ\nනොසැලී ඉන්නට වරම් ලැබේදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nඉඳුනිල් දෙනයන සටහන් වේ\nසමනල වසන්ත යෞවනයේ\nඉඳුනිල් දෙනයන සටහන් වේ\nහා-හා-හහා-හා-හහා-හා\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්",
        "Songs": "රීමු, දේෙව් ලෑන්ඩ්, ඩේවී, එකා ලඩ්කි, ගාසල් ගී, මල් යෙලා සීතා ඩැහාන්, යූමද වු ප්රේමදාර්-සප්තා කන්යා, වෙස්සා වැටුප සමජාතීය",
        "email": ""
    },
    {
        "Name": "කරුණාරත්න දිවුල්ගනේ",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "කරුණාරත්න ඩිවුල්ගනේ ගායිකාවක් සහ ශ්රී ලංකාවේ සම්භාව්ය සංගීත ian යෙකි.ඔහු 2006 නොවැම්බර් 13 සිට 13 නොවැම්බර් 13 දක්වා සහ 2015 ජනවාරි 27 සිට ශ්රී ලංකාවේ උතුරු මැද පළාතේ ආණ්ඩුකාරවරයා ලෙස සේවය කළේය. 2011 දී තවත් බොහෝ සම්භාවනීය අමුත්තන් සමඟ විකාශන කුළුණක් නැවත විවෘත කිරීමට ඔහු සහභාගී විය.",
        "Lyrics of a song": "මා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nතොරතුරු විමසනවා ආගිය තැන් පවසනවා\nතොරතුරු විමසනවා ආගිය තැන් පවසනවා\nසංසාරේ හුරු පුරුදුයි කියලා කියනවා\nකියලා කියනවා\nමා ඔබත් එක්ක දිගට කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nරස රහස් කියනවා විටකදී ඉඟිත් කරනවා\nරස රහස් කියනවා විටකදී ඉඟිත් කරනවා\nඇවිදින්නට තනිවෙන්නට යමුද අහනවා\nයමුද අහනවා\nසඳ හිරුත් එක්ක හොරෙන් කතාවක්\nතරු මාත් එක්ක ප්රේම කතාවක්\nවරදක් නැහැ කියනා\nකවුරුත් නොම එයි සිතෙනා\nවරදක් නැහැ කියනා\nකවුරුත් නොම එයි සිතෙනා\nසිපගන්නට ලංවෙන්නට එන්න අහනවා\nඑන්න අහනවා\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්",
        "Songs": "අදාරා ඩෙන්නන්නා පයලා, අදාලුයා සුන්දා භටතා, අශමෙනා බාලන, අන්දරා යේම් an ana maha moda at an ana maha ouda waile, atheethayay sihinayak pamanak pamanai, අ",
        "email": "Karunarathna_Divulgane@srilankasingers.com"
    },
    {
        "Name": "කසුන් කල්හාර ජයවර්ධන",
        "Birth Date": "3-Nov-81",
        "City": "රාජගිරිය",
        "Biography": "වෘත්තීයමය වශයෙන් කසුන් කල්හාරා ලෙස හැඳින්වේ, ශ්රී ලාංකික ගායකයෙක්, සංගීත ian යකු, වාචික පුහුණුකරුවෙකු සහ වාර්තා නිෂ්පාදකවරයෙකි. කසුන් සිය සංගීත දිවිය අතරතුර ඇල්බම තුනක්, හරිත නිම්නායි, රැඩිකල් ප්රේමයා සහ ආදර ඔපෙරාව නිකුත් කරන ලදී. ඔහු ශ්රී ලංකාවේ විශාලතම හා වඩාත්ම අලෙවි වන සංගීත කලාකරුවන්ගෙන් කෙනෙකි. කසුන් 1981 නොවැම්බර් 3 වන දින ශ්රී ලංකාවේ රාජගිරියේ රාජගිරියා හි උපත ලැබීය. ඔහුගේ මව මලනි බුලත්සිංහල ප්රවීණ කටහ and ගායනාධිකාරියක් වූ අතර ඔහුගේ පියා එච්. එම්. ජයවර්ධන සුප්රසිද්ධ නිර්මාපකයෙකු විය. ඔහුට බාල සොහොයුරියක්, 1991 දී වයස අවුරුදු තිදෙනාදී මියගිය නාර්මානි චායා. කල්තාරාගේ සංගීත වෘත්තිය ආරම්භ වූයේ 2000 වර්ෂයේ ඉන්ද්රකා ලියානාගේ සහ ඔහුගේ පාසැල් මිතුරන් සමඟ ය. ඔහුගේ මව ඔහුගේ සංගීත වෘත්තියට බෙහෙවින් සහයෝගය දැක්වීය. පුවත්පත් සම්මුඛ පරීක්ෂකවරයෙක් ඇයගෙන් ඇසුවේ \"ඔබේ ජීවිතයේ අමතක නොවන දිනය කුමක්ද?\" ඇය පිළිතුරු දුන්නේ \"මාස්ට්රෝ ප්රේමසිරි කෙමාදාසගේ පළමු සංගීත ප්රසංගය (ස්වයංක්රීය කසුසාගේ රැළි) ය. කසුන් ඒකල ප්රසංග ගණනාවක් පවත්වා ගෙන ගොස් ඇති අතර, \"කසුන් කල්හාරා\" වැනි වෙනත් කලාකරුවන් සමඟ සහයෝගයෙන් කටයුතු කර ඇත. 4u: ප්රසංගයේදී ජීවත් වන්න \"සහ\" ඔබට ආදරය කරන්න: ප්රසංගයේදී ජීවත් වන්න \". කසුන් කාලරා සංස්කෘතික කම්පනය (2013) රූගත කළේ සුන්දර සුන්දර (2013/2017) සහ සියලු ප්රසංග තුනේ වඩාත්ම සහභාගී වූ සංගීත සංදර්ශන තුනෙනි. සිදුවීම් තුන.",
        "Lyrics of a song": "ආදර මල් වල පාට කියන්නද\nඒ වගෙ ලස්සන තව නෑ\nඒ වගෙ ලස්සන තව නෑ\nමීදුම් පිණි පොද දෑස වසන් කළ\nසමනල් සිහිනය පිපුනා\nසමනල් සිහිනය පිපුනා\nදේදුණු රේඛා දෑසම තවරා\nතවමත් මල් සිට බලා සිටිනවා\nමීදුම තවරා සුළඟට\nඈතක සගවා තුන් සිත\nදෑස හොරෙන් ඈත සොයනව\nඅඳුර මැදින් එන්න සදලියේ\nදේදුණු සායම දෑසම බොද කර\nමාලති යායක හැගිලා\nමාලති යායක හැගිලා\nසීතල හිම කඳු යායක පියමැන\nදෙව්ලිය සිහිනෙක වැඩියා\nදෙව්ලිය සිහිනෙක වැඩියා",
        "Songs": "අච්රියා රාවටා, අහින් සිතියම්, අහින් ගීතාක්, අහසිං ගීතාක්, අහසින් ඊහා, අෂී ගාතා, ඩිජේ",
        "email": ""
    },
    {
        "Name": "කීර්ති පැස්කුවල්",
        "Birth Date": "29-Jan-56",
        "City": "මහනුවර",
        "Biography": "කීර්ති පැස්කුවෙල් මෙන්ම කීර්ති පැස්කුවෙල් ලෙස වෘත්තීමය වශයෙන් ප්රසිද්ධව සිටින පැස්කෙල් වසල් වසල් වලාම් ආනන්ද කීර්තිරත්න ශ්රී ලංකාවේ මහනුවර ප්රවීණ පොප් සංගීත ian යෙකු හා නිර්මාපකයෙකු වේ. ඔහු දශක තුනකට වැඩි කාලයක් තිස්සේ රඟපාමින් සම්මාන ගණනාවක් ජයගෙන තිබේ. කීර්ති ජාතික යථාර්ථය පිළිබඳ විනිසුරුවරයෙකු වන අතර 'ඩෙරානා ඩ්රීම් ස්ටාර්' 2008 සිට අද දක්වා යථාර්ථවාදී සංදර්ශනයක් ලෙස අඛණ්ඩව රියැලිටි සංදර්ශනයක දී අඛණ්ඩව සෘතු 10 ක් සඳහා වන එකම විනිසුරුවරයා ලෙස වාර්තා කරයි. ඔහු සංගීත අධ්යාපනයේ සහ සමාජ සුභසාධනයේ ක්රියාකාරීව කටයුතු කර ඇත. කීර්ති 1978 දී මුදිතා ප්රනාන්දු සමඟ විවාහ වූ අතර දියණියක් සහ පුතෙකු සිටියේය. ඔහුගේ වැඩිමහල් දියණිය වන දිනේෂා පැස්කුවෙල් දැන් එක්සත් රාජධානියේ වාසය කළේ තම සැමියා සහ පුතා සමඟ ය. ඔහුගේ පුතා කසුන් පැස්කුවෙල් එක්ස්පෝලන්කා සමූහය සඳහා වැඩ කරයි. කසුන් චෙතන රණසිංහ සමඟ විවාහ වී සිටින අතර ඔහු සංගීත ක්ෂේත්රයේ පිපෙන. 1994 දී ඔහුගේ පළමු විවාහය අවසන් වූ අතර ඔහු 1995 දී චන්දන මුදලිගේ සමඟ විවාහ විය. ඔහුට චන්දනා මුදලිගේ සමඟ විවාහ විය. ඔහු නීති උපාධිධාරියෙකු හා නටාලියා පැස්කුවෙල් - ව්යාපාර කළමනාකරණ උපාධිධාරියෙකි. ඔහුගේ දරුවන් සිව්දෙනාගේ එකමුතුකම හා සැලකිලිමත් ආකල්ප නිසා මිහිපිට වාසනාවන්තයා තමා බව කීර්තිට හැඟේ. 1996 දී ඔහුට ජපානයේ ලෝක විද්යා කවුන්සිලයේ ජාත්යන්තර සම්මානයක් ලබා ගත් අතර එහිදී රටවල් 13 ක සංගීත ians යන් සමඟ තරඟ කළේය.",
        "Lyrics of a song": "සඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nමන්දිරේ කවුළුවෙන් මං මේ උදේ\nනෙත් පුරා බලා ඉඳින්නේ රූ ඔබේ\nමන්දිරේ කවුළුවෙන් මං මේ උදේ\nනෙත් පුරා බලා ඉඳින්නේ රූ ඔබේ\nඔබට රහසේ ප්රේමාදරෙන්\nපුරවන්කෝ රත්තරං\nඔබට රහසේ ප්රේමාදරෙන්\nපුරවන්කෝ රත්තරං\nසඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nවෑහෙනා මුත් ඒ මනෝ ලෝ චේතනා\nපෙම් කරන්නත් නෑ ප්රියේ පිං වාසනා\nවෑහෙනා මුත් ඒ මනෝ ලෝ චේතනා\nපෙම් කරන්නත් නෑ ප්රියේ පිං වාසනා\nපාළු රාත්රියේ සඳ රේණුවෙන්\nපුරවන්කෝ රත්තරං\nපාළු රාත්රියේ සඳ රේණුවෙන්\nපුරවන්කෝ රත්තරං\nසඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා",
        "Songs": "Adara siha sanasana, Andura Geta Ea, Aradhana, aya dompe asya, babanda kina, Konaapana Kahapa, dasaa ma රක්සා, දයාවා පාමුල, දයාවා පීඒ, ඩේස්",
        "email": "Keerthi_Pasquel@srilankasingers.com"
    },
    {
        "Name": "කිත්සිරි ජයසේකර",
        "Birth Date": "",
        "City": "බත්තරමුල්ල",
        "Biography": "කිත්සිරි ජයසේකර යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකු හා ගායකයෙකි",
        "Lyrics of a song": "ඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nමහා දුකකී පෙමින් පතනා පැතුම් ගංඟා\nමහා දුකකී පෙමින් පතනා පැතුම් ගංඟා\nසමාවක් නෑ ලොවේ වරදක් නැතත් හන්ඟා\nසැපේ උල්පත් ඇරේ ප්රේමේ නමින්\nඅවසානේ ආවසානේ\nසැපේ උල්පත් ඇරේ ප්රේමේ නමින්\nඅවසානේ ආවසානේ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nදැනේ පිටුපෑ ලෙසින් පරසුන් හැන්ඟුම් සන්කා\nදැනේ පිටුපෑ ලෙසින් පරසුන් හැන්ඟුම් සන්කා\nපිරේ ලතැවුල් ලයේ පුරනා පෙරුම් රන්ඳා\nපිරේ රස හසුන ඔබගෙන් මා ලැබූ\nඅවසානේ අවසානේ\nපිරේ රස හසුන ඔබගෙන් මා ලැබූ\nඅවසානේ අවසානේ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ",
        "Songs": "අමිෂා, අම්මා, ඩෙල්වා පහාන්, ගිනී මලක්, කෙතාසි කේටි කත්තක්, මේජ් මැන්රීම බිස් බින්නේ, ඔය එස් පියනානා, ඔයා",
        "email": "kithsiri.jayasekera@srilankasingers.com"
    },
    {
        "Name": "ක්‍රිශාන්ත එරන්දක",
        "Birth Date": "",
        "City": "අනුරාධපුර",
        "Biography": "ක්රිෂාන්ත එරන්දකා ද සිටී. ජනප්රිය ශ්රී ලාංකික සංගීත ian සහ ගායකයා",
        "Lyrics of a song": "වී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ දෙතොලේ මොලකැටි බව\nනාඳුනන ලෙසින්\nනා දළු වැඩි සුමුදු වෙතැයි\nකියමි ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ සොඳුරු මුව මඩලේ\nකැළුම් මම දුටිම්\nපුර පස හඳ ඔබ පරදයි\nකියමි ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ ආදර නිමල දියේ\nසිහිලස ලද මං\nතිබහට බොර වු වතුරක්\nබොන්න ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්",
        "Songs": "Ahankara Stree, Ahaseth Netha, Api Wenama Handamu, Awuwe Muthu Eta, Bohoma Hanika, Ege Namin, Hadawathak, වී පැදුරෙන් ඉගිලී යන",
        "email": "krishantha.erandaka@srilankasingers.com"
    },
    {
        "Name": "කුමාරසිරි පතිරණ",
        "Birth Date": "",
        "City": "නුගේගොඩ",
        "Biography": "කුමාරසිරි පතිරාන ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "එදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබට මෙන් ආදරෙයි\nනිසලවි නෙත්පියා\nගියත් සැගවී ඔයා\nනෙතේ කදුලැල් තියා\nඅදත් මතකයි ඔයා\nනොයෙනා ගමන් ගියේ නම්\nඔබ දුන්නු දුක් සුසුම්\nමේ හිතට ආයේ නම්\nවිදින්න බැහැ රත්තරං\nපණ සේ රකින්නම්\nපියුමක් ලෙසින් මං\nකුලුදුල් සෙනෙහේ තරම්\nදෙයක් තව නෑ උතුම්\nඑදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබ නොමැති ලෝකයේ\nහිටියේ මම පාළුවේ\nඇවිත් සිත සැනසුවේ\nඇය තමයි ඔබ වගේ\nපැතුම් බිදිලා ගිහින්\nවින්ද දුක් මා සිතින්\nනිමා කර ඒ සුසුම්\nලන්වූ ඇයයි උතුම්\nඑදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබට මෙන් ආදරෙයි\nනිසලවි නෙත්පියා\nගියත් සැගවී ඔයා\nනෙතේ කදුලැල් තියා\nඅදත් මතකයි ඔයා",
        "Songs": "Hade gini, hada maage ridum denawa, guru paare, desithaka senehasa, amme kiyannam, එදා පෙම් බැන්ද ඔබමයි",
        "email": "kumarasiri.pathirana@srilankasingers.com"
    },
    {
        "Name": "කුමාරි මුණසිංහ",
        "Birth Date": "",
        "City": "කඩවත",
        "Biography": "",
        "Lyrics of a song": "අහස පොලොව උහුලනවලු\n\nඉරත් හඳත් මුහු වෙනවලු පටන් ගත්තු දාට ආදරේ... සිනහ පඳුරෙ කඳුළු සුසුම් පොකුර ආදරේ නෙතට පිරිත් පැන් ඉහිනා සුතුර ආදරේ කඳුළු වදුලෙ සිනහ පොට්ටු නටන ආදරේ සිතට තට්ටු කරන සිහින කෙවිට ආදරේ...\n\nආදරේ.... ආදරේ...\n\nආදරේ.... ආදරේ...\n\nඅවේලාවේ හීන මවන හීන මානෙ දෙපළු කරන මුරණ්ඩුකම දුන්නු ආදරේ...\n\nරෑ තුන් යම\n\nරෑ තුන් යම පාළු මකන නිවම හිනැහෙන මුමුණන තුරුණු සිරිත සොඳුරු ආදරේත්‍ව\n\nසාගරේට කඳුළු හදන මහ සුළඟට සුසුම් බෙදන විනයක් නැති දැහැන ආද.....\n\nහිතෙන් හිතට...\n\nහිතෙන් හිතට ඉව අල්ලන නෙතින් නෙතට මාරු කෙරෙන දාර්ශනික දහම ආදරේ..\n\nඅහස පොලොව උහුලනවලු...\n\nආදරේ... ආදරේ..////",
        "Songs": "අහස පොලොව උහුලනවලු",
        "email": "kumari.munasinghe@srilankasingers.com"
    },
    {
        "Name": "ලහිරු පෙරේරා",
        "Birth Date": "18-Apr-84",
        "City": "උඩුගම්පොළ",
        "Biography": "1984 අප්රියෙල් 18 අපේ අදියර නිගමනය මගින් ද හැඳින්වේ.ඔහු උපත ලැබූ හා හැදී වැඩුණේ උඩුගම්පෝලාහි කෙහෙල්බද්දරයේ දීය.ඔහුගේ නවතම ව්යාපාරයක් අතර සුවඳ සුවඳ විලවුන් සහ කොලෝන්ස් නම් සුවඳ විලවුන් රේඛාවක් ඇතුළත් වේ.",
        "Lyrics of a song": "සුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nගං දෑල නං නපුරුයි වගේ\nනාඩන් නගේ මං දැන් ළඟින් ඉන්නේ\nඅයියා මගේ කවදත් හොඳයි\nසැමදා ළඟින් ඉන්නේ මගේ පණ සේ\nපුන් පෝදා සෑ මළුවේ\nමට පිටුපා ඔබ උන්නේ\nසිටියා බලා ඔබ හිනැහෙයි කියා\nදුටුවේ නෑ පියමං කලා\nසඳ එළියේම නොපෙනී ගියා\nසුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nඅප්පච්චි ළඟ උන්නා\nනැද්දෝ අයියා දුටුවේ\nහිනැහෙමි කියා මා සිතුවත් හොරෙන්\nදුක ඉවසාන පිටුපා ගියා\nඒ දුක් ගින්න හදෙහී දරා\nසුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nගං දෑල නං නපුරුයි වගේ\nනාඩන් නගේ මං දැන් ළඟින් ඉන්නේ\nඅයියා මගේ කවදත් හොඳයි\nසැමදා ළඟින් ඉන්නේ මගේ පණ සේ",
        "Songs": "රම්බරරි, රම්බරරි වන මෑන්බන්දු හද්රණ්ඩු, ලාන්ග් බෑන්ඩ්ලිය, පාවේන්, රාතු රතකජු, ඩෙසේන් පේෂ",
        "email": ""
    },
    {
        "Name": "ලක්ෂ්මන් හේවාවිතාරණ",
        "Birth Date": "",
        "City": "හෝමාගම",
        "Biography": "",
        "Lyrics of a song": "මං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nහිස තියාන මා ළය මඩළ පුරා\nඋණු කඳුළුවලින් නම් තෙමන්න එපා\nමගෙ ලයේ කඳුළු ඇහැරෙන හින්දා\nදැන් හිනාවෙන්න මා දිහා බලා\nදැන් හිනාවෙන්න මා දිහා බලා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nඑක කඳුළක සීතල වුණත් එදා\nඅපි දෙකට බෙදාගෙන විඳ ගත්තා\nඒ සීතල යළි නුඹ ළඟ තියලා\nරත්තරනේ මං යන්නෑ කිසිදා\nරත්තරනේ මං යන්නෑ කිසිදා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ",
        "Songs": "Akeekaru Hitha, Api Ape We, Bithu Sithuwam, Gam Dorakada, Dakinna Amme, මං අහන්නෙනම් නෑ රත්තරනේ",
        "email": "lakshman.hewawitharana@srilankasingers.com"
    },
    {
        "Name": "ලක්ෂ්මන් විජේසේකර",
        "Birth Date": "",
        "City": "ගල්කිස්ස",
        "Biography": "ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායක ලක්ෂ්මන් විජේසෙකරිස්",
        "Lyrics of a song": "ඇති දේ ඇති සැටියෙන් ලොව දකින මිනිස්සූ ලද දේ සිත සතුටින් විඳ වෙසෙන මිනිස්සූ පොළවේ මිහි සයනේ ගොඩ නැගූ මිනිස්සූ කරුමේ කිම වද වෙන හිරු සදිසි මිනිස්සූ\n\nපොළවේ බිම අහසේ ඉම බෙදන ලෝකයේ දහමේ ගුණ පඉරු තුල නිදන යාමයේ ඉඳ හිටි සපැමිණ සිත් සතන් සැහැස්සූ කරුමේ කිම වඳවෙන මල් සදිසි මිනිස්සු\n\nඉතිරී ගිය ඉසුරින් නෙතු වැසුනු කාලයේ දිවියේ දුක විඳිනා දන නොදුටු ලෝකයේ සෙත් කවි සේ ලඟ සිට සිත් සතන් සැනැස්සූ කරුමේ කිම වඳවෙන සඳු සදිසි මිනිස්සූ.. කරුමේ කිම වඳවෙන හිරු සදිසි මිනිස්සූ.. කරුමේ කිම වඳවෙන මල් සදිසි මිනිස්සු..",
        "Songs": "Ai Tharahin, ඇති දේ ඇති සැටියෙන් ලොව දකින මිනිස්සූ, Bala Lamawarune, Balanna Ara, Dalwu Pahan, Dalwu Pahan - Reka Tele, Daranna Beri, Datha Depa Lana Gigiri Sarin",
        "email": "lakshman.wijesekara@srilankasingers.com"
    },
    {
        "Name": "ලලනි සෝමසිරි",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "ලාමා පෙටියා විද්යාවේදී සිය වෘත්තීය ජීවිතය රැස් කිරීම 1967 Thadaid Slobby චිත්ර ශිල්පියෙකු වන 'සහ' නොඅයි නිගි ජි '",
        "Lyrics of a song": "මේ අපේ මාතෘ භූමියයි\n\nනිදහසේ ස්වර්ග රාජ්‍යයයි.\n\nසම්බුදු සරණින් බැබළන ලංකා ලංකා සදහම් සරණින් සුපතල ලංකා - ලංකා මඟ සඟ රුවණින් රැක දුන් ලංකා - ලංකා ඉපදුන පින් කෙත සිරි ලංකා - ලංකා\n\nදෙදහස් වසරක උරුමය ලංකා - ලංකා නිදහස් මත යළි මතු කල ලංකා රන් කෙත සිරියෙන් දුදුළන ලංකා ලංකා යසෝ උදානය වේ සිරි ලංකා - ලංකා\n\nපිත් සුවඳින් ලොව මත් කල ලංකා - ලංකා පිතු සුවඳේ සුළඟත් සිරි ලංකා මා දිවියේ අරමුණ ඔබ ලංකා රත්න දීපයයි උදාර ලංකා - ලංකා",
        "Songs": "Obe Ruu Siri, Makaa Kaluwara, Sasara Magaka, Monara Kikiliye, මේ අපේ මාතෘ භූමියයි",
        "email": "lalan.somasri @srilankasingers.com"
    },
    {
        "Name": "ලලිත් පොන්නම්පෙරුම",
        "Birth Date": "15th September",
        "City": "බොරලැස්ගමුව",
        "Biography": "ලලිත් පොන්නාමපෙරුමා යනු ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "අහිමි කලත් ලොව\nමට පෙම් බැදි ඔබ\nනොනිමි සෙනෙහසය\nබැමි තනවා\nඅහිංසකයි ඔබ කුමක් කරන්නද\nතනිවෙන්නම් කදුලැලි සගවා\nතනිවෙන්නම් කදුලැලි සගවා\nශෝකතැවුල් සන්තාප නොවෙන්නයි\nකුළුදුල් සෙනෙහස විවර කලේ\nදහසක් පැතුමන් හද පුරවාගෙන\nමෙයටද අප ආදරය කලේ\nහුදකලාව මා සිටි බව දැනගෙන\nඅනියත යැයි ලොව පවසාවී\nමා මල දවසේ මගේ සොහොන් කොත\nපිවිතුරු සෙනෙහස පවසාවී",
        "Songs": "කඩුලින් නිමා, කඩුලින් නිමා, කදුලින් නිමා, කදුලින් නිමා,",
        "email": "Lalith_ponnamperuma@srilankasingers.com"
    },
    {
        "Name": "ලතා වල්පොල",
        "Birth Date": "11-Nov-34",
        "City": "ගල්කිස්ස",
        "Biography": "වල්පොල උපත ලැබුවේ 1934 නොවැම්බර් 11 වන දින කොළඹ ගල්කිස්සේ කොළඹ පිහිටි එම්. ටී. ඇය දරුවන් පස් දෙනාගෙන් කෙනෙකි. ගුරුවරියක වූ ඇගේ මව තම දියණිය වාචික කලාකරුවෙකු වීමට දිරිගැන්වූහ. වල්පොල සිය ප්රාථමික අධ්යාපනය ලැබුවේ දෙහිවල-මවුන්ට් ලැවීනියා හි දෙහිවල-ඇන්තනි විද්යාලයේ ය. එහිදී ඇය පල්ලියේ ගායනා කණ්ඩායම මෙහෙයවීය. ඇය 1959 දී ධර්මදාස වල්පොල සමඟ විවාහ වූ අතර පසුව පසුව ලතා වල්පොල ලෙස හැඳින්විණි. අමුත්තන් හා කලාකරුවන් විශාල පිරිසක් සමඟ චාරිත්රානුකූල විවාහ මංගල්යයක් කොලූපිටි හි සිරි කෝතාහිදී පැවැත්විණි. සිරි කෝතා පිටත රැස්ව සිටි දැවැන්ත පිරිස පාලනය කිරීම සඳහා ප්රාදේශීය පොලිසියට අමතර මිනිසුන් යෙදවීමට සිදු විය. මෙම යුවළට පුතුන් තිදෙනෙක් සහ දියණියක සිටී. 1960 ගණන්වල සහ 1970 දශකයේ මුල් භාගයේ යුවළ ඉතා ජනප්රිය විය. 1946 දී ගුවන්විදුලි සිලෝන් ගායනා කණ්ඩායමේ සාමාජිකයෙකු ලෙස ගුවන්විදුලි සිලෝන් ගායනා කණ්ඩායමේ සාමාජිකයෙකු ලෙස ගුවන්විදුලි සිලෝන් විසින් රටට හඳුන්වා දෙන විට ලතෝ වල්පොල වසර 12 ක් විය. C.A. ෆොන්සේකා, පවුලේ මිතුරෙකු හා ගුවන්විදුලියක්, නාට්යකරුවෙකු තම සරලා ගී වැඩසටහනේ ඔහුගේ පුත් සී.ඩී. ෆොන්සේකා. 1947 දී වල්පොල ඇගේ පළමු ඒකල ගීතය, \"කණ්ඩුු ඩෙනෙතෙයා\" ගුවන්විදුලි සිලෝන් හි නේවාසික වයලීන කරුවෙකු වන වින්සන්ට් ඩි අල්විස් විසින් රචනා කරන ලද පළමු ඒකල ගීතය ගායනා කළේය. ඉන්පසු මොහොමඩ් ගෝස්, පී.එල්. හි. 1950 වන විට ඇය රටේ සුප්රසිද්ධ කාන්තා ගායිකාවක් වූ අතර, \"ඩන්හයිමලා බණ්ඩා,\" ගීතය \"ඩන්හින්ඩා හෙලේනා\" සහ \"දියයාලමා හෙලේනා\" සහ \"දියයාලමා හෙලේනා\" ගායනා කළේ චිත්රා සෝමපාල විසිනි. කොලොපෝලය සහ එච්එම්වී වාර්තා ලේබල් සඳහා වල්පොල වාර්තා වී ඇත. \"මලරා හිමාඩි පිපනේ පම්පනේ එසාල අරාලියා මැලේ\" යන ගීතය c.t. ප්රනාන්දු ඇගේ වඩාත් ජනප්රිය ගීතවලින් එකක් වන අතර වඩාත් ජනප්රිය ගීත වූයේ ආචාර්ය ප්රේමසිරි කෙමදාස විසිනි.",
        "Lyrics of a song": "නමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී\n•••\nදේව පුත්රයා අතීත සාන්තු වරමිනා\nදේව පුත්රයා අතීත සාන්තු වරමිනා\nපිළිසිඳීය දෙව් බෙලෙන් ශ්රී ඔබේ කුසේ\nපිළිසිඳීය දෙව් බෙලෙන් ශ්රී ඔබේ කුසේ\nනමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී\n•••\nකීරිති පෑ ශ්රියා සාමදානයේ පියා\nකීරිති පෑ ශ්රියා සාමදානයේ පියා\nසාරසේ දිලී සිරින් ශ්රී ඔබේ කුසේ\nසාරසේ දිලී සිරින් ශ්රී ඔබේ කුසේ\nනමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී",
        "Songs": "ආඩරියා රන්, ආරායාලා දීජා, අදාරා",
        "email": "LathaWalpola@srilankasingers.com"
    },
    {
        "Name": "ලයනල් රන්වල",
        "Birth Date": "27-Nov-39",
        "City": "තලවතුගොඩ",
        "Biography": "(1939 නොවැම්බර් 27 නොවැම්බර් 27 දින - 2002 නොවැම්බර් 13) 2002 නොවැම්බර් 13) ශ්රී ලංකාවේ සංගීත ian යෙකු සහ ගායිකාවක් සහ ශ්රී ලාංකික ජන සංගීත සංගීතයේ පුරාවෘත්තයක් විය. ඔහුගේ උපන් නගරය කළුබොවිල සහ ඔහු කොළඹ කුමාර විද්යාලයේ වෙල්ලවත්ත සහ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලයත් වූ කළුබොවිල බුධගෝෂ විද්යාලයේ අධ්යාපනය ලැබීය. රන්වලගේ ප්රධාන උනන්දුව වූයේ ශ්රී ලංකාවේ සිංහල ජන සංගීතයයි. ඔහු ජනප්රිය ශ්රී ලාංකික සංගීතය සඳහා සිංහල ජන හා තනු නිර්මාණය කර ඒවායේ මුල්මකත්වය ආරක්ෂා කළේය. ඔහු ඉන්දියාවේ චන්දිගාහි පන්ජැබ් විශ්ව විද්යාලයේ සංගීතය හැදෑරූ අතර ක්ෂේත්රය පිළිබඳ ඇඹුල් දැනුම ලබා ගත්තේය. ඔහුගේ උපදේශක ඩබ්ලිව්.බී. සමඟ දේශීය ජන සංගීත ක්ෂේත්රයේ විප්ලවයක් නිර්මාණය කළ රන්වල. මාකොලුවුලුව 1959 දී අරාවල එම්.වී.එම්.වී.එම්. ඔහු පාසල්වල දේශීය සංගීතය ජනප්රිය කළ අතර පාසලක පළමු 'හෙවිසි' සංගීත කණ්ඩායම - 1964 දී පන්නිපිටියේ ධර්මපාල විද්යාවේදී රන්වල ද රන්වල විය. ඔහුගේ වඩාත්ම අමතක නොවන කාර්යභාරයක් වූයේ මාකුලුවාව විසින් අධ්යක්ෂණය කරන ලද පළමු සිංහල ඔපයා ඩෙකා හි 'ය. ඔහු ළමා නාට්ය කිහිපයක් ද අධ්යක්ෂණය කළේය. ඔහු ටෙලිඩ්රාමා කිහිපයකම ක්රියා කළේය. ඔහුගේ අන්තිම ටෙලි නාට්යය වූයේ ස්වර්ණවාහිනි හි විකාශනය කරන ලද \"රංගමදාල සමගනයි\" ය. ඔහු දිවයින පුරා ගැටුම් සඳහා ජන ගීත එකතු කළේය. ආදිවාසී සංගීතය පිළිබඳ දැඩි ආරක්ෂකයෙකු, 1999 දී පර්යේෂණාත්මක ජන සංගීතය, විශේෂයෙන් 'ආනාස් ඉන්නුවන්ඩු' අඩංගු කැසට් කිහිපයක්. \"ගමා අහතුගුගග්\", \"මැයි අවරුදු කලේ\" සහ \"වනතා සළුවූඩම්\" ඔහුගේ වඩාත් ප්රසිද්ධ ගීත කිහිපයකි. ඔහුට පුතුන් දෙදෙනෙක්, චිරන්ත සහ සහන් සිටිති. වැඩිමහල්ලා, චිරන්ත, ස්වර්ණවාහිනි හි ඉදිරිපත් කරන්නා සහ නිෂ්පාදිකරියකි. සහන් ස්වර්ණවාහෙන්නිනි හි ද සේවය කරයි. ඔහුගේ පුත් සහන් රන්වල තම පියාගේ උරුමය ආරක්ෂා කරමින් ඉතා හොඳින් කටයුතු කරයි.",
        "Lyrics of a song": "මේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ තෙල් ඉහිරුණු කැවුම් ගෙඩිය වාගේ...//\n\nදොං තරිකිට කැත්ත දොදොං පිළ වටකර කැත්ත දොදො දමා තැල්ල ඩිඟිසි ඩිගොයි දමා තැල්ල තක තෙය්යත් තාං කැවුම් කොකිස් තෙලේ බැදෙයි කැවිළි සුවඳ සිතට දැනෙයි\n\nබා බා බා කිකිළී\n\nඊයෙ උදේ ගිය කිකිළී තාම ආවෙ නැ කිකිළි\n\nබා.. බා.. බා..\n\nගත්තිංඥා තිංඥා.. ගති ගත ගෝ ගති ගත ගෝ ඔන්චිලි චිලි වාරම් ගම දෙවනත් වෙන්නා මැංගිරි ඩිණිකෝ.. අවුරුදු ආවෝ..\n\nමේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ...//\n\nදොං තරිකිට කැත්ත දොදොං...\n\nබා බා බා කිකිළි...\n\nගත්තිංඥා තිංඥා.. ගති ගත ගෝ ගති ගත ගෝ...\n\nමේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ..../",
        "Songs": "පරිරිත්, පනුදු කල්ත්රූ, සඳ සහවා මා, සැවතු, වනනාම්, ජුඩෙතත් සාහිම්",
        "email": ""
    },
    {
        "Name": "මධුමාධව අරවින්ද සිරිවර්ධන",
        "Birth Date": "6-Mar-73",
        "City": "මහනුවර",
        "Biography": "මධුමධව අරවින්ද ලෙස හැඳින්වේ, ශ්රී ලාංකික සිංගර්, නළු මාධ්යවේදියෙකු සහ දේශපාලන ician යෙකි. ඔහු ශ්රී ලංකා ගායිකාවේ සංගමයේ අතීත ජනාධිපතිවරයෙකි. කලාකරුවන්ගේ පවුලකින් පැමිණි අරවින්දගේ පියා සුලවත් සිරිවර්ධන ශ්රී ලංකාවේ සංගීත ian යෙකි. ඔහුගේ මව සුසිරි සිරිවර්ධන ද ගීත රචකයෙකි. ඔහුගේ බාල සොහොයුරු දනාංජය සිරිවර්ධන ද රූපවාහිනියේ හා සිනමාවේ ජනප්රිය නළුවෙකි. ඔහු ජනප්රිය නිළි නිල්මිනි ටෙනකුන් සමඟ විවාහ වූ අතර ඔවුන්ට එක් දියණියක් ෂෙවේතා මන්දිකාිනි සිරිවර්ධන ඇත. ඔහුට 1992 දී ටෙලිඩ්රාමා පනී බින්දු සමයේදී නිල්මිනි හමු විය. ඔවුන් 1996 මැයි 5 වන දින විවාහ වූහ. ඔවුන් දික්කසාද වූයේ 2000 දශකයේ මුල් භාගයේදීය. අරවින්ද සීයා, පීටර් සිරිවර්ධන දක්ෂ සංගීත ian යෙකු හා නළුවෙක්. පොල්ගොල්ලා රජයේ කාන්තා පුහුණු විද්යාලයේ සංගීතයේ කථිකාචාර්යවරයෙකු ලෙස ඔහු සේවය කළේය. අරවින්දගේ ආච්චි ශ්රීමතී කරුණා දේවි සංගීත ගුරුවරියක් මෙන්ම නිළියක් ද විය. අරවින්දගේ නැන්දා නැන්දා චන්ද්රිකා සිරිවර්ධන ජනප්රිය ගීත රචක සහ පසුබිම් ගායකයෙකි. ඇය විවාහ වූයේ මාධ්යවේදියෙකු මෙන්ම ගීත රචකයෙකු වූ ඇන්ටන් අල්විස් සමඟ ය. අරවින්ද 1990 දී ඔහුගේ මිතුරා වන නාමල් උඩුගම සමඟ සිය ගායිකේෂන් දිවිය ආරම්භ කළේය. ඔහු 1990 දී ඔහුගේ පළමු ගීතය ගායනා කළ අතර එම වැඩසටහනේ නිෂ්පාදක සුනිල් සිරිවර්ධන යන මහත්වරුනි. ඔහුගේ සෙසු සංගීත ians යින්, ලැම්බා සෝන් වැනි ගීත හා සෝන් සහ සිං වැනි ගීත විශාල ජනප්රියත්වයක් ලබා ගැනීමත් සමඟ ඔහු ගීත අතලොස්සක් පමණක් වාර්තා කර ඇති ගීත කිහිපයක් පමණක් වාර්තා කර ඇතත්.",
        "Lyrics of a song": "ළඹ සවන් රන් පටින්\n\nදන නෙතින් තදින් බඳිමින්\n\nමිණි මෙවුල හඬවිමින් පිපි සමන් කුසුම් දරමින්\n\nතුනු විලෙහි සිරිය මවමින්\n\nරණ හසුන් පිහිනමින් උන් රගති වයති ගී ගය ගයා මියුරු අරුතින් දැහැමින් බැඳි සිත් මඩින්ට මාර සෙන් වටින්\n\nඋන් පරදා අප මහසත් පාරමී බෙලෙන් සෙවණින් බෝ පත් අතරේ ගැලූ අම ගඟින් පවසින් දහමේ නිවුනේ දම් අමා රසින්\n\nකැණිමඬල පළාලා\n\nසුනු විසුනු කළා මැදුරක්\n\nයලි මැදුර සදාලා වෙහෙසුමක් තොපට නැත්තේ නද දුන්නු රාජ මිගික්ෂෙක්\n\nමම ගයමි උදම් ගී\n\nදැහැමින් බවුන් වඩයි නේරංජන නදී තීරේ\n\nළඹ සවන් රන් පටින්\n\nදන නෙතින් තදින් බඳිමින්...\n\nදස දහසක් සක්වා තළ එකම්පිත වෙවී\n\nදස දහසක් ලෝ ධාතුව ගුගුරුවා හැලී දෙව් බඹ සුර නා සේනා සාදුකාර දී\n\nපරසතු මල් ගඳ විලවුන් දෙපාමුල පිදී\n\nකැණි මඬල පළාලා\n\nසුණු විසුණු කරා මැදුරක්...",
        "Songs": "Amma sadudui apa ඩු uui, Badu Patawaweena (සරෝජ්ඒ), බෙන්තාරා හොමමින් කොමප්, දාරානි තලා කමෙෂා චුප්රා, එකා කේට් චුන්නම්, ගේෂ ගන්ඩූ කණ්ඩුම්, ගී ගයානා, ගී ගයානා, ගය ගයානා,",
        "email": "madumadawa@srilankasingers.com"
    },
    {
        "Name": "මල්කාන්ති නන්දසිරි",
        "Birth Date": "",
        "City": "නුගේගොඩ",
        "Biography": "මල්කාන්ති නන්දසිරි යනු ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "සහසක් පැතුමන් ඉපදී මියගොස් ඉතිරිව ගිය එක පැතුම දරාගෙන ඇහැල මහක අඩ හඳ පෑයූ දා\n(මතකද සිරි දළදා වැන්දා )//\n\n(අතීතයක් වෙන්වන රේඛාවෙන් අනාගතය හිස් කරවනු ලැබුවා )// \nඔබෙ අත අන් ලඳකට හිමි කරදී \n( මතකද මා ඉකිබිඳ හැඬුවා //\n\nසහසක් ...\n\n(අහිමිව ගිය සම්පතට වඩා හිමිවූ දුක මිහිරියි සලකන්නම් )//\nඔබ වැනි කෙනෙකුට නෑනා වීමත් පෙර පිනැකැයි මා සැනසෙන්නම්\n\nසහසක් ...",
        "Songs": "AATARE Pethum pura, Abaa mal enuwaka, Dothha mithagi, Pomitiid විලාසය, ඉරිදා, සමිිදුනි ආමන්ත්රණය, සුරතිමේ",
        "email": "malkanthinandasiri@srilankasingers.com"
    },
    {
        "Name": "මරියසෙල් ගුණතිලක",
        "Birth Date": "11-Jun",
        "City": "නුගේගොඩ",
        "Biography": "ශ්රී ලාංකික ගායිකාවක් සහ සංගීත ian යෙකු වන ශ්රී ලාංකික ගායිකාවක්.ඇය ශ්රී ලංකාවේ පමණක් නොව එක්සත් රාජධානිය, එක්සත් රාජධානිය, එක්සත් රාජධානිය, එක්සත් අරාබි එමීර් රාජ්යය, සිංගප්පූරුව සහ ඕස්ට්රේලියාව යන රටවල ද සිදු කර ඇත.මාරියාසෙලෙල් ගූනෙතිලෙක් උපත ලැබුවේ ශ්රී ලංකාවේ කොළඹ පිහිටි නුගෙගෝඩයේ ය.ඇය ඇගේ සංගීත ජීවිතය ආරම්භ කළේ වයස අවුරුදු හතේදීය.මාරියාසෙලෙල් දහය වන විට ලංකාවේ ජූනර් අංශය සමස්ත දූපත් දක්ෂතා තරඟකාරිත්වය දිනා ගත්තේය.ජනප්රිය ශ්රී ලාංකික සංගීත කණ්ඩායමක් වන \"කනිෂ් R රින්තිම්\" නමින් හැඳින්වෙන තරුණ සංගීත ians යන්ගේ පූර්ව යෞවනයන් පිරිසකට සම්බන්ධ වීමට මෙය ඇයට ඉඩ දුන්නේය.දකුණු ආසියාවේ පැරණිතම ගුවන් විදුලි නාලිකාව වන ගුවන්විදුලි ලංකාවේ ගුවන්විදුලි ලංකාවේ ගුවන්විදුලි සිලෝන් හි පළ කරන අවස්ථාවේදී මෙම කණ්ඩායම 1960 දශකයේ දී ප්රසිද්ධියට පත්විය.එය 1950 සහ 1960 දශක තුළ \"ගුවන් තරංග පාලනය කළේය\", එබැවින් ගුවන්විදුලි ලංකාවේ ඕනෑම හෙළිදරව් කිරීම දිවයිනේ තරුණ කලාකරුවන්ට විශාල රුකුලක් විය.",
        "Lyrics of a song": "බණ්ඩි වළලු මිණි කිංකිණි සිනහ සළාලා\nලන්ද දිගේ මුතු පින්නේ දෙපා නගාලා\nනිල්ල මැදින් ඇඹුල අරන් ඔබව සොයාලා\nඑන්න දිනක් ලං වනතුරු ඉඳිමි බලාලා\n\nගං ඉවුරේ වැලි තලයේ දුටුවා මතකයි\nපුන් පෝදා බෝ මළුවේ සිටියා මතකයි\nසඳ වතුරේ පෙම් ඔරුවේ පෙඟුවා මතකයි\nමල් උයනේ තුරු වදුලේ දෙඩුවා මතකයි\nබණ්ඩි වළලු මිණි කිංකිණි සිනහ සළාලා\nලන්ද දිගේ මුතු පින්නේ දෙපා නගාලා\n\nදුකට සැපට ඔබ අසලින් සදා රැඳෙන්නම්\nඅපට උරුම සොඳුරු ලොවක් තනා වෙසෙන්නම්\nමගේ ලොවට ඔබ රජෙකැයි කියා සිතන්නම්\nසසර පුරා වසන තුරා ඔබම පතන්නම්\nබණ්ඩි වළලු ................",
        "Songs": "මහනුවර ලැමිස්සි, අබිලින්, අඩා අපී ඉන් ඇපයි ඉන් වින්ඩ් වින්ඩ්, අයිපී නාමින් කිෂිඩ්, ඒ",
        "email": "mariazelle.goonetilleke@srilankasingers.com"
    },
    {
        "Name": "මර්සිලින් පතිරණ",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "",
        "Lyrics of a song": "අතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\n\nජීවිතයේ එක ලස්සන දවසක\nහඩා... වැටී... ලා යොවුන් සිතින්\nජීවිතයේ එක ලස්සන දවසක\nහඩා... වැටී... ලා යොවුන් සිතින්\nතවත් මෙ මා හද ඔබ රිදවනවා\nසේපාලිකා මල් සුවද මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\n\nසොදුරු මගේ ආදර පැතුමන්\nකඩා වැටීලා ඔබේ හදින්\nසොදුරු මගේ ආදර පැතුමන්\nකඩා වැටීලා ඔබේ හදින්\nබලා... නොබලා... නොයන් ලදුනේ\nඅසරණ වූ. දා සෙනේ... හයෙන්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්",
        "Songs": "Mathakaya Awadiwa, Obe Eth wela, Bendunu Senehe, Anepindu Situ, අතීතයේ එක ලස්සන දවසක",
        "email": "Marselin.Pathirana@srilankasingers.com"
    },
    {
        "Name": "මායා දමයන්ති",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "",
        "Lyrics of a song": "පුරහඳ ලෙස ඔබ සම කළ මගෙ මුහුනේ නළලත මා සිත්තම් කළ කුංකුම තිලකේ ඔබ දුටු ලස්සන ඇයි බොඳවී මැකුනේ පෙර ලෙස පැහැබර නැතිවද නළලේ තිලකේ.\n\nඇසුරින් මිදීලා ඔබ සමුගෙන යාදෝ\n\nමහිරෙන් පිරි ලොව අහිරි වේදෝ\n\nඔබ සිටු කුමරියකට බහ දුන්නාදෝ මට පිටුපා ඇගෙ අතිනත ගනේන්දෝ\n\nඔබගෙන් වියෝවි ලොව මා තනිවේදෝ සිත මා විකල් වී අසරණ වේදෝ මගෙ සිත තුල තෙරපෙන දුක දන්නේදෝ එය මා කෙලෙසක ඉවසා ගන්නේන්දෝ",
        "Songs": "දස වාරියා සීතියා, සාහිත්යය, සුදු සීතාලා හි අපි වුරුසාවු",
        "email": "Maya.Damayanthi@srilankasingers.com"
    },
    {
        "Name": "මර්සි එදිරිසිංහ",
        "Birth Date": "18-Dec-45",
        "City": "අඹේපුස්ස",
        "Biography": "ඩොනා මෙසි නාලිනී එඩිරිසිංහ (1945 දෙසැම්බර් 18) 2014 මාර්තු 18) ශ්රී ලංකාවේ සිනමා ශාලාව, රූපවාහිනිය සහ රූපවාහිනිය මෙන්ම ගායකයෙකු ද විය.බොහෝ විකට රූපවාහිනී වැඩසටහන් සහ ගුවන්විදුලි නාට්යවල ඇයගේ භූමිකාව සඳහා ද ඇය ප්රසිද්ධයි.ඇය 1964 දී \"නවාක මාදල 'ගීතයේ තරගය ආරම්භ කළ අතර 1966 දී වේදිකා නිළියක් බවට පත්විය. ඇගේ අතිශය ප්රසිද්ධ නාට්යය සංගීතයේ ඉතා සුප්රසිද්ධ නාට්යයක් විය.නාට්යයේ හ tra පටයේ සිට ගුණදාස කපුගේ \"ලගිනා තාරවාන් විසින් රචනා කරන ලදී.",
        "Lyrics of a song": "මඩේ ලඟින තාරාවන් නාවන්නද මං\n\nඌරු දළෙන් මොන ගජ මුතු අරගන්නද මං චපල හිමිට සිරි යහනේ රැවටෙන්නද මං එහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං //\n\nමදන ඇතුන් නෙලුම් හුයෙන් මදන ඇතුන් නෙලුම් හුයෙන්\n\nබැඳගන්නද මං\n\nදුවන මුවන් දැක ලන්නද\n\nනෙලූ පලා මං\n\nඑහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං\n\nමඩේ ලඟින තාරාවන් නාවන්නද මං...\n\nහමන සුළන් මකුලු දැළෙන්\n\nහමන සුළන් මකුලු දැළෙන්\n\nවළකන්නද මං කොහොඹ ගහෙන් කොහොම සඳුන්\n\nමල් නෙළන්නෙ මං එහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං\n\nමඩේ ලඟින තාරාවන් නාවන්නද මං...",
        "Songs": "මඩේ ලඟින තාරාවන් නාවන්නද මං",
        "email": ""
    },
    {
        "Name": "මයිකල් පීරිස්",
        "Birth Date": "",
        "City": "උස්වැටකෙයියාව",
        "Biography": "මයිකල් පීරිස් යනු ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//\n\n(ආවේ හෝ හෝ ගාලා වර්සාව වේගෙන්)// (ඒ වෙලේ මුච්චලින්ද නාග රාජයානන් ඉන්නාවු හිමි දැක තෙමි තෙමි සීතලෙන් නොතෙමා වසාවෙන් බේරා දරනින් ද වූවා)//\n\n(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//\n\n(පෑයූ වෙලේ දැක - නා රජිඳුන්)// (පිරුණා වු හදවත මෛත්‍රීය පාමින් ඕ හට අමා මහ දැමේ දෙසූවා)//\n\n(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//",
        "Songs": "Bodhi Satha Purane, Me Gammaneta, Wada Suwanda, Bawe Duka, උතුම් බුදුන්",
        "email": "micheal.peiris@srilankasingers.com"
    },
    {
        "Name": "එම්. එස්. ප්‍රනාන්දු",
        "Birth Date": "4-Mar-36",
        "City": "කොළඹ",
        "Biography": "මහගමගේජ් සැම්සන් ප්රනාන්දු, (1936 මාර්තු 9) 1994 අප්රේල් 9) ජනප්රියයි..ශ්රී ලාංකික ගායිකාවක් සහ සංගීත ian යෙක් විය.ඔහු බයිලා සංගීතයේ දියුණුව සඳහා ප්රධාන ක්රීඩකයෙක් වන අතර පොදුවේ \"බාල් චක්රවර්ති\" (බිලා අධිරාජ්යයා) ලෙස පොදුවේ හැඳින්වෙන ශ්රී ලාංකික ප්රේක්ෂකයින් අතර පුළුල් ලෙස ජනප්රිය විය.ප්රනාන්දු 1936 මාර්තු 4 වන දින මොරටුවා හි උපත ලැබුවේ, පවුලේ වැඩිමහල් දරුවා ලෙස ලොරන් ප්රනාන්දු සහ ලිලී ගෝමස් ය.ඔහු ඇතුළත් වූයේ වටල ශාන්ත අන්තෝනි විද්යාලයේ සහ දෙහිවෙල ශාන්ත අන්තෝ දේවස්ථානයේ දේවස්ථානයේ ය.ඔහුට බාල සහෝදරියන් තිදෙනෙක් සහ එක් බාල සහෝදරයෙක් සිටියහ.වෝල්ටර් ප්රනාන්දු ද සංගීත ian යෙකු හා ගායකයෙකි. ඔහු සිය ගීත දිගටම ගායනා කරයි.ප්රනාන්දු ටියුලින් ප්රනාන්දු සමඟ විවාහ වී ළමුන් 7 ක් සිටී: සුසිල්, ටෙලිනා, ශාන්ත, සරත්, සුජිත සහ සුජිත සහ සුජිත.සුසිල් ප්රනාන්දු සහ සරත් ප්රනාන්දු යන දෙදෙනාම තම පියාගේ උරුමය සංගීත ians යන් ලෙස දිගටම කරගෙන යයි.ඔහු 1994 අප්රියෙල් 9 වන දින වයස අවුරුදු 58 දී මිය ගියේය.",
        "Lyrics of a song": "ලස්සණ රෝස මලක් මට ලස්සණ නෑ\nලස්සණ සමනලය මට ලස්සණ නෑ\nලස්සණ කිසිම දෙයක් මට ලස්සණ නෑ\nලස්සණ නෑ ලස්සණ නෑ ආදරවන්තිය ඔබ වාගෙ නෑ\nලස්සණ රෝස මලක්................\n\nනිල්මිණි තිබේ මිණි පුරේ මුතු තිබේ හරි අගේ රන්වලින් දම්වැල් සදා\nනැතේ නැතේ මට අගේ පිනවන්න හිත මගේ ඇතේ ඇතේ ආදරි ඇතේ\nමාව සනසන්න පිනවන්න මිණි මුතු රන්වලින් බෑ\nඇලේ දොලේ ගංගාවේ දිය ඇල්ලෙ මගේ හිත නෑ\nනැතේ නැතේ මට අගේ පිනවන්න සිත මගේ ඇතේ ඇතේ ආදරි ඇතේ\nලස්සණ රෝස මලක්................\n\nකෝකිලයගේ සුමිහිරි ගීතය මිහිරි වේ සුන්දරයි දෙසවන් පිනයි\nනැතේ මට අගේ නැත පිනවන්න මගේ හිත ඇතේ ප්‍රිය ආදරී ඇතේ\nඈගේ සුදු මූන දුක්වීල ඇඬුවාට කැත වෙන්නෙ නෑ\nමම ඔබේ ඔබ මාගේ මගේ හිත වෙන් වෙන්නෙ නෑ\nනැතේ මට අගේ නැත පිනවන්න මගේ හිත ඇතේ ප්‍රිය ආදරී ඇතේ\nලස්සණ රෝස මලක්................\nආදරවන්තිය ඔබ වාගෙ නෑ///",
        "Songs": "අරවරවන්ති අලවානවන්ති, අඩාරවන්ති, ඇලඩින් ඇලඩින්, අම්මාඩා බිරින්දදා, අම්මාඩා බිරින්දදා, අම්මාඩා බිරින්දදා, අම්බිඩා එන්නාකු, අවීඩින්, අවීදු, අතුරු මිතුරුදු, අතුරූ මිතුරුදු, අතුරු මිතුරුදු,",
        "email": ""
    },
    {
        "Name": "මිල්ටන් මල්ලවාරච්චි",
        "Birth Date": "7-Apr-44",
        "City": "කොළඹ",
        "Biography": "සුමනසිරි මල්ලවරාච්චි ඩොන් (1944 මාර්තු 7) 1998 මාර්තු 7), ජනප්රිය වූයේ ශ්රී ලාංකික ගායිකාවක් හා සංගීත ian යෙකි.ශ්රී ලංකාවේ සංගීත ඉතිහාසයේ වඩාත්ම ගෞරවනීය ගායිකාවක් වන මල්ලවරාච්චි දශකයකට වැඩි කාලයක් ශ්රී ලංකාවේ ප්රවණතා පනතක් වූ අතර, ඇල්බම 35 කට අධික ප්රමාණයක් සහිත ගීත 850 කට ආසන්න ප්රමාණයක් රැස් කළේය.ඔහු සිය බොහෝ ගීතවල බොහෝ ගීතවල සංගීත රචනා, රිදී වළල්ල, තලන්ත තබ්ලා සහ සිතාර් ප්ලේයරයක් සඳහා චිත්රපට වාදනය කරන සිංගල් වර්ගයක් ලෙසද හැඳින්වේ.ඔහු 1998 මාර්තු 10 වන දින 53 වන විට මිය ගියේ වයස අවුරුදු 53 දී වන අතර එය බොරෙල්ලා සුසාන භූමියේ තැන්පත් කර තිබේ.",
        "Lyrics of a song": "මන වසඟ කරන මුදු සිනා වතින්\nසිත පහන් කරන බඳ සලා සිහින්\nකරළිය පසුපස මඳ අඳුරු කොනක වී\nහඬා වැටෙනු කිම ඔයා\nහඬා වැටෙනු කිම ඔයා\n\nපෙම් පත් දහසක් ඔබට ලැබෙන මුත් රස හදවත් ලියනා\nකරුණු කියනු මැන තනිවම ඉකි බිඳ මේ ලෙස ඔබ හඬනා\n\nසළලෙකු වදනින් සසල වීද සිත සුරා මතින් සිටිනා\nවරදක් වීදැයි කම්පා වන්නෙද විට දී ඔබ රඟනා\nමන වසඟ කරන ................",
        "Songs": "ඇමෝ ඔබා මාරනි, ඇලේබාන්, අකාලන්, අත්තිටා රන් හී, ඇන්නානි දිව්, අන්නනා පීඅයි හෙක්",
        "email": ""
    },
    {
        "Name": "මොහිදින් බෙග්",
        "Birth Date": "5-Dec-19",
        "City": "කොළඹ",
        "Biography": "කලා සර්රි අල්හාජ් කතීබුජ් මෝහිදීන් බිග් (1919 දෙසැම්බර් 5, 4 නොවැම්බර් 4) ශ්රී ලංකා සංගීත ian යෙකු වූ බව 1991 නොවැම්බර් 4)සිංහල සංගීතයේ වඩාත්ම බලගතු ගායකයෙක්, බණය විශේෂයෙන් ඔහුගේ බෞද්ධ භක්තිය සංගීතය සඳහා ප්රසිද්ධය.ඔහු තමිල්නාඩුවේ සාලෙම් සිට සාලෙම්හි සිට හිණියෙල්රාබාඩි මුස්ලිම් සම්භවයක් ඇති මුස්ලිම්වරයෙකි.ඔහු රටේ කලා ඉතිහාසයේ ඉතා බලගතු බහු සංස්කෘතික චරිතයක් ලෙස සැලකේ.බණය යනු ශ්රී ලංකාවේ පළමු සම්මානලාභී පුරවැසියෙකි.",
        "Lyrics of a song": "බුද්ධං සරණං ගච්ඡාමි\nධම්මං සරණං ගච්ඡාමි\nසංඝං සරණං ගච්ඡාමි\nඔබෙ රාගී මන කැලඹේදෝ ක්ලේෂ ඕගයේ නෑවේදෝ\nඔබෙ රාගී මන කැලඹේදෝ පිවිතුරු හදවත පෑරේදෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nමෛත්‍රී කරුණා දූෂිත වී ක්‍රෝධය ඊර්ෂ්‍යා පෝෂිත වී\nහිංසා පීඩා දේවි දෝ මිනිසා තිරිසන් වේවි දෝ\nඝෝර විසැති නයි පොලොඟුන් වන් මිනිසුන් මිතුරු වෙසින් එයි නම්\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nදුක් බරිනී මිරිකී යා දෝ සත්‍යය ලෝකෙ වැනසී යා දෝ\nනිර්මල පිවිතුරු චරිතෙ ඔබේ පවිටෙන් බොරුවෙන් කෙලෙසා දෝ\nඅගතිය යුක්තී මාරුතයේ ප්‍රාණෙ ඔබේ දෙදරා යා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nකාට කියමී මගේ ශෝක අඳෝනා ලෝකේ තනිවුණා මේ ලොවේ මිනිසා\nහදේහී නිර්දායා සංදා\nනිර්දය භාවය ලොව රජ වී දයා ගුණේ වී අන්තර්දාන්\nමෝහෙන් මත්වීලා මිනිසා ආගම හා ධර්මේ කෙළෙසා\nසත්‍යය බලේ බිඳ වලලා දෝ ශ්‍රද්ධා භක්තිය දෙදරා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nබුද්ධං සරණං ගච්ඡාමි \nප්‍රේමය ලෝකේ යාද නැසී\nප්‍රේමය ලෝකේ යාද නැසී වෛර ගිනී ඇවිලේද දැවී\nමාතා ස්නේහේ පාය ඇතී තම පුතු අසිපත පාවි දෝ\nධරණී තල කම්පා වේ දෝ ගගනෝදර ගුගුරා යා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\n\nලෝක පියා සින්දේ ලොව ජනගේ ව්‍යාකූල සිත්හී අන්ධකාරේ\nවිසිරී සෞම්‍ය කිරණ ලෝනාගේ ඒකාලෝකේ විය ලෝකේ\nඅමා ශාන්තියේ සෙවනැල්ලේ ජන මන නැහැවූ ප්‍රේම ජලේ\nමර සටනින් අපරාජිත වූ සුර නර පුද ලැබ පූජිතයේ\nලෝක සිවංකර මා හිමිගේ ධර්මේ දස දෙස පැතිරේවා\n(සැම දන තුඩ තුඩ රැව් දේවා බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි ///",
        "Songs": "Aawa Ithin Malsara, Adara Nadiya Gala, Adariye Ruchirananiye, Ai Bambaro Pem Mala Atha Harala, Alokaya Ko, Amathaka Karalamu Parani Katha, Aneka Jathi Sansare, Arumayaki Pudumayaki, Brunda Wanaye, ඔබෙ රාගී මන කැලඹේදෝ - බුද්ධං සරණං ගච්ඡාමි",
        "email": ""
    },
    {
        "Name": "නාමල් උඩුගම",
        "Birth Date": "21-Oct-67",
        "City": "මහනුවර",
        "Biography": "ප්රසන්න නාමල් උඩුගම (1967 ඔක්තෝබර් 21 වන දින උපත) ශ්රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකි.ශ්රී ලංකාවේ ජනප්රියම කලාකරුවන්ගෙන් එක් අයෙකු වන යථාර්ථයේ යුගය පෙන්නුම් කිරීමට පෙර, නූතන ශ්රී ලංකා සංගීත ක්ෂේත්රයේ ඔහු සංකේතාත්මක නිරූපකයක් ලෙස සැලකේ.2014 දී සෞඛ්ය ගැටලු ඔහුගේ ගායන වෘත්තිය මන්දගාමී කිරීමට ඔහු හේතු විය.උඩුගම 2015 මැද භාගයේ සාර්ථක අක්මාව බද්ධ කිරීමෙන් හොඳින් සුවය.උඩුගමගේ පියා ව්යාපාරිකයෙකු වන අතර ඔහුගේ මව ගෘහණියක්.ඔහුට සහෝදරයන් දෙදෙනෙකු සහ සහෝදරියන් දෙදෙනෙක් සිටී.ඔහු පවුලේ බාලයා ය.නාමල් අධ්යාපනය ලැබුවේ මහනුවර හේවාස මධ්යම විද්යාලයේ ය.පාසැලේදී ඔහු මහනුවර සංගීත කණ්ඩායමකට බැඳීමට පෙර ගිටාරය වාදනය කළ අතර පාසල් උත්සවවලදී රඟපෑවේය.උඩුගම කොළඹට සංක්රමණය වූ අතර එහිදී ඔහු ඇල්බම මුදා හැරීමට පටන් ගත්තේය.ඔහු \"සමගනී එන් වෙන්වාන්නන් නා\" ගීතය රචනා කර රචනා කළේය.මෙම ගීතය ශ්රී ලංකා සංගීත ක්ෂේත්රයේ සිය වෘත්තීය ජීවිතය පිහිටුවීය.උඩුගම නාට්යය රුවන්ති මංගලා සමඟ විවාහ වී ඇති අතර ඔවුන්ට එක් දියණියක්, දෙහෙමී සහ එක් පුතෙකු වන නොමිතා ඇත.",
        "Lyrics of a song": "හීන් සැරේ හිතට මගේ සෙනෙහස පාලා\nඔයත්මගේ මමත්ඔබේ මතකද කීවා\nසැරින් සැරේ පැයෙන් පැයේ ඇමතුම් ආවා\nහදිස්සියේ වෙනස් උනේ කොහොමද ඒවා\nහිත මගෙ පාර පාර යනවද ඈත ඈත\nමේ හිත තනිකරදාලා\nඅවංක හින්දා ආයෙ වැරදුනා\nහිතන්න දේවල් නෑ හීන බොඳ උනා //\nජීවිතේට මේ තරමට බැඳිලා\nකාටවත්ම නෑ ආදරේ දීලා\nසංසාරෙම ඔබේ වෙන්න හිතලා\nමගෙ හිතටම ඇයි මේ පිටුපාලා\nවෙන්වී යන්න ගියා කඳුලක් ඉතිරි කළා\nඔබහට නෑසේද මේ වේදනා\nහදවතින්ම පිදුව මාගේ සෙනෙහේ\nඅඩුවක් කවදා කෙලෙසද වූයේ\nහිතාගන්න බැරි මේ දුක දුන්නේ\nහැමදේටම ලඟින් සිටි ඔයානේ\nවෙන්වී යන්න ගියා කඳුලක් ඉතිරි කළා\nඔබහට නෑසේද මේ වේදනා",
        "Songs": "ඇඩාරේ බින්දි සවස්දා, ඇඩ්රරන් සහ වේවා, ඇඩ්රන් හදාවත ඩෙනාම් හවාතා, අම්මා - හමුවීම්කා වෙනීම් මාදර්",
        "email": "Namal. Udugama@srilankasingers.com"
    },
    {
        "Name": "නදීක ගුරුගේ",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "ශ්රී ලංකා සංගීතයේ වඩාත්ම බලගතු රචනාකරුවන්ගෙන් එකකි.\"මම ගිටාරය සමඟ හැදී වැඩුණු අතර ගිටාරය මෙම ප්රසංගයේදී කතා කරයි\" නදීකා ඔහුගේ ප්රසංග 2015 නෝබ්කා, 'කඳුකරයේ දෝංකාරය'ගුරුගේ 1999 දී තරුණ සංගීත කෞතුකාගාරයක් ලෙස ආරම්භ විය. ඔහුගේ පළමු බරපතල සංගීත වැඩක් ලෙස 1999 දී බොලිවියානු ජන සංගීත ian යෙකු සමඟ \"සනීග්මා\" ජන හා ව්යවහාරික සංගීත නිෂ්පාදනයක් විය. එතැන් සිට ඔහු චිත්රපටවල වැඩ කරමින් සිටී, ටෙලි නාට්ය,වේදිකා නාට්ය, ගීත සහ වෙළඳ දැන්වීම්.",
        "Lyrics of a song": "රෑ අහසින් වැටෙනා\nබිංදු බිංදු පිනි බිංදු\nනොපිපි මල සොයනවා\nමුවා වී ඉන්න එපා\nහරි සීතලයි\nසීතලයි පින්න\nසිපගන්න බයෙන් මහ පොළොව\nපිනි බිංදු හඬනවා\nනිම් නාද දී\nදෙතොලතර ඉඩ දෙන්න\nනවාතැන්පල වෙන්න\nහරි සීතලයි පින්න\nඅනෝරා පිනි යටින්\nතෙමි තෙමී ඇවිදින්න\nගිනි නැගෙනා ආත්මය\nපිනි දියෙන් දෝවන්න\nසිරුරතර ඉඩදෙන්න\nනවාතැන්පල වෙන්න\nහරි සීතලයි පින්න",
        "Songs": "Neela Nethu Yuga, Waren Heen Sare Ridee Walawe-Cover, Wedikawe-Romiyo, රෑ අහසින් වැටෙනා",
        "email": ""
    },
    {
        "Name": "නන්දා මාලනී",
        "Birth Date": "23-Aug-43",
        "City": "අලුත්ගම",
        "Biography": "මිරිහානා අරච්චිගේ නන්දා මාලිනී පෙරේරා (1943 අගෝස්තු 23 වන දින උපත), ජනප්රිය වන්නේ ශ්රී ලංකාවේ ගීතිකාව ගායිකාවක් සහ පසුබිම් ගායකයෙකි. ශ්රී ලංකාවේ වඩාත්ම ප්රසිද්ධ හා ගෞරවනීය සහායක ගායිකාවක් වන මාලිනීගේ ගායන තේමාවන් තෝරා ගැනීම සැබෑ ජීවිත හා සමාජ-සංස්කෘතික තත්වයන් මත පදනම් වේ. ඇයගේ ගීත මානව යථාර්ථයන්ගෙන් මිදුණු සබඳතා, ජීවිත තත්වයන් සහ හැඟීම් පිළිබඳ සංකීර්ණ අදහස්. නන්දා 1943 අගෝස්තු 23 වන දින සිව්වන දරුවා ලෙස සිව්වන දරුවා ලෙස ශ්රී ලංකාවේ අළුත්ගම හි ලෙව්වාන්දු හි නව දෙනෙකුගෙන් යුත් ග්රාමීය පවුලක සිට සිව්වන දරුවා ලෙස උපත ලැබීය. ඇගේ පියා වින්සන්ට් පෙරේරා දක්ෂ ලෙස ගැලපෙන සහ සූදානම් කළ කබා සාදන්නා විය. ඇගේ මව ලියනාගේ එමිලි පෙරේරා ගෘහණියක් විය. ඇයට සහෝදරියන් හතර දෙනෙක් සහ සහෝදරයන් හතර දෙනෙක් සිටී. නව යොවුන් වියක් ලෙස ඇය කොළඹ කොටේනා වෙත ගිය අතර එය නව යොවුන් වියක් ලෙසත් ශ්රී ගුණනන්ද විද්යාලයට ගියත් ඇය ටී. එන්. මාග්රට් පෙරේරාගේ උපහාසයට යටත් විය. ඇය විවාහ වූයේ සන්ත් ගොකුල සමඟය වැඩිමහල් දියණිය වරුණි ජනප්රිය ගීත රචක ධර්මසිරි ගමගේගේ පුත් චමින්ද සමඟ විවාහ වී සිටී. බාල දියණිය අමියා සන්ජීවා සමඟ විවාහ වී සිටී.",
        "Lyrics of a song": "මා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්\nනොඉඳුල් තොල්පෙති අතරින්\nඋදුරා ගෙන සිනාව\nහදවත නැති මිනිසා ඔබ\nනෙත කඳුළැලි ගෙනාව\nමා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්\nඑක්ටැම්ගෙයි සිරගත කර\nසමනළියක අනාථ\nජීවිතයම ඔබ අරගෙන\nඇති දුන් වේදනාව\nමා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්",
        "Songs": "රුක් අත්තන මල මුදුනේ, සුරංගීට දුක හිතුනා, වාසනාව ඇගේ නෙතයි, මිරිවැඩි සඟලක්, සාරි පොඩිත්තක්, සකුරා මල් පිපිලා, සුදු හාමිනේ, රන් ගිරි ගිරි ගිගිරි, චන්ද්‍ර මඬුලු යට, මල් කියන්නෙ කාට කාට, මිහි මඬලේ අඳුරු කුසේ, දීග නොගිය පුංචි නැන්දා, මගේ සිනා ඔබ අරගන්න, මල් මල් හීනය, වැස්ස වළාහක, බුද්ධානුභාවේන, මා සඳට කැමති බව දැනගෙන",
        "email": "Nanda_Malani@srilankasingers.com"
    },
    {
        "Name": "නාරද දිසාසේකර",
        "Birth Date": "7-Jun-33",
        "City": "නුගේගොඩ",
        "Biography": "(2010 මැයි 19 වන දින 1933 - 19 ජුනි 19) ශ්රී ලංකා සම්භාව්ය ගායකයෙකි. රන්මතු දූවා සඳහා තරුණ නන්ද මාලිනියෙකු සමඟ 1964 දී ගලන ගංගාකි තරුණියෙකු සමඟ 1964 දී ගනේවිය සම්මානය දිනාගත් පළමු ගායකයා ඔහු විය. ඔහු කළුතර මහා විද්යාලයෙන් අධ්යාපනය සම්පූර්ණ කළේය. නාරාඩාගේ සහෝදරියගේ පුත් නලේන්ද්ර අමරසිංහ සහ ඔහුගේ බිරිඳ ගර්ලි ය. පාසල් කාලයේදී ක්රිකට් ක්රීඩාවේ ක්රිකට් ක්රීඩාවේ ක්රීඩා වලදී නාරඩා දක්ෂය. ඔහු පාසල් ගුරුවරයා වන ලොකුලියානා යටතේ සංගීතය හා වාදනය කළ වයලීනය ද අධ්යයනය කළේය. දිසෙරා පළමුවෙන් ගුවන්විදුලි සත්කාරක හා නිළි ටයිලෙකා රණසිංහ සමඟ 1979 දී විවාහ විය. මෙම යුවළට එක් පුතෙක් සරංග තිබේ. 2009 දී නිල්දා දිසෙරා ජනප්රිය නළුවෙකු බවට පත්විය. පසුව ඔහු බොහෝ චිත්රපට හා රූපවාහිනී අනුක්රමිකවල රඟපෑවා, වඩාත් ජනප්රිය නළුවාගේ සම්මානය කිහිප වතාවක්ම දිනා ගත්තේය. ටයිලෙකා වෙතින් වෙන් කිරීමෙන් පසු ඔහු නිලංගනී දසකර හා විවාහ විය. 2010 මැයි 196 වන දින පදිංචිව සිටින දේසේකර මහතා වයස අවුරුදු 76 දී මිය ගියේය.",
        "Lyrics of a song": "චන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nඅන්ද මන්ද දැඩි චන්ඩ සිතුම් ඇති\nපුඟුලන් මැද දෙරණේ.\nඉන්ද්රඛීලයක් සේ මම ඉන්නෙමි\nනිරතුරු ඔබ සෙවනේ...\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nඅදත් සිනාසී හමුවූනු අයුරින්\nභින්න රුචික මෙලොවේ...\nහෙටත් උදෑසන පිබිදෙන දෑසින්\nඅප හමුවිය යුතු වේ...\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.",
        "Songs": "අදාරා නිල් ඩේස්, ආටින් පයා, බිනාරා මාලී එක්නා, බිනාරා මාලී එක්නා,",
        "email": ""
    },
    {
        "Name": "නීලා වික්‍රමසිංහ",
        "Birth Date": "30-Mar-50",
        "City": "කොළඹ",
        "Biography": "විශාරදර්ශය ප්රවීණ කාන්තා ගායිකාවක් සහ ශ්රී ලංකාවේ සංගීත ian යෙක්, ප්රධාන වශයෙන් සිංහලයන්හි ගායනා කරයි. වික්රමසිංහ ඩොන් ෆ්රැන්සිස් වික්රමසිංහ සහ විටනාරච්චිගේ බාලගේ දියණිය වූ අතර වත්තකාවේ යසාවතී ගුණසේකර කර තිබේ. ඇය වයස අවුරුදු හයේදී පෝලියෝ රෝගයට ගොදුරු වූවාය. ඇය සහභාගී වූ පළමු පාසල වූයේ කිරිමතියගර විද්යාලයයි. 1954 දී ඇය කෙස්බේවා රජයේ පෞද්ගලික පාසලට ඇතුළත් කර ඇති අතර එහිදී ඇය මුලින්ම සංගීතයට සම්බන්ධ වීමට පටන් ගත්තාය. පසුව ඇය මාම්පේ ශ්රී සෝබිතා මහා විද්යාලයට ගියාය. වික්රමසිංහ මාස්ට්රෝ වින්සන්ට් සෝමපාල යටතේ සංගීතය ඉගෙන ගත්තේය. ඇය 1959 දී \"ආධුනික හ. 'වැඩසටහනක් සඳහා වූ එවකට ගුවන්විදුලි සිලෝන් සඳහා ඇගේ පළමු ගීතය ගායනා කළාය. 1967 දී ඇගේ පළමු ගීතය ගුවන්විදුලි සිලෝන් සමඟ පටිගත කිරීමේ වරප්රසාදය ඇයට ලැබුණි. මෙම ගීතය රචනා කර ඇත්තේ ඩෝල්ටන් අල්විස් විසිනි. සංගීතය සපයන ලද්දේ ලයනල් ඇල්ගමා විසින් \"ය. 1973 දී ඇය එස්එල්බීසී හි පර්යේෂණ අංශයේ පර්යේෂණ අංශයේ ගායනා කරන ගීතවල කුසලතාව මත A ශ්රේණියේ කලාකරුවෙකු ලෙස තෝරා ගන්නා ලදී. උතුරු ඉන්දියානු ශාස්ත්රීය සංගීතය හැදෑරීමෙන් පසු, ඇය 1974 දී සංගීත් හාරධ උපාධියක් ලබා ගත්තාය. වික්රමසිංහ ටී. එම්. ජයරත්න සමඟ යුගල ඇතුළු ජනප්රිය පහර ගණනාවක් තිබුණි. පසුව වික්රමසිංහ සංගීතයේ ගුරුවරයෙකු වීමට තීරණය කළේය. පාසැල් කිහිපයක ඉගැන්වීමෙන් පසු 1998 දී අකාලයේ විශ්රාම ගැනීම වසර 23 කට පසු, වසර 23 කට පසු වසර 23 ක කාලයක් තුළ අකාලයේ විශ්රාම ගැනීමට තීරණය කළාය. වික්රමසිංහ උදර පිළිකාවක් වැළඳී ඇති අතර එය ඉතා බැරෑරුම් ලෙස දිවි ගලවා ගත්හ.",
        "Lyrics of a song": "පනම් අටෙන් මට වැඩිකර දුන්නා\nහැකි වුනත් බත් මිටක් දරුවට කවන්න\nමාස්ටර් සර් මගෙ හිමි තැන දෙනවාදෝ\nඅනේ සර් අනුකම්පා නොසිතේදෝ\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ\nමට මතක් වෙනවා සුද්දා තැලූ පෙලූ හැටි\nඅපි කතා කලේ පන ගැහි ගැහි දනින් වැටී\nමාස්ටර් සර් මගෙ හිමි තැන මට දෙන්න\nඅනේ සර් කරුණාවෙන් සලකන්න\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ",
        "Songs": "අහසතා හිරු මැක්, අළුත් මාමායි, අම්මායි මාමායි, ඒපා හයු ක්නා හේමන්ත, අශෝක නවතා, අශෝක නවතාමා, අශෝක අපසරමා, දිගතා යවාදූබා, ඩෙතතා වලු,",
        "email": "Neela.Wickramasinghe@srilankasingers.com"
    },
    {
        "Name": "නිමල් ගුණසේකර",
        "Birth Date": "",
        "City": "වරකාපොල",
        "Biography": "නිමල් ගුණසේකර ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "මට නොවේ ඔබ ආදරේ කළේ\n\nමගෙන් ලද ආදරයට පමණයි ඔබ ආදරේ කළේ...\n\nපෙර හැන්දෑවක ඔබ හමු වන්නට මා නොපැමිණි දවසේ පසුදා තරගින් නොදොඩා හිටියේ\n\nකිමද කියන් ළඳුනේ ආදරේ නම්...\n\nමට නොවේ...\n\nපුංචි පුතා අපෙ ලොවට එකතු වී මවු පදවිය ලද දා මා අමතක කොට සුරතල් බැලුවේ කිමද කියක් ළඳුනේ ආදරේ නම්.…\n\nමට නොවේ...",
        "Songs": "ඉරා හන්ඩා වැටුප, ඉරානය වෙන්ස්වේලා, පිපුනා අත, මම සීතා රීමි, මිලානා දේශාව, කාසි ගීනාත් බාරි, සමුගානා ඔනානාම්, සමුගාන ඔනානාම්",
        "email": "Nimal.Gunasekara@srilankasingers.com"
    },
    {
        "Name": "නිහාල් නෙල්සන්",
        "Birth Date": "9-Jan-46",
        "City": "මොරටුව",
        "Biography": "සාතන් (1946 ජනවාරි 9 වන දින 9), ශ්රී ලාංකික හ ciral ොක්කාරියන්, ගීත රචකයෙකු සහ නිර්මාපකයෙකු වේ. ශ්රී ලංකාවේ වඩාත්ම බලගතු ගායකයෙක් යැයි සැලකුවේ \"ප්රසංග වේදිකාවේම පරාජය නොකරන ලද 'යෙල්සන් ඇල්බම 113 ක් සහිත ශ්රී ලාංකික කලාකරුවෙකු විසින් වාර්තා කරන ලද වඩාත්ම ඇල්බම සඳහා වන වාර්තාව ඉටු කරයි. ඔහුගේ පියා ව්යාපාරිකයෙක් වන අතර මවක් ඉංග්රීසි ගුරුවරියකි. ඔහු ප්රාථමික අධ්යාපනය ආරම්භ කළේ අහිංසක මරියා මිශ්ර පාසලෙන් වන අතර එය දැනට රාවාවවත්ත මෙතිස්ට් විද්යාලය ලෙස හැඳින්වේ. 8 ශ්රේණිය පසු කිරීමෙන් පසු ඔහු 1960 දී උසස්පෙළ සම්පූර්ණ කළ මොරතු මහා විද්යාලයට ඇතුළත් විය. සංගීතය කෙරෙහි ඔහුට විශාල අවධානයක් යොමු කළේය. නෙල්සන් 1974 මැයි 16 වන දින මාලිනී රේසිතා සමඟ විවාහ වී ඇත. පාසැලේ මෙන්ම මොරටුවා හි ගායකයෙකු ලෙස නෙල්සන් ඉතා ජනප්රිය විය. කෙසේ වෙතත්, සංගීත ලෝකයට ඇතුළු වීමට ඔහුගේ සංගීත හැකියාව ඔප දැමීමට ඔහුට සිදුවිය. මෙම කාල පරිච්ෙඡ්දය තුළදී, මුල් දිනවල බොහෝ ගීත ලියා ඇති සරත් මුනසිංහ (දැනට භික්ෂුවක්, මීගහවේල සුමනශාශාශාශාතා තෙරෝ) හමුවිය. 1962 දී ඔහුට විවාහ මංගල්යයකදී ජනප්රිය සංගීත ian යෙක් A.j.karym හමුවිය. කතී ජනප්රිය නිර්මාපනයේ ආර්. ඒ. චන්ද්රසේන වෙත නෙල්සන් හඳුන්වා දෙන ලදී. නෙල්සන්ගේ පළමු පටිගත කිරීමේ ලසනාටා පියිප්නු වනමාල් විසින් මුනසිංහ විසින් ලිවීය. පසුව ඔහු චන්ද්රසේන සමඟ මහනුවර ලේක් ක්ලබ් සමඟ සම්බන්ධ විය.",
        "Lyrics of a song": "ජපන් බැලුම වගේ හිටපු කාලෙ මං \nලියුම් ලියල එව්වෙ කොපිං පැන්සලෙන්\nබ්‍රෝකර්ලා දමලා චොකලට් මට කවලා \nදාපු චාටු මතක නැද්ද දැන්\n\nපුළුන් කොට්ටෙ වගේ හිටපු කොළුව මං \nලියුම් ලිව්වෙ බ්‍රෝකර්ලගෙ බොරු අහන්\nමගෙ චොකලට් කාලා නිතරම දඩ දාලා\nමාව කෑව මතක නැද්ද දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nදුසිම් ගණන් මගේ පොටෝ ඉල්ලලා\nමගෙ හැඩ රුව එක එකාට පෙන්නලා\nමා ගැන නිතර කතා කිය කිය රහට ගොතා\nලොක්ක වුණා මතක නැද්ද දැන්\n\nපොටෝ ගත්තෙ සත්තු වත්තෙ ගිහිල්ලා\nමතක නැද්ද බැබුන් ලඟින් තියාලා\nහැඩ රුව ගැනම සිතා දෙඩුවට බොළඳ කතා\nජපන් බැලුමෙ හුළං ගිහින් දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nඅනුන්ගෙ වතුපිටි දේපළ පෙන්නලා\nවලව්වකින් පැවතෙන බව හඟවලා\nරටටම ණය වීලා ගම රට හැර දාලා\nහැංගි හැංගි ඉන්නෙ මොකද දැන්\n\nකොල්ලො එක්ක රවුම් ගහපු රට වටේ\nතමුසෙ බැඳපු දවසෙ ඉඳල පස් කටේ\nහෝටල් බුක් කරලා මඟුලට වැය කරලා\nබැන්ද එකයි කරුමෙ වුණේ දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nකට්ට වෙට්ට පිත්තල වැඩ පෙන්නලා\nමොට්ට වෙච්ච ඔහෙගෙ තට්ටෙ පෑදිලා\nකට ගොන්නක් බීලා එන කොට වෙරි වීලා\nදීග කඩන් යන්න හිතයි දැන්\n\nපිට රට සිට ආ ලට පට උලාපු\nහුට පටයක් අරන් ඇද්ද වලිප්පු\nඋණු උණු අන්නාසී ලුණු වැඩි වුණු දෝසී\nකාපු කාලෙ ඉවර වගෙයි දැන්\n\n(ආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ) //",
        "Songs": "අදාරා කිරියි, අංසාවයි, අම්මා නාති කලා, අන්දර, අන්දර, අතුමා හිරායි, අතුමා හිරායි, බණ්ඩා බණ්ඩා ඒඩාර්, බාර් බාර් බාර්, බණ්ඩාර් බාර් බාර්, \"බාර් බාර් බාර්,\" බාර් බාර් බාර්,",
        "email": ""
    },
    {
        "Name": "නිර්මලා රණතුංග",
        "Birth Date": "",
        "City": "කොළඹ",
        "Biography": "නිර්මලා රණතුංග ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයෙකි.",
        "Lyrics of a song": "මේ උයන්තෙරේ මේ තුරු සෙවණේ ඔබේ කතා මට තවීම ඇසේ මේ නදී තෙරේ මේ අඩිපාරේ ඔබේ සිනා මට තවම පෙනේ..\n\nඔබ එදා කියූ වදන් ලියා ඇති සිතේ නෑ ඉඩක් යලිත් සදා අන් සිතක් කෙරේ..\n\nඅතරමගක මා දමා තනිව ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ..\n\nඅප එදා පෙමින් වෙළී දෙපා නැගු මගේ\n\nනෑ තවත් මැකීගියේ මුදුවදන් ඔබේ..\n\nයලිදු ඔබ එතැයි පතා හිඳිමි ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ..",
        "Songs": "ඩු සෙනාෂසා, මට ප්රේම, සීඩා මල් ගොනෙක්, ආර්යි සීති, ආර්හෙම්බම්බල්, වෙසන්තර් ඩෙන්න, ඒඑම්එම්ඊබේක්, ඩෙඩිනින්ක් සුළඟ.",
        "email": ""
    },
    {
        "Name": "නිරෝෂා විරාජිනී",
        "Birth Date": "13-Jan-73",
        "City": "මහනුවර",
        "Biography": "වසර 23 කට වැඩි කාලයක් පුරා ශ්රී ලංකාවේ සම්මානලාභී ගායකයෙකු වන විරාජිනි ලලිත්යා ද සිල්වා මහතා අවුරුදු 23 කට වැඩි කාලයක් පුරා සංගීත ian සහ සංගීත අධ්යක්ෂකවරයෙකි.නිරෝෂා උපත ලැබුවේ 1973 ජනවාරි 13 වන දිනය. ඇය ශ්රී ලංකාවේ ස්වදේශිකය. නමුත් 2005 දී මෙම යුවළ දික්කසාද වූවාය. ඇය 2009 දී යශාලා නිමලෙයිජා සමඟ විවාහ විය.නිරෝෂා සිංහල, දෙමළ, හින්දි සහ මලයාලම් යන ගීතවල ගායනා කරන ලද ගීත තිබේ.2002 සහ 2016 දී ජනාධිපති සම්මානය සහ ජනාධිපති සම්මානය සහ සරසවියාවේ සරසවියාවේ ප්රමෝදය \"සහ පිළිවෙලින්\" රාජ්ය සේවා සෙවයයි \"සහ\" කිනිහිරා මල් \"යන චිත්රපටවල පසුබිම් ගායිකාවක් ලෙස ශ්රී ප්රදානය කරන ලදී.",
        "Lyrics of a song": "රන් ගිර මා - ඔබ එගිර සිඹින හිරුට සමානා\nපන්හිඳ මා - ඔබ එයින් ගෙතෙන ගීය සමානා\nරන් ගිර මා ................\n\nරන් ගිර හිස හිරු හිනැහෙත - එලියෙන් මුලු ලොව දිදුලත\nනමුදු හිරුට ලං වන්නට වරම් නොමැතියේ\nඉරෙන් ලොවක් එලිවනු දැක මසිත බැබලියේ\nරන් ගිර මා ................\n\nපන්හිඳ ගෙතු ගී ගැයවෙත - මිහිරෙන් තුන් හිත නැහැවෙත\nනමුදු ගීය දුන් මිහිරට උවම් නොමැතියේ\nඑයින් ලොවක් සැනසෙනු දැක මසිත නැලවියේ\nරන් ගිර මා ................//",
        "Songs": "රා සිට සිස්ටිනා, අඩා සිස්ටිනා, ඇඩැරේ මාකේක්, ඇඩැයාර් මයිර්, ඇඩාර් මිසර්, ඇඩාරෙමා ටාරී, ඇඩියා කළු ඩොඩෝල්, අල්යා කළු ඩොඩෝල්, අල්යා කළු ඩොඩෝල්, අල්යා කළු ඩොඩෝල්, අල්යා කළු ඩොඩෝල්, අල්යා කළු ඩොඩෝල්, අල්යා හි කළු ඩොඩ්, අලයා හිහී මාජ්, ෙකා",
        "email": ""
    },
    {
        "Name": "නලින් ජයවර්ධන",
        "Birth Date": "18-Apr-57",
        "City": "පර්ත්, ඕස්ට්‍රේලියාව",
        "Biography": "(1957 අප්රියෙල් 18) ජනප්රිය ශ්රී ලාංකික ගායකයෙක් සහ ගායනාකරුවෙකි. ලොව පුරා අන්තර්ජාලය පදනම් කරගත් ශ්රව්ය ඇල්බමයක් ලොව පුරා සිටින ශ්රී ලාංකික සිංගර් ඔහු සතුව තිබූ පළමු ශ්රී ලාංකික ගායකයා වන අතර එය 2004 දී කන්ද පමාලේ මහතා විසින් නිදහස් කරන ලදී. ජනප්රිය ගායිකාවක් වන එච්.ආර්. ජෝතිපාල සඳහා කප්පම් සංයුක්ත තැටි කිහිපයක් ඇතුළුව සීඩී තැටි 21 කට වැඩි ප්රමාණයක් ඔහු නිකුත් කර තිබේ. නලින් ජයවර්ධන මුල් ගීත 350 කට වඩා ගායනා කර ඇති අතර ඔහුගේ ගීතවල වීඩියෝ 20 කට අධික ප්රමාණයක් අන්තර්ජාලය හරහා ලබා ගත හැකිය. නාලින් ගේ ගීත බොහොමයක් ලියන ලද දක්ෂ සිංහල පද රචනා පෙරේරා වැනි දක්ෂ සිංහල පද රචනා කරන ලද ආචාර්ය වික්රමයා පෙරේරා වැනි දක්ෂ සිංහල පද රචකයින් සමඟ එක්ව මෙම ගීත රචනා කරන ලදී. නාලින්ගේ ගීත සඳහා සංගීත සංයුතිය නාලින් මෙන්ඩිස්, ජයංග ඩෙඩිගා නාලින් යනු ගූගල් ප්ලේ, අයිටියුන්ස් සහ ඇමේසන් යන ගීතවල තම ගීත මුදා හැරීමේ මුල් ශ්රී ලාංකික කලාකරුවෙකි. නාලින් ජයවර්ධනගේ ගීත 300 කට අධික ප්රමාණයක් අඩංගු පද රචනා පොතක්, \"ගී තරු මල්\", \"ගී තාරු මල්\" යනුවෙන් නලින් ජයවර්ධන විසින් ගායනා කරන ලදී. ඕස්ට්රේලියාවේ සෙරෙන්ඩිබ් ප්රකාශන 2016 දී නලින් ජයවර්ධන 2016 දී බහු සංස්කෘතික දේශ සංස්කෘතික දේශ සංස්කෘතික දේශ සංස්කෘතික දේශ සංස්කෘතික දේබිෆිමානි සම්මානය විය. ඔහු සහයෝගයෙන් කටයුතු කරන්නේ පූජ්ය බෙරුවෙලා සයි සොබිතා සහ ආචාර්ය ගිල් ගිල් ගිල් සහිත ප්රථම වරට ධම්මපාද ස්ටැන්සාස් සීඩී ඇසුරුම්කරණයේදී ය. ශ්රී ලංකාවේ සුනාමි විපතට පත්වූවන්ගේ ආධාරයේ පුණ්යාධාර සීඩී / ඩීවීඩී සෑදීම සඳහා ඔහු සහයෝගයෙන් කටයුතු කළේය. පළමුවන සිංහල ශ්රව්ය ප්රබන්ධ පොතේ කුලජෙයින් කුලෙගියාටා විසින් සංයුක්ත තැටි පහක් දක්වා විහිදෙන ඔහු රූග්රියා පෙරේරා සහ භද්රාජි මහින්ද ජයතිලක සමඟ සහයෝගයෙන් කටයුතු කළේය. මෙම ශ්රව්ය පොත යනු ලංකා උරුමය සහ සරසවි ප්රකාශකයන් වන ශ්රී ලංකාවේ නිෂ්පාදනයකි.",
        "Lyrics of a song": "(ඔබේ වීදියේ පහන් කනුව යට මා නැවැතී ඉන්නම් අඳුර වැටුනු විට පහනේ එළියට මා දිස් නොවුනාදෙන්)//\n\n(වාරාංගනා ...වාරාංගනා ... වාරාංගනා පිරිවරිනා)//\n\nසිතේ තනිය මිස ගතේ තනිය නැත වාරාංගනා පිරිවරිනා\n\n(විරූප අඳුරේ පැහැදිලි නැති විට ගත ඉන් සවිවේ නම් අඳුර වැටුනු විට සිත දැඩි වන්නට ලොව දිස් නොවුනාදෙන්)//\n\n(වාරාංගනා ...වාරාංගනා ...\n\nවාරාංගනා පිරිවරිනා)// (සිතේ තනිය මිස ගතේ තනිය නැත\n\nවාරාංගනා පිරිවරිනා)//\n\nවාරාංගනා පිරිවරිනා\n\n(වාරාංගනා ...වාරාංගනා ... වාරාංගනා පිරිවරිනා)//",
        "Songs": "සන්සර සුවන්ද, දුරවවිලිය - නලින් ජයවර්ධන, සංගීතය සහ තනු, සංගීතය සහ මිනයිතෙයි, වෙල්මාරි දේතිතා, වීවුරි ඩීහා, වී.වීමා, මීනී කරනා වීටා, සංගප්පලියා අම්මා හේනායා, සාප්පුව",
        "email": ""
    },
    {
        "Name": "නුවන් ගුණවර්ධන",
        "Birth Date": "",
        "City": "මහරගම",
        "Biography": "",
        "Lyrics of a song": "ආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ පවන් රැල්ල ඕවිල්ලේ නැගී එන්න අපි යමුදෝ එවන් සුපෙම් යහනේ දෙන්නා\n\nළැඟුම් ගන්න සුවසේ දෙන්නා\n\nආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ\n\nමල් පොකුරේ මුදු රේණුවේ දිය පොකුරේ මුතු බිංදුවේ කවුරුද ඉන්නේ ඇයි නොකියන්නේ ඔබ පමනයි මන මංගලා මොහොතක් නෑරම ජීවිතේ මා හද රිද්මය ගීතයේ කවුරුද ඉන්නේ ඇයි නොකියන්නේ ඔබම විනා අන් අවුරුදෝ නයනේ රඟනා අනුරා නුරා වසන් වී නොයේවා දෑසින් වසන් වී නොයේවා දෑසින්\n\nආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ\n\nපියකරු සිහිනෙක රාත්‍රියේ උන්නා ඔබ ලංවී ප්‍රියේ මා කුමරාසේ ඔබ කුමරියසේ ඔව් ඒ සිහිනය මේ තමා මොනරෝ මොනරෝ පිල්වනා මන්දෝ මෙතරම් රංගනා පෙම් බැඳිලාදෝ මොනරිය කොහිදෝ ප්‍රේම වසන්තය ළං උනා සැලෙනා ළෙළෙනා හැඟුමේ මගේ පහන් තරුව ඔබ වේ මිහිරේ පහන් තරුව ඔබ වේ මිහිරේ\n\nආකාශ ගංගා...",
        "Songs": "Chaandani, Kandulinma Gayu, Pavee Giyawe, Lunui Bathui, Sithuwam Kalath, Kiri Muhudu Werale, ආකාශ ගංගා නීල ඉවුරේ",
        "email": "nuwan_gunawardana@srilankasingers.com"
    },
    {
        "Name": "නුවන්ධිකා සේනාරත්න",
        "Birth Date": "23-Jun-93",
        "City": "නාරම්මල",
        "Biography": "(උපත 1993 ජුනි 23 වන දින ශ්රී ලංකා ටීවී යථාර්ථය පිළිබඳ පළමු ස්ථානයක්. පවුලේ එකම දරුවා ලෙස. ඇය හැදී වැඩුණේ කුරුණෑගල අසල කුඩා නගරයක් වන නාරම්මාලා මයුරපාද ප්රාථමික පාසලේ සහ පසුව ඇයගේ විශාරද ඩිප්ලෝමාව උසස් අධ්යාපනය සඳහා විශ්වවිද්යාලයෙක් පෙන්වන්න. මෙම යථාර්ථයේ ප්රදර්ශනය තුළ ඇගේ ඇදහිය නොහැකි ඉන්ද්රජාලික කුසලතා දේශීය හා විදේශීය සංගීත ලෝලීන් දහස් ගණනකට හෙළිදරව් කරන ලදී. නුවාන්දියික් (2021) යන නම යටතේ ඇය සංගීත කර්මාන්තයට ඇතුළත් වීමට ඇයව ඉවත් කරන්න.",
        "Lyrics of a song": "ඔබට ලංවී ලඟින් ඉන්නට හීන දැක්කට මං හිතින් වෙන්වී දුරට යන්නට කාරණා ඇත දැන් මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් කොහොමද බලබල ඉන්නේ කොහොමද මං\n\nආදරේ මල් පියලි අතුරා හදවතේ මළුවේ මගේ මේ හිත ඇවිලිලා යන බැල්මකින් බැලුවේ කාත් කවුරුත් නෑ වගේ මං හංගගෙන පපුවේ ඇයි ඉතින් මගේ හිතට දුක් දෙන සුසුම් වැල් හැඬුවේ මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් දෙන්නේ කොහොමද මේවා බල බල ඉන්නේ කොහොමද මං\n\nකවමදාවත් නෙතට කඳුලක් දුන්නේ නැති හිතක ඔහේ වැටිලා මමත් උන්නා එපමණයි මතක යන්න යන්නම් දරාගෙන දුක තාරකා නෙතක කඳුළු වැටුණට හිතන්නෑ මං අඬන්නෑ මැණික මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් දෙන්නේ කොහොමද මේවා බල බල ඉන්නේ කොහොමද මං",
        "Songs": "හෙන්කා පයියා, සිහිනායක් මව්නා, මලන් උපන් සමනාලි, අසමිනාරා වෙසැක්, ඇඩකරිඩා මැන්ඩ, සාහිත්යය",
        "email": ""
    },
    {
        "Name": "පෝල් ප්‍රනාන්දු",
        "Birth Date": "24-Nov-51",
        "City": "මොරටුව",
        "Biography": "මැඩවෙල හෙවාගේ, (1951 නොවැම්බර් 24 - 2020 - 2020 - 2020 - පෝල් ප්රනාන්දු ලෙස ශ්රී ලාංකික සංගීත ian යෙකු හා බිබිලා ගායකයෙකි. \"බයිලා කුමරු\" ලෙස බොහෝ විට හැඳින්වෙන ප්රනාන්දු ශ්රී ලංකාවේ බටහිර සංගීත ක්ෂේත්රයේ වඩාත් ජනප්රිය ගායිකාවක් බවට පත්විය. එසේම ඔහු ශ්රී ලංකාවේ බයිල් කලාව ජනප්රිය කිරීම සඳහා කැප වූ ප්රමුඛතම කලාකරුවන්ගෙන් කෙනෙකි. පෝල් ප්රනාන්දු 1951 නොවැම්බර් 24 වන දින කොළඹ, කොළඹ මොරටුවා හි උපත ලැබීය. ඔහු මොරටුවා හි වේල්ස් කුමරුගේ විද්යාලයේ අධ්යාපනය සම්පූර්ණ කළේය. ඔහුගේ පියා මදවල හෙවාගේ ලියොන් ලියොන් ලියොන් ප්රනාන්දු සහ මව කුසුමාවතී ප්රනාන්දු ය. ඔහුට වැඩිමහල් සහෝදරයන් හතර දෙනෙක් සිටියහ. ඔහු 2020 නොවැම්බර් 16 වන දින වයස අවුරුදු 68 දී කලුබොවිල රෝහලේදී දීර් period කාලයක් තිස්සේ කළුබොවිල රෝහලේදී මිය ගියේය. ආධුනික ගායිකාවක් 1969 දී මොරටුවා හි බෞද්ධ මන්දිරයේදී පැවැත්විණි. ඔහු ගීත ගායනා කිරීමට අවස්ථා සොයන කාලයක් විය. එම අවධානයේද, ඔහු පසුව තරඟකාරිත්වයේ තරඟකාරිත්වය හැට නවයක් සඳහා ඉල්ලුම් කළ අතර එහිදී ඔහු තරඟය ජය ගත්තේය.",
        "Lyrics of a song": "ගොලු හදවත විවර කරන්න කොයිද හිතේ තදකරන් මට කියන්න කදුලු සලන්න ඉඩනොතබන්න\n\nමුවගින් සිනා සලනවා නෙතගින් බැලුමි බලනවා\n\nඉන් රහසක් පවසනවා වාගේ මටවැටහෙනවා දැඩි සෙනෙහසක් තියනවා එය හිතතුල තෙරපෙනවා\n\nඔබ තනියම දුක්වෙනවා වාගේ මට වැටහෙනවා\n\nගීයෙන් ඔබ අමතනවා මගෙ අදහස පවසනවා ඔබ නිහඩවම සිටිනවා මා හදවත වැලපෙනවා",
        "Songs": "අංක.",
        "email": ""
    },
    {
        "Name": "පියල් පෙරේරා",
        "Birth Date": "",
        "City": "රත්මලාන",
        "Biography": "",
        "Lyrics of a song": "ඔබ කැමති නම් මට කියන්න මගෙ දුක ටිකක් හරි නිවෙන්න ඔබ ඇයි ගියේ කියලා හදවත මගේ බිඳලා //\n\nඔබම තමයි පෙරදා මා වෙත ආවේ\n\nඔබම තමයි ආදරේ ගැන මට කීවේ ඔබම තමයි මගෙ ජීවිතේ එළිය කලේ\n\nඔබම තමයි අද මගෙ ලොව අඳුරු කලේ\n\nඔබ කැමති නම්....\n\nළඟ ඉන්නම් සැමදා ඔබමයි කීවේ පෙම් ගී වැල් ගොතලා ඔබමයි ගැයුවේ මගෙ තුරුලේ උණුසුම ඔබමයි පැතුවේ අද යන්න ගියේ මට නොකියම ඇයි කෙල්ලේ\n\nඔබ කැමති නම්.... //\n\nඔබ ඇයි ගියේ කියලා හදවත මගේ බිඳලා",
        "Songs": "Birthday Song, Lassana Hasarel, Manel Mal, Sal Mal wel, Sitha sanasuma denna sada, Pem Lowe Rema, SWENWELA GIYATH, ඔබ කැමති නම් මට කියන්න",
        "email": "piyal.perera @srilankasingers.com"
    },
    {
        "Name": "ප්‍රේමසිරි කේමදාස",
        "Birth Date": "25-Jan-37",
        "City": "වාද්දුව",
        "Biography": "දේශමන්යා කලා කීර්ති (1937 ඔක්තෝබර් 25) 2008 ජනවාරි 25) \"කෙමදාස මාස්ටර්\" යනු ශ්රී ලාංකික සංගීත නිර්මාණකරුවෙකු ලෙසද හැඳින්වේ. ලෝක වටයේ විවිධ සංගීත ශෛලීන් ගවේෂණය කිරීම කෙමදාස අද්විතීය සංගීත ශෛලියක් වර්ධනය කිරීමට උත්සාහ කළේය. ඔහු සමකාලීන සංගීතයට අනුබල දෙන ලෙස සිංහල ජන නාද, හින්දුස්ථානි සංගීතය, බටහිර සංගීතය සහ ඔහුගේ රචනා කරන ලද බටහිර සංගීතය සහ ඔහුගේ රචනාවල තවත් බොහෝ ගංගා ඒකාබද්ධ කළේය. කෙමාදාසා හැදී වැඩුණේ වඩ්ඩුවා, වඩ්ඩුවා හි පිහිටි තලපිටිය වන ශාන්ත ජෝන් විද්යාලයේ පනාදුර ශාන්ත ජෝන් විද්යාලයේ සහ පසුව ශ්රී සුමංගල විද්යාලය පනාදුර යන මහත්වරුනි. දහතුන්වන දරුවා ශ්රී ලංකාවේ බටහිර වෙරළ තීරයේ දුප්පත් ග්රාමීය පවුලක් බවට පත් වූ කෙමදාස කිසිවක් නොමැතිව ආරම්භ විය. ඔහුගේ පවුල තුළ සංගීත උරුමයක් නොතිබුණි. ඔහු ස්වයං උගන්වනු ලැබූ අතර, ඔහුගේ වයස අවුරුදු 6 ක් වන විට ලාභ උණ බම්බු නිමෙන් ක්රීඩා කරන්නේ කෙසේදැයි ඉගෙන ගන්න. ඔහුගේ මුළු ජීවිත කාලය තුළම, කෙමදාස කිසි විටෙකත් සංගීතයේ විධිමත් පුහුණුවක් නොලැබෙනු ඇත. යෞවනයෙකු ලෙස, ඔහු දක්ෂ ලෙස ගිගාස්ට් කෙනෙකු බවට පත්විය. සිය ජ්යෙෂ් School පාසල් සහතික විභාගය පැවැත්වීමට නියමිතව තිබූ දිනයේ සම්මුඛ සාකච්ඡාවක් සඳහා ගුවන්විදුලි සිලෝන් වෙත පැමිණෙන ලෙස කෙමදාස මහතාගෙන් ඉල්ලා සිටියේය. ඔහු නියමිත වේලාවට පෙර විභාගය අවසන් කර විගණනය සඳහා ගමන් කළේය. ඔහු විගණනය සමත් වූ අතර ගුවන්විදුලි ලංකාවේ සාමාජිකයෙකු බවට පත්විය. ඔහුගේ දියණියන් දෙදෙනා වන අනූපා සහ ගයාත්රි දැන් තාත්තාගේ ඇළට පදිංචියට ගියහ.",
        "Lyrics of a song": "ලඳුනේ ලඳුනේ\n\nකවුරුවත් නැහැ කවුරුවත් නැහැ - එගොඩට යන්නට - එගොඩට යන්නට \nඉරගල වැටිලා - ඉවුර දෙපැත්තේ \nඅඳුර ගලනවා - පාරුව ඇතුලට\nලංතෑරුම කෝ ඔහෙ තිබුනාවේ කවුරුවත් නැ කවුරුවත් නැ \n\nදවසින් දවසම පාලම හැදුනා පාලම් මොලෙන් හෙන හඩ ඇසුනා කිරන කැලෑවේ කුරුළු කොබෙයියන් ගම හැරදා යන්න ගිහින්\n\nදෑතේ අතැගිලි හබලට ගෙවුනා ගෙනියන්නට බැරි මහ බර තිබුනා මෙතුවක් නොම ගිය බර අද දවසේ මට හිනැහීගෙන යනවා රහසේ \n\nකවුරුවත් නැ කවුරුවත් නැ//",
        "Songs": "ගොලු හදවතා, හ්මත් සාහි, උම්ම්බර හිනාද, උඩ්ම්බර හර්ක්, සුලංගා ඩිස් අවීඩින් (රදෙයි නිම්නායා), අම්මවර්න්, අම්මවර්න්,.",
        "email": ""
    },
    {
        "Name": "ප්‍රින්ස් උදය ප්‍රියන්ත",
        "Birth Date": "13-Jun-70",
        "City": "ගාල්ල",
        "Biography": "(1970 ජුනි 13 - 1970 ජුනි 13 - 2017 ජුනි 8) ශ්රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකු විය. 1990 දශකයේ මුල් භාගයේ කුමාරයා සිය සංගීත ජීවිතය ආරම්භ කළේ 1990 දශකයේ මුල් භාගයේදී කුමාරයා සිය සංගීත ජීවිතය ආරම්භ කළ ග්රාමීය ගම්මානයේ උපත ලැබීය. ඔහුගේ පියා අනුභව කළ ප්රනාන්දු, ශ්රී ලංකා ගුවන්විදුලි සංස්ථාවේ හිටපු වයලීන කම්පනයක් වූ අතර හිටපු විදුහල්පතිවරයකු සහ සංගීත ගුරුවරයෙකු ද විය. ඔහුගේ මව රොසලන් පල්ලියගුරුගේ මහතා ඩුබායි රෝහලකදී 2014 දී මියගිය විදුහල්පතයි. කුමාරයාට එක් සහෝදරියක් වන ෂිරෝමි ප්රියංගිකා, ඔහුගේ මරණය දක්වා කුමාරයා රැකබලා ගත්තේය. කෙසේවෙතත්, ඔහු විවාහ වී සිටියද, විවාහයට එකඟ නොවූ සෙසු කාන්තා සිංගර් නිරෝෂා විරාජෙජිනාව සමඟ සම්බන්ධතාවයක් පැවැත්වූ බව ඔහු ප්රකාශ කළේය. කුමාරයා සිය අධ්යාපනය එල්පිටියා ආනන්ද මහා විද්යාලයෙන් අවසන් කර පාසලේදී ඔහුගේ සංගීත හැකියාවන් ප්රදර්ශනය කළේය. ඔහුගේ පළමු සංගීත ගුරුවරයා වූයේ නිහාල් ගමෙවා ය. 1987-89 ජේවීපී කැරැල්ල හේතුවෙන් පන්ති බාධා කරමින් සිටියහ. 1990 දී කුමාරයා ජාතික තරුණ සේවා කවුන්සිලයේ බෙල්වුඩ් සංගීත ඇකඩමියට සහභාගී වූ අතර ගමනේවා යටතේ වයලීනමවාදියෙකු ලෙස සේවය කළේය. ඔහු වසර තුනකට පසු චන්දන ලියනාරාචි සහ ජයසිරි අමරසේකර වැනි සෙසු සංගීත ians යන් වසර තුනකට පසු බෙල්වුඩ් ඩිප්ලෝමාව සම්පූර්ණ කළේය. නිම කිරීමත් සමඟ ඔහු තම සංගීත ගුරුවරයාගෙන් ඉල්ලා සිටියේ ඔහු වෙනුවෙන් ගීත කිහිපයක් ලිවීමටයි. ඒ සමඟම ගෙමේවා ඔහු වෙනුවෙන් ගීත හතරක්, වේරමූන් සිනිඳු, වේර කොනාකා හිදා, අඩේනා කුමාරියික්. ශ්රී ලංකාවේ සංගීත ක්ෂේත්රයේ ප්රථම වතාවට ඔක්ටැපැඩ් හි ඔක්ටැපැඩ් භාවිතය හේතුවෙන් මෙම ගීත හතර ඉස්මතු විය.",
        "Lyrics of a song": "සංගීත සාගරේ පෙම් සිහින මාරුතේ\nසන්සුන් හදක් නැවක් සේ ගිලේ මායාවකින්\nසංගීත සාගරේ ...................\nසංගීත සාගරේ\n\nකැකුළු මල සේ නැවුම් වී සිතක් මෝදුවේ\nසළෙල බඹරුන් ඇදී ඒ මලට ලොල් සිතේ\nරඟන තාලේ බලා ගයන ගීතේ අසා\nමත් වේවිදෝ\nසංගීත සාගරේ ...................\nසංගීත සාගරේ\n\nසිතට වහලෙක් නොවේ නම් කිරුළු පළඳයි ලොවේ\nඉක්මන් සුවේ සොයා යයි ගැඹුරු අවපාතයේ\nඈත දුර ගැන සිතා සිත් පහන් වේවි නම්\nජය මාවතයි\nසංගීත සාගරේ ...................\nසංගීත සාගරේ",
        "Songs": "Adrareta Koduufara, Ahinsakama sanda, ahinsakawa sanda av av, amma denna, අජාලිකා අංජියිකා, අගමිකා කණ්ඩුල, අතුගාලිකා විහාර, ඩිලුලූ.",
        "email": ""
    },
    {
        "Name": "ප්‍රියා සූරියසේන",
        "Birth Date": "27-Oct-52",
        "City": "නාත්තන්ඩිය",
        "Biography": "එම්. එල්. ඩී. ප්රියධර්ෂා සුරියසේන ලියනාගේ (1952 ඔක්තෝබර් 27) ජනප්රියයි. සමූහ ගායිකාවක් ලෙස තරුණ ගායනා කණ්ඩායමෙන් සූරියසේන මහතාට තම දක්ෂතා පෙන්වීමට හැකි වූ අතර ඇතා රන්වියනා, මටා රණජනා, අඩා ඩේවසේ සහ සුදු පැහැති පැරවි රේන. ඔහු 1952 ඔක්තෝබර් 27 වන දින ශ්රී ලංකාවේ පුත්තලම් දිස්ත්රික්කයේ නට්ටන්දිය, එම්පැන්ඩන්දේ මධ්යම පන්තික පවුලක උපත ලැබීය. ඔහුගේ පියා එම්. ඩී. ජේ. ජේ. ඔහුගේ මව ඒ. එම්. පොඩි මෙනිකේ. ඔහු තිදෙනෙකුගේ පවුලක සිටින එකම පුතා වූ ඔහුය. ඔහු ප්රාථමික අධ්යාපනය නට්ටන්දියා ප්රාථමික පාසලේදී ඔහුගේ අ.පො.ස. ඕ / එල් සහ උසස් පෙළ සහ උසස් පෙළ සහ උසස් පෙළ 1900 ක් දිස්ත්රික්කයේ මැඩම්පේ මධ්යම විද්යාලයේ දී සම්පූර්ණ කළේය. 1978 දී ඔහු සංගීත ගුරුවරයෙකු වූ තමරා කුමාරි වීරසිංහ සමඟ විවාහ විය. මෙම යුවළට එක් පුතෙකු සහ දියණියන් තිදෙනෙක් සිටී. ලක්ෂිතා ආනන්ද විද්යාලයේ අධ්යාපනය ලැබූ අතර ලයනල් රන්වල සිට සංගීතය උනීපෑ ය. වැඩිමහල් දියණිය මිනෝෂි වෛද්යවරයෙකි. ඊළඟ දියණිය වන ඉරෝෂි, පෞද්ගලික බැංකුවක කළමනාකරුවෙකි. ලාබාලම දියණිය ගයාෂි යනු කළමනාකරණ උපාධිධාරී ය. ලක්ෂිතා විවාහ වී ඇත්තේ මියාරු පියතිලක සමඟ ය.",
        "Lyrics of a song": "සුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nපොත් පත් අහුරා\nමුදු ළැමට තුරුලු කරවා\nපොත් පත් අහුරා\nමුදු ළැමට තුරුලු කරවා\nපිරුණු සදක් සේ මහද දිලේ\nපිරුණු සදක් සේ මහද දිලේ\nයහලු යෙහෙළියන් අතරේ\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nමල් හිනා පිපී මුව මඩල පුරා රදවා\nමල් හිනා පිපී මුව මඩල පුරා රදවා\nමුතු අහුරක් සේ දසන් සලා\nමුතු අහුරක් සේ දසන් සලා\nඉර හද දහසක් පරදා\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ",
        "Songs": "මාගා වෙනස් කර ඇති අඩාරි සහ රාවීනා, අධිකරණ කිට්ටෙකෝ, මාගා වෙනස් කර ඇති, මාගා වෙනස් වී ඇති අතර, මාගා වෙනස් වී ඇති අතර මාගා පෙදෙස වෙනස් කර ඇත , මාඩා, සුදීෙලා, ආනා ඩයනාඩි-රින්ක්ව වෙනස් කර ඇති බව සලකුනක්",
        "email": ""
    },
    {
        "Name": "ප්‍රියානි ජයසිංහ",
        "Birth Date": "10-Jun-67",
        "City": "පානදුර",
        "Biography": "(1967 ජුනි 8 - 8 ජූලි 8) 2018 ජුලි 8) ශ්රී ලංකා ගීත රචකයෙකු සහ නිර්මාපකයෙකු විය. ශ්රී ලංකාවේ වඩාත් ජනප්රිය කලාකරුවෙකු වන ජයසිංහ මහතා සිංහල සංගීත ක්ෂේත්රයේ ජනප්රිය ගීත කිහිපයක් ගායනා කර තිබේ: කණ්ඩුල niwannam, සුන්දර හදාකාටා ඩී සහ අළුත් සඳ සඳු. ඇය 1967 ජුනි 10 වන දින ශ්රී ලංකාවේ පනාදුර හි උපත ලැබීය. ඇය පැනදුර වලනා මහා විද්යාලයේ වලනා මහා විද්යාවේ සිට අධ්යාපනය ලබා දුන්නාය. ඇගේ මාමා රොහානා වීරසිංහ යනු ශ්රී ලංකාවේ සංගීත ian යෙකු හා නිර්මාපකයෙකි. ඇය විවාහ වූයේ ඇය සමඟ ආරවුලක් ඇති වූ ප්රභාත් රසිකා සමඟ ය. මෙම යුවළට පුතුන් දෙදෙනෙක් සිටියහ. ඇයගේ අභාවයෙන් පසු ඇය සිය බිරිඳ රෂිනි තක්ෂිලා ෆොන්සේකා ෆොන්සේකා සහ ඔවුන්ගේ වැඩිමහල් පුත් ලෂිතා හසේරාල් ජපානයේ අධ්යාපනය ලැබූ අතර ඇය ඇගේ බාල පුත් ලොචන් නින්දාස් සහ ඔවුන්ගේ දරුවා සමඟ ජීවත් වූවා. ඇගේ සැමියා වසර ගණනාවක් තිස්සේ කුෂන් වැඩමුළුවක් ලෙස සේවය කළේය. ජනප්රිය ගායිකාවක් ලෙස ඇය කෙතේ නමක් ගෙන තිබුණද, ඇයගේ දක්ෂතාවය හෝ එම ක්රියාකාරකම් සඳහා තම ස්වාමිපුරුෂයාගෙන් කිසිදු සහයක් ලැබී ඇති බව පැවසේ. එහි ප්රති As ලයක් වශයෙන් ඇය සංගීත ප්රසංග හා අනෙකුත් කලා කටයුතුවලට සම්බන්ධ වූ අතර, ඇයගේ දරුවන් දෙදෙනා පෝෂණය කර ඔවුන්ගේ වගකීම් තනිවම ඉටු කළාය.",
        "Lyrics of a song": "කඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\n\nමල් පූදින්නේ දෑඟිලි අතරේ\nතැලී පෙලී මියැදෙන්න නොවේ\nමල් පූදින්නේ දෑඟිලි අතරේ\nතැලී පෙලී මියැදෙන්න නොවේ\nසෙනෙහෙ පුදන්නේ සෙනෙහෙ ලබන්නයි\nහිත රිදවා හඬවන්න නොවේ\nකඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\n\nසඳ පායන්නේ හිරු නැති ලෝකේ\nඝනඳුර දුරු කරවා ලන්නයි\nසඳ පායන්නේ හිරු නැති ලෝකේ\nඝනඳුර දුරු කරවා ලන්නයි\nසෙනෙහෙ පුදන්නේ අඳුරේ තනිවූ\nහිතකට එලියක් ලැබ දෙන්නයි\nකඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්",
        "Songs": "Alutth sanda alitha, අබිහානා මල් යටිසැටා කෝයි දරුණු තුවාලයක්, ඊට පෙර දන්නවා",
        "email": ""
    },
    {
        "Name": "ප්‍රියන්කර පෙරේරා",
        "Birth Date": "",
        "City": "පන්නිපිටිය",
        "Biography": "",
        "Lyrics of a song": "කොමල ලියා, බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nගත සීතල පහස ලබා\nලැම රන්වන් සුවඳ සොබා\nමුව මියිරුන් ලැබුව මෙමා\nසිකුරුලියා...\nමාව දමා යන්න ගියා සිකුරුලියා...\nකොමල ලියා බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nනෙත ඇඳි රුව ඔබය සුදු\nඅද ඒ නෙත කඳුළු බිඳූ\nආදරයෙන් ඔබව හැදූ\nසිකුරුලියා...\nමාව දමා යන්න ගියා සිකුරුලියා\nකොමල ලියා බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...",
        "Songs": "දැන්වීම් තබන්, සේනස් හි ආර්.එන්.එන්.",
        "email": "priyankara.perera@srilankasingers.com"
    },
    {
        "Name": "පුන්සිරි සොයිසා",
        "Birth Date": "5-Mar",
        "City": "මොරටුව",
        "Biography": "කලා භූෂනා, (මාර්තු 5 වන දින උපත ලැබූ) ශ්රී ලාංකික ගායිකාවක්. බොහෝ විට \"බිඳී යාමේ කඳුළු\" ලෙස හැඳින්වෙන, 1970 දශකයේ සිට පුන්සිරි ජනප්රිය පහරවල් කිහිපයක් ගායනා කර තිබේ. ඔහු පාගමනක් මාර්තු 5 වන දින එක් වැඩ කළ සහෝදරයෙකු, බාල සහෝදරයන් දෙදෙනෙකු සහ එක් බාල සොහොයුරියක් සමඟ මාර්තු 5 වන දින උපත ලැබීය. ඔහු මුලින්ම ගමේ බෞද්ධ මිශ්ර පාසලෙන් තුන්වන පන්තියේ අධ්යාපනය ලැබීය. ඉන්පසු ඔහු මොරටුවා මොරටුවා හි වේල්ස් හි කුමරුට ඇතුළු විය. පාසැලේදී ඔහු සෑම සාහිත්ය සමාජයකම ගීතයක් ගායනා කළේය. ඔහු විවාහ වී සිටින්නේ දිගුකාලීන හවුල්කරු කුමුදිකා පෙරේරා සමඟ ය. ඔහුගේ බිරිඳ ජීවත් වූයේ මොරටුවා හි එගෝඩා උයනා හි ය. පුතුණිසෝ ටික වේලාවක් මොරටුවා හි ජීවත් විය. බාධක තිබියදීත්, අපි විවාහ වූයේ 1978 දී ය. ඔවුන්ට දියණියන් තිදෙනෙක් සිටී. වැඩිමහල් දියණිය ඇක්නා පවානි ඉංජිනේරු සංස්ථාවේ සේවය කරයි. දෙවන දියණිය සාත්මාමි බුබිමාලා ජයවර්ධනපුර විශ්ව විද්යාලයෙන් උපාධිය ලබා ඇති අතර මේ වන විට පෞද්ගලික සමාගමක සේවය කරමින් සිටී. ඇය විශාරද විභාගය සමත් වූ අතර රාමාවට්ටේ හි පිහිටි සංහින්දිවෙට්ටා ​​හි සන්හින්ද කලයාතන හිදී අමරසිරි මුනසිංහ යටතේ සංගීතය හැදෑරුවාය. තුන්වන දියණිය විශාරණ උවිනි විදුලිබල මණ්ඩලයේ වැඩ කරයි. 2019 දී ඔහු 'නොහාන්ඩන් ලූන්' නමින් හොරානා ෂරියාපාලිහිදී ප්රසංගයක් පැවැත්වීය",
        "Lyrics of a song": "මා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\nමා තනියෙන් පෙම් කෙරුවේ ඔබ නෑ මට පෙම් කෙරුවේ\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\n\nහරි ලස්සණ අකුරුවලින් මුතු කැට වැනි මියුරු වදන්\nලියලා මට ආදරයෙන් දුන් සෙනෙහස සිහිනෙකි දැන්\nමුළු ජීවිතයම දුකකී කඳුළුයි දැන් මට අයිතී\nමා කඳුළින් ලියමි මෙසේ ................\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\n\nමගෙ ඇස්වල කඳුළු කැට දන්නව දුක් වෙන තරම\nමට පෙම් කළ ආදරය ඇයි නපුරු වෙලා මෙහෙම\nමම වැඳ වැඳ යලි කියමී ඔබ විතරයි මට අයිතී\nමා කඳුළින් ලියමි මෙසේ ................\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ",
        "Songs": "Aadararai kiyamin, Abidakakataata, අ",
        "email": ""
    },
    {
        "Name": "පුන්‍යා කත්‍රිආරච්චි",
        "Birth Date": "",
        "City": "පිලියන්දල",
        "Biography": "",
        "Lyrics of a song": "බකිනි ගහේ බකිනි මලින් පාර අසන්නේ\nකුරුන්ද ළග දෙල් ගහ යට නිවස තිබෙන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nකැකිරි වැලේ මල් පිපිලා ගේ පිළිකන්නේ\nඒ මල් පෙති වලින් ඔබට පවන් සලන්නේ\nකැකිරි වැලේ මල් පිපිලා ගේ පිළිකන්නේ\nඒ මල් පෙති වලින් ඔබට පවන් සලන්නේ\nදෙමාපියන්නේ වරද නොවෙන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nසේල වළලු රන් පවලම් නැතුවයි එන්නේ\nහදේ සුවද ආදරයයි අරගෙන එන්නේ\nසේල වළලු රන් පවලම් නැතුවයි එන්නේ\nහදේ සුවද ආදරයයි අරගෙන එන්නේ\nහනිකට එන්නේ\nහනිකට එන්නේ\nබකිනි ගහේ බකිනි මලින් පාර අසන්නේ\nකුරුන්ද ළග දෙල් ගහ යට නිවස තිබෙන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nහනිකට එන්නේ\nහනිකට එන්නේ\nකවදද එන්නේ\nකවදද එන්නේ",
        "Songs": "වියගම නොපෙන්නටා, මාර්තා මහකයි වෙබා, මාර්තා දහා සහ කේ",
        "email": "Punya.Kathriarachchi @srilankasingers.com"
    },
    {
        "Name": "ආර්. මුත්තුසාමි",
        "Birth Date": "5-Jan-26",
        "City": "තමිල්නාඩු, ඉන්දියාව",
        "Biography": "රමයා මුත්තසමි (1926 ජනවාරි 5) 1988 ජුනි 27) ශ්රී ලංකා සංගීත අධ්යක්ෂවරයකු සහ ගායකයා විය. ඔහු සංගීතය හසුරුවන්නේ කේ. ගුණරත්නම්ගේ නිෂ්පාදන සඳහා ය. මුතුසාමි උපත ලැබුවේ 1926 ජනවාරි 5 වන දින ඉන්දියාවේ තමිල්නාඩුව, ඉන්දියාවේ තමිල්නාඩුවේ නඩුලුහි නඩුලු, ඉන්දියාවේ තමිල්නාඩුවේ නඩුකම, ය. කුඩා කල සිටම මුතුසාමි වයලීනය සඳහා හඳුන්වා දෙන අතර වයස අවුරුදු දහය වන විට මෙවලම ප්රගුණ කරන ලදී. මුතුසාමි 1941 දී කඩාවු පෝරෝන්ඩු හි පළමු සිංහල චිත්රපටයේ සහකාර සංගීත අධ්යක්ෂක ලෙස වැඩ කළේය පසුව ඔහු ශ්රී ලංකාව වෙත ගොස් එහි පැවති ගුවන්විදුලි සිලෝන් දෙමළ වාද්ය වෘන්දයේ (1952 ඔක්තෝබර් 20) සාමාජිකයෙකු ලෙස කටයුතු කළ අතර පසුව ඉදිකරන ලද 1952 ඔක්තෝබර් 20) කන්දනාහි සන්දුරා මුරුගන් චිත්රාගාරයේ දී. සාර්ථක නිෂ්පාදක කේ. ගුණරත්නම් විසින් 1953 සිංහල චිත්රපට ප්රේමා තරංග සඳහා ඔහුගේ පළමු ඊයම් සංගීත අධ්යක්ෂණය හසුරුවා ඇති බව මුත්තසමි විසින් ඔහුගේ පළමු ඊයම් සංගීත අධ්යක්ෂණය හසුරුවා ඇත. චිත්රපටයේ දී ඔහු සිංහල පසුබිම ගායිකාවන් ධර්මදාස සහ ලතා වල්පොල ද මුරකරුවම ද යොමු කළේය. පසුව ඔහු අහාන්කාරා ස්ත්රිය (1953), මහිදියන් බිග්, ජාෆ් මිල්ටන් පෙරේරා, එච්.ආර්. ජෝතිපාල වැනි පාසල් 225 කට අධික චිත්රපට 225 කට අධික සංඛ්යාවක් සඳහා මඟ පෙන්වීම , ඇන්ජලීන් ගුණතිලකේ, සුජාතා අත්තනායක, ජීඑස්බී රාණි සහ නාරඩා දසෙකා. ඔහු 1958 දී ගුවන් විදුලි ලංකාවේ සහ 1981 වන තෙක් සංවිධානය සමඟ සේවය කළේය.",
        "Lyrics of a song": "අමතක කරලමු පැරණි කතා එක්වෙමු ජාතික දියුණ පතා දැන දැන කිම බැක්‍ෂෙනුයේ වරදේ ලොව කළ කළ දේ පල පල දේ අමතක කරලමු පැරණි කතා එක්වෙමු ජාතික දියුණ පතා\n\nඑක දරු කැළ මෙන් සිටිමු මතු අමුණමු සමගියේ අනගි මුතූ යොදවා දුරදිග ඔබගේ මොළේ පෙන්වමු මිනිසෙකු සතු වූ\n\nඅමතක කරලමු පැර\n\nනව නිපැයුම් අපේ රටෙහි සදා නව යුගයක් අපි කරමු උදා සිරිලක් මවගේ අනාගතේ රැඳී තිබෙන්නේ ඔබේ අතේ\n\nසිරිලක් මවගේ අනාගතේ රැඳී තිබෙන්නේ ඔබේ අතේ\n\nඅමතක කරලමු පැරණි කතා..... එක්වෙමු ජාතික දියුණ පතා......//",
        "Songs": "ගමනා නොදීයි ලොකායි ලොකායි, ජීනා හි",
        "email": ""
    },
    {
        "Name": "රනිල් මල්ලවආරච්චි",
        "Birth Date": "12-Apr-82",
        "City": "කැලණිය",
        "Biography": "රනිල් මල්ලවරාච්චි ශ්රී ලංකාවේ ජනප්රිය, ප්රසිද්ධ, ගායිකාවක් සිටී.ඔහු සංගීත ian මිල්ටන් මල්ලවරාච්චිගේ පුත්රයාය.තරුණ සංගීත රසිකයන් අතර කීර්තියට පත්වූ ඔහුගේ පියවරුන්ගේ පාද පියවර අනුගමනය කිරීම.1996 දී ඔහු තම පියා සමඟ ගීතයක් කළ අතර ඔහුගේ මංගල ඇල්බමය සඳහා ය.ඔහු වයස අවුරුදු හතරේ පසුවන විට ඔහුගේ පෙර පාසල් අධ්යාපනය ආරම්භ කළේය.පසුව ඔහු කොළඹ නාලන්දා විද්යාලයට ඇතුළත් විය.1998 දී ඔහුගේ පියා මිය ගියේය.පසුව මල්ලවරාච්චිගේ සංගීත වාහකයා වෙනස් කරන ලද්දේ, නිෂ්පාදකයින් තම පියවරුන්ගේ ප්රසිද්ධ ගීත ඔවුන්ගේ වෙළඳ ලකුණු යටතේ ගායනා කරන ලෙස ඔහුට ආරාධනා කළ බැවිනි.ඔහු මේ දක්වා ඇල්බම 17 ක් පමණ නිදහස් කර තිබේ.2010 දී ඔහු තම පවුල සමඟ ඕස්ට්රේලියාවට ගියේය.ඔහුට පුතුන් දෙදෙනෙකු සිටී.පන්වන් මල්ලවරාච්චි සංගීත පියවර",
        "Lyrics of a song": "තනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ\nමගෙ පාළු ලෝකයේ තනිවූ මෙමා\nසක්විති රජුන් හමුවේ නැත හිස නමා\nසිතුවිලි මගේ හසුරා ගත හැක නමා\nමට දුක සිතෙන්නේ ඔබ ගැන තමා\nතනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ\nඔබෙ චේතනා අගනා මා සිත දනී\nඅවට ලෝකයේ බැලුම් විස කටු වැනී\nඒ කටු අපේ දෙහදේ ගැඹුරේ ඇනී\nගලන දුක් වේදනා රුධිරය වැනී\nතනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ",
        "Songs": "හහතෑෂ්ගේ දියණිය, සෝයා, ආකා, ආආා,",
        "email": "ranil.mallawarachchi@srilankasingers.com"
    },
    {
        "Name": "රන්ජනී පෙරේරා",
        "Birth Date": "",
        "City": "කැලණිය",
        "Biography": "",
        "Lyrics of a song": "ශ්‍රි සම්බුද්ධ රාජා වඳිම්\n\nමා සෑසි තිලෝනා වඳිම්\n\nහද පුදසුන් සදා\n\nශ්‍රි බැතිමල් පුදා මා සෑසි තිලෝනා වදිම්\n\nඅංගුලීමාල නාලාගිරී\n\nලෝසතුන් රාග පාපෙන් පිරී අදමි පවීන් දැවූ දම් අමාවෙන් තෙමූ දම් රජාණන් වඳිම්\n\nසිව් සැකි සත් කෙලක් දුක දරා සිව් සුවේ පස් මරුන් මන් මරා පාරමී දම් පුරා බුදුවූ ලොව් තුරා දම් රජාණන් වඳිම් සිත් පුරා\n\nමුල් සෙවු වේදනා සාදනා ඉන් මිදූ සේක මේ ලෝ දනා අන්ධකාරේ නැසූ මිහිරි සදහම් දෙසු ලෝ පියාණන් වඳිමි සෑමද",
        "Songs": "ශ්‍රි සම්බුද්ධ රාජා වඳිම්",
        "email": "ranjani.perera@srilankasingers.com"
    },
    {
        "Name": "රෝහන බෝගඩ",
        "Birth Date": "15th September",
        "City": "පන්නිපිටිය",
        "Biography": "මාතර තෙලිජ්ජවිල ගම්මාන්යෙ සහොදර සහොදරියන් 09 දෙනක් සිටින පවුලක 08 වෙනියා වන රෝහන බෝගොඩ දකුණු පළාතෙන් බෝගොඩ පරපුරෙ සoගිත කේෂත්‍රයට පැමිණියෙ 70 දශකයේ මුල්බගයේදීය . පියා දේශීය ආදයම් පාලක දෙපාර්තමේන්තුවේ ප්‍රධාන ලිපිකරුවෙකු වස්යෙන් සේවය කර සිට දැනට අවුරුරුදු 15 කට ඉහත දී ජීවිතයෙන් සමුගත්තේය. පවුලේ බොහො දෙනෙක් අධ්‍යපන අමාත්‍යශයෙ ගුරු උපදේශකවරුන් (සoගිත ) පිළිබද උපාධිධාරියන් වෙති 1974 වර්ෂයේ ශ්‍රී ලoකා ගුවන් විදුලි සoස්ථාව මෙහෙයවු පිබිදෙන ගයක පරපුර වැඩසටහනේ ප්‍රථම ස්ථනය ලබා මේ සoගිත කේෂත්‍රරයට මුලින්ම පිවිසුන අතර 1975 වර්ෂයේ ශ්‍රී ලoකා පොලිස් දෙපාර්තමේන්තුවේ පොලිස් තුර්ය වඩක මන්ඩල්යෙ නිත්‍ය නිළධාරීයෙකු  වශයෙන් සේවයට බැදුන අතර අවුරුදු 03 ක සේවා කාලයෙන් පසු 1978 වර්ෂයේ එම රැකියවෙන් සමුගෙන 1978 මර්තු 01 වන දින සිට ශ්‍රී ලoකා ගුවන් විදුලි සoස්ථාවෙ වාදකයෙකු ලෙසත් සoගීත මෙහෙයවිමෙ කර්යත් සoගීත අoශයෙ පාලකවරයා ලෙසත් කටයුතු කර 2009 වර්ෂයේ ව්ශ්‍රම ලබා ඇත. එතන් සිට මෙම කේෂත්‍රයේ විවිධ අoශවල එනම් චිත්‍රපට කැසට්පට සහ ඒක පුද්ගල සoගීත ප්‍රශoග ගණනවක තබ්ලා වාදකයෙකු වශයෙන් 70 දශකයෙ අගභාගයෙ දී \"නෙතින් නෙත බලාලා\" ගීතයෙන් ජනතා ප්‍රසාදය දිනගෙන මෙතෙක් දිගු ගමනක් පමිණ් සිටි. \"නෙතින් නෙත බලාලා\",'ගoගා',මලක සුවද, \"නව රිද්ම\",'රෑ සද\" වැනි කැසට් පට හා සoයුක්තතැටි නිකුත් කර ඇති අතර චිත්‍රපට කිහිපයකද පසුබිම් ගායකයෙකු ලෙස කටයුතු කර ඇත.එනම් \"මා ඔබේ හිතවතා\",'ලදුනි ඔබ දෙවගනකී\",\"අනේ මාස්ටර්\",\"බොඩිගාඩ්\",\"ගුරුගෙදර\",\"මල්සර දොනි\",\"යුක්තියද ශක්තියද\",\"ඉන්ස්පෙක්ටර් ගීතා\", වැනි චිත්‍රපට වලය. ටෙලි නට්‍ය කිහිපයක ගීත ගයනා කර ඇති අතර සoගීත අධ්‍යක්ෂණයෙන්ද සහභාගි වී ඇත. එනම් \"පියඹන සල්ලි\",\"අම්මාවරුන්ගෙ දරුවො\",\"දෙවැනි අම්මා\" වැනි නට්‍ය ස්0ගීත අධ්‍යක්ෂණයෙන්ද කර ඇත. දැනට අයි ට්,ඇන් සුපිරි හපන ,දෙරන ඩ්‍රිම් ස්ටර්, අධ්‍යපන අමාත්‍යශයෙ සoගීත විනිසුරුවරයෙකු හැටියටද ජතික තරුණ සේවා සභාවෙ යොවුන්සම්මන විනිසුරුවරයෙකු ලෙසද දැනට කටයුතු කර්න්නෙමි",
        "Lyrics of a song": "ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා //\n\nහිරු සඳු ඇති තුරා සසර වසනා තුරා ඉන්නට බැහැ තරහා වෙලා ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා\n\nපෑව සෙනේ අමනාපෙ නිසා මෝදු වෙලා තිබුණාට වඩා // සිත සැනසුන් සාදනා ඔබේ හසරැල් මට වාසනා //\n\nඔබටයි මේ ආරාධනා\n\nඔබටයි මේ ආයාචනා\n\nතරහා උනත් දෙදෙනා ඊයේ තරහ නොවෙමු කිසිදා ආයේ // යළි නොම ඒ වේදනා ඔබේ හසරැල් මට වාසනා //\n\nහිරු සඳු ඇති තුරා සසර වසනා තුරා ඉන්නට බැහැ තරහා\n\nඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා // ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා",
        "Songs": "දිවි කතරට, කන්දුලක් වෑටෙනම්, නෙතින් නෙත බලාල, පෙල රවටල, ඔබටයි මේ ආරාධනා",
        "email": ""
    },
    {
        "Name": "රූකාන්ත ගුණතිලක",
        "Birth Date": "5-Sep-59",
        "City": "කෑගල්ල",
        "Biography": "මාරියෝ තේජස (1959 සැප්තැම්බර් 5 වන දින 5) උපත ලැබීය), ශ්රී ලාංකික ගායකයෙක්, සංගීත ian යෙකු සහ ගීත රචකයෙකු. ශ්රී ලංකාවේ වඩාත්ම බලගතු සංගීත කලාකරුවන්ගෙන් එක් අයෙකු වන රූකාන්ත 1980 දශකයේ අග භාගයේ නවක ගායිකාවක් ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළේය. ඔහු නිතරම තම බිරිඳ චන්ද්රලේඛ පෙරේරා සමඟ යුගල සිදු කරයි. ඔහුගේ දියණියන් වැසි චාරුකා සහ සුළං නිසා ගායකයෝ ය. රූකන්ත යනු ශ්රී ලංකාවේ පොප් සහ හිතාමතාම කර්මාන්තයේ වඩාත්ම සාර්ථක සංගීත ians යෙකි. ඔහු ශ්රී ලාංකිකයන් අතර පොප්හි රජු ලෙස හැඳින්වේ. ඔහුගේ ඇල්බම ශ්රී ලංකාවේ පිටපත් 15,000 ක් පමණ විකුණා ඇත. ඔහු 1980 ගණන්වල ඔහුගේ ගීත සමඟ ශ්රී ලංකා සංගීත ක්ෂේත්රය වෙනස් කළ පුද්ගලයා ලෙස හැඳින්වේ. රූකන්ත 1959 සැප්තැම්බර් 5 වන දින ශ්රී ලංකාවේ මධ්යම පන්තික පවුලක උපත ලැබීය. ඔහු ඉතා කුඩා අවධියේ සිට සංගීතයට ආදරය කළේය. එහි ප්රති As ලයක් වශයෙන්, පියානෝව වාදනය කිරීමට ඔහුට ඉගැන්වූයේ ඔහුගේ දෙමව්පියන් ඔහුව අසල සංගීත ගුරුවරයෙකු වෙත යැව්වේ ය. ඔහු ප්රාථමික අධ්යාපනය සඳහා කෙගාලේ ශාන්ත මරියා විද්යාලයට ඇතුළත් විය. ඔහු සංගීතය ඉගෙන ගත්තේ ස්ටැන්ලි පීරිස් සහ සිරිල් බ්රවුන් වැනි මහා සංගීත ians යන්ගෙන් වන මහනුවර ශාන්ත අන්තෝනි විද්යාලයේ ය. ඔහු ද ජී.සී.ඊ ද කළේය. සංගීත ක්ෂේත්රයට පැමිණි පසු උසස් පෙළ. රූකන්ත ගායක චන්ද්රාලෙක්හා පෙරේරා සමඟ විවාහකයි.",
        "Lyrics of a song": "ආදර මගෙ ජේසුනී\nකලකින් ඔබ අමතමී\nකොහොමද ඔබගේ තතූ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබෙ දහමේ ගුණ නසා\nඅද ඔබ ළඟ වැඳ වැටී හඬමී\nමා හසුවී මාරුතේ\nමඟ වැරදී මාවතේ\nමේ ලියමන ලියමි මා සමිඳේ\nමහ කරුණා සාගරේ\nඔබ පමණයි ආදරේ\nසැනසුම මට දෙන්නකෝ සමිඳේ\nආදර මගෙ ජේසුනී\nකලකින් ඔබ අමතමී\nකොහොමද ඔබගේ තතූ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබෙ දහමේ ගුණ නසා\nඅද ඔබ ළඟ වැඳ වැටී හඬමී\nජේසුනි මම ආදරෙයි\nඔබෙ පෙම ඊටත් වැඩියි\nසැමදා මම ණයගැතියි ඔබට\nඔබ දුන් හැම දේටමත්\nමට දුන් නැති දේ හටත්\nතුති පුදනෙමි ආදරෙන් සමිඳේ\nආදර මගෙ ජේසුනී\nහමුවෙමු යළි මතු දිනේ\nදින දින වැජඹේ ලොවේ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබ අනුකම්පා කළා\nමම ඔබ ළඟ වැඳ වැටී හඬමී",
        "Songs": "ඉසලා මැලේ කියලා, අදා කුලේ කයිලා, අම්බා පෙම් ලතා, අම්බා පෙම්බා සෙවාාවා, අම්මා දම්බා සෙවනාලි, අම්මා දහායාක්, අතාතාරුත් කුතාරේ",
        "email": "rookantha.gunathilake@srilankasingers.com"
    },
    {
        "Name": "රොෂාන් ශාන්ත බුලේගොඩ",
        "Birth Date": "",
        "City": "මහරගම",
        "Biography": "රොෂාන්ශාන්ත බුලෙගොඩ යනු ශ්රී ලංකාවේ ජනප්රිය, ප්රසිද්ධ, ගායිකාවක්.ඔහු අධ්යාපනය ලැබුවේ කොළඹ නාලන්දා විද්යාලයේ ය.",
        "Lyrics of a song": "එක් පෙති මලක් විය නුඹ මගේ අත් දෙකට\nනෙලා නොගත්තේ මගෙ බෝසත් කමට\nහැරගිය දිනේ නාවත් මා ගම් දොරට\nආවේ ඇයිද විරහී සිත අද්දරට\nවිශ්මිත ගමට අදහන්නට බෑ තවම\nමා හැර දමා නුඹ ගිය මග ගැන අරුම\nසතු කරගන්න මුල් පෙම නොපිදූ බැවින\nදුක්බර හිතට කීවෙමි නොහඬන ලෙසින\nඑක් පෙති මලක් විය නුඹ මගේ අත් දෙකට...\nසිටිනා කොදෙව්වක නුඹ සැප විඳී නම්\nම වෙතින් ලැබුණු ආදරයත් ලැබේ නම්\nමතකය නුඹට හිරිහැරයක් නොවේ නම්\nතව කුමකටද දුක් ගී කල්පනාවන්\nතව කුමකටද දුක් ගී කල්පනාවන්///",
        "Songs": "Daha Athe Duwana, එක් පෙති මලක්, Nihanda Arana, Oba malak, Sandak Nam, Deepika Thama Tharunai",
        "email": "Shantha.Bulegoda@srilankasingers.com"
    },
    {
        "Name": "රුක්මණී දේවී",
        "Birth Date": "15-Jan-23",
        "City": "නුවරඑළිය",
        "Biography": "ඩේසි රසම්මා ඩැනියෙල්ස්, ජනප්රිය වී, ජනප්රිය වී (1923 ජනවාරි 28 දින 1978 ජනවාරි 28) ශ්රී ලාංකික සිනමා නිළියක් සහ ගායිකාවක් වූ අතර බොහෝ විට \"ශ්රී ලංකාවේ රාත්රී භෝජන සංග්රහය\" ලෙස බොහෝ විට පිළිගත් අයෙකි.ඇය එය වේදිකාවෙන් රිදී තිරයට ගෙන, ඇය මිය යන විට චිත්රපට 100 කට ආසන්නයේ රඟපෑවාය.ගායනය සඳහා සමාන ආශාවක් තිබීම මෙන්ම තනු කල්පිත හ voice ක්ද, ඇය ග්රැමෆෝන් යුගයේ ශ්රී ලංකාවේ ප්රමුඛතම ගායිකාවයි.ඇගේ මරණයෙන් පසු, 1979 සරසවිය සම්මාන උළෙලේදී ඇයට සරසවිය 'රං තිසර' - ජීවිත කාලය පුරාම සම්මානය පිරිනමන ලදී.",
        "Lyrics of a song": "මා ඔබ හමුවූ දා මේ හද නැළවූදා\nගැයු ගීතේ සිහිනේ රස වෑහේ\nරැව්දේ දෙසවන්හි දිවා රෑ සදා\n\nසන්තෝසේ ආසාවේ මහිමේ කියා\nමගෙ දෑසයි ඔබෙ දෑසයි පාවී ගියා\nපැතුවා සේ සිතුවා සේ හමුවී සොයා\nඅද ආයේ දුටුවා ඔයා\nමා ඔබ හමුවූ දා ................\n\nසැනසිල්ල නැළවිල්ල පිරිලා සිතේ\nඔබෙ බැල්ම මගෙ බැල්මෙ රැඳිලා ඇතේ\nසිත මාගෙ මල වාගෙ පුබුදා තියා\nඅද ආයෙ දුටුවා ඔයා\nමා ඔබ හමුවූ දා ................",
        "Songs": "අඩා හන්දනවා හිමියානි, අදාරා නාඩියා ගාලා, අරායා පනා සුඩා, අදායා සුඩා, ඇන්ඩේනා අරා පතරය, ඇනා සුදේඕ අරා පොටා වලා, ඒනා සුදේෝ පීමා ලෝව්, ඒ.අයි.පී.",
        "email": ""
    },
    {
        "Name": "රූපා ඉන්දුමතී",
        "Birth Date": "",
        "City": "පිලියන්දල",
        "Biography": "රූපා රුහියා යනු ශ්රී ලාංකික සංගීත ian යෙකු හා සිංගර් ය",
        "Lyrics of a song": "කුරුල්ලනේ පැණි කුරුල්ලනේ\n\n- පාට පාට පැණි කුරුල්ලනේ මටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට ආසයි කුරුල්ලනේ\n\nකුරුල්ලනේ පැණි කුරුල්ලනේ\n\n(රුවන් තාරකා මැදින් පියාඹා සඳුන් සමීරේ පාවිලා)//\n\nසුරංගනාවන් දකින්න යන්නම් සඳෙන් එහා දිලෙනා ලෝක්කේ කුරුල්ලනේ පැණි කුරුල්ලනේ - පාට පාට පැණි කුරුල්ලනේ\n\nමටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට කුරුල්ලනේ පැණි කුරුල්ලනේ\n\n(නැවුම් පැතුම් පිරි හැගුම් මවාලා කොහෙන්ද ආරාධනා ගලයි)// \nසිතුම් සඳැල්ලේ බිගුන් කියන්නේ ඒ\n\nආසයි කුරුල්ලනේ)//\n\nරහසද\n\nමාගේ සුහදේ\n\nකුරුල්ලනේ පැණි කුරුල්ලනේ - පාට පාට පැණි කුරුල්ලනේ මටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට ආසයි කුරුල්ලනේ}// \n(කුරුල්ලනේ පැණි කුරුල්ලනේ)////",
        "Songs": "දේශයෙන් ඩෙලා, මජකකා සතිය, ඉංග්රීසි බලු තේරු හරුලේ, සාවුල්ලාන් ඉසොලයිට්",
        "email": "rupa.indumathi@srilankasingers.com"
    },
    {
        "Name": "රෝහණ වීරසිංහ",
        "Birth Date": "18-Feb-49",
        "City": "මාතර",
        "Biography": "ආචාර්ය.රොහානා වීරසිංහ ශ්රී ලාංකික සංගීත ian යෙක්, රචනාකරුවෙකු සහ ගායකයෙකි.වීරසිංහ 1949 පෙබරවාරි 18 වන දින දකුණු ශ්රී ලංකාවේ මාතරා හි ඇල්ගිරියා හි උපත ලැබීය.ඔහු තම දෙමාපියන්ගේ බාල දරුවා වූ හෙන්රි වීරසිංහ සහ සෙලාලින් වීරසිංහ.1954 දී වීරසිංහ මහතා නුවර එලියා හි හොඳ ෂෙපර්ඩ් ෆොම්ප්ඩ් කම්බල් කන්යාරාමයක පාසල් අධ්යාපනය ආරම්භ කළ අතර පසුව විසාවර්රා බෞද්ධ පාසලේ රුවන් එලියා, වෙලිමඩා මහා විද්යාලය සහ ගාමිනි මහා විද්යාලය නුවර එලියා වෙත ගෙන ගියේය.1977 දී වීරසිංහ මහතා වෘත්තියේ නටන ගුරුවරයෙකු වන ලීලා බීට්රයිස් ද සිල්වා සමඟ විවාහ විය.ඔවුන්ට පුතුන් දෙදෙනෙක්, කළුින්දූ ගජබා සහ චිරත් කනිෂ්ක.ඔහුගේ ous ාති දියණිය ප්රියසි ජයසිංහ මහතා ද ශ්රී ලංකාවේ ජනප්රිය නිළියක වූ අතර ඔහු ජනප්රිය පහර කණ්ඩුල නිම්වනාම් සහ සුන්දුරා හදාටාටා ගායනා කළේය.2018 ජූලි 18 වන දින ඇය සිය සැමියා විසුරුවා හැරියේ වයස අවුරුදු 51 දී මිය ගියේය.",
        "Lyrics of a song": "තනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nසිව් වසරක පෙම් ගීතය ගොළු වෙලා ගියාදෝ\nසිව් වසරක පෙම් ගීතය ගොළු වෙලා ගියාදෝ\nඅළුත් ලොවක ඔබ සතුටින් කිරුළු පැළඳුවාදෝ\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nමායාවකි ප්රේමය මා හදවත රිදවූයේ\nමායාවකි ප්රේමය මා හදවත රිදවූයේ\nසෝ ගීයකි දුක් බර වූ සැනසුම කොහි වේදෝ\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්",
        "Songs": "Alubangama Alunala, Asiwan - කලාප - කලාපීය ගීතය, අතා සම්න්සරේ, බින්දුහු අන්නාතාවා, බින්දු අන්නාතාවා, සූනාන් මල් වවා, ගාමන් මල් වටා",
        "email": ""
    },
    {
        "Name": "රනිදු ලංකාගේ",
        "Birth Date": "1982",
        "City": "කොළඹ",
        "Biography": "සිංහල ආර්එන්බී / පොප් හි ජාත්යන්තර පැතිකඩ ඔසවා තැබූ සිංහල ආර් ඇන්ඩ් බී සහ හිප් හොප් චිත්ර ශිල්පියෙකි.BBC රේඩියෝ 1 හි පැවැත්වීමට නියමිත පළමු සිංහල කලාකරුවා 1 සහ පළමු සිංහල තනිකඩයාගේ මැවුම්කරු එම්ටීවී සහ චැනල් වී සහ Z සංගීත ඉන්දියාව යන රටවල පැවැත්විය යුතු පළමු සිංහල කලාකරුවා වන ලංකාගේ ය.ඔහු යේල් විශ්ව විද්යාලයෙන් ආර්ථික විද්යාව පිළිබඳ උපාධිධාරියෙකි.2000 දී තරඟකාරී පොදු අධ්යාපන සහතිකයේ තෙවැනි මහා අධ්යාපන සහතිකයේ තෙවැනි ස්ථානයක තෙවැනි ස්ථානයේ රණු අධ්යාපනය ලැබීය.ඔහු ආසියානු කනිෂ් SO ශූරතාවලියේදී ශ්රී ලංකාව නියෝජනය කර රාජකීය විද්යාලය සඳහා ක්රිකට් ක්රීඩා කර තිබේ.",
        "Lyrics of a song": "හිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nකිසිදා අඳුරේ හඬවන්නෙ නෑ\nහෑඬුවත් සොඳුරේ රිදවන්නෙ නෑ\nදිවියේ මතු දා තනිවෙන්නෙ නෑ\nජිවිතේ හසරැල් ආදරේ අභිමණ්\nසිහිනේ සැතපී අපි ඉන්නෙ නෑ\nපවනේ සැඟවී අපි යන්නෙ නෑ\nමෙලොවේ කිසිදා වෙන්වෙන්නෙ නෑ\nප්රේමයෙ අරැමේ\nඑ ඔබේ මහිමේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nකිසිදා අඳුරේ හඬවන්නෙ නෑ\nහෑඬුවත් සොඳුරේ රිදවන්නෙ නෑ\nදිවියේ මතු දා තනිවෙන්නෙ නෑ\nජිවිතේ හසරැල් ආදරේ අභිමණ්\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ",
        "Songs": "අදාරයියි Hadwen,",
        "email": ""
    },
    {
        "Name": "සහේලි රෝචනා ගමගේ",
        "Birth Date": "8-Mar-88",
        "City": "කොළඹ",
        "Biography": "සාලෙල්යි රොචනා ගමගේ (උපත 1988 මාර්තු 8) ශ්රී ලාංකික ගායකයෙක් සහ වෛද්යවරයෙකි.ඇය \"විශාරද\" යන මාතෘකාව දරයි.ශ්රී ලංකා සිවිල් යුද්ධයේදී ශ්රී ලංකා සිවිල් යුද්ධයේදී සටන් කළ 'අයුබෝවා, මහාරාජනානි' (ඔබට ශ්රේෂ් krainge මහාරාජනානි '(ඔබට ශ්රේෂ් kara.",
        "Lyrics of a song": "සිව් මහ ඔඹුන් දුන් විවරනින් අපටත් රජෙක් හළව ඇතේ ඒ මහා රජුන් නෑ පෙළහරින් මේ දෙරණ එයත් කළේ ආයුබෝවේවා..... මහරනණෙනි....\n\nයන පටුන උතුරින් දකුණින් දෙවුන්දර තුඩුවෙන්\n\nනැගුණු දුක් හෝ සුසුම් නිවමන් සමඟ ඔල මහිමෙන් දෙස් විදෙස් අභියෝග වූ ගල මහරජාණෙනි ආයුබෝවේවා... මරණයෙනි....\n\nනැගෙනහිර අභිමන්\n\nසුපහන් උදානය ගෙන දුන් උතුරුකරයට වහන්නය දෙරණ දිනු දෙවිඳුන් දෙස් විදෙක් ඇස් මවිත කරවිය\n\nආයුබෝවේවා.... මහරජාණෙනි....",
        "Songs": "අබමාමාවතී වු ශ්රී ලංකා වැහුනා), \"",
        "email": ""
    },
    {
        "Name": "සනත් නන්දසිරි",
        "Birth Date": "15-Feb-42",
        "City": "ගොතටුව",
        "Biography": "මහාචාර්ය සංගීත්න් හේරත් මුදියන්සලේජ් ඔහු ශ්රී ලංකාවේ දෘශ්ය හා ප්රසාංගික කලා විශ්ව විද්යාලයේ වත්මන් කුලපති වේ. ශ්රී ලංකා සංගීතයේ සුවිශේෂී ගායිකාවක් වන නන්දසිරි දශක හයකට වඩා වැඩි කාලයක් පුරා තම රචනාකරුවන් සඳහා සම්මාන කිහිපයක් ලැබී තිබේ. ඔහු සංගීතය රචනාමයිම් සඳමලිගිගේ රූකඩයිමා වෙත රචනා කළේය. නන්දසිරි 1942 පෙබරවාරි 15 ​​වන දින ශ්රී ලංකාවේ ගෝතටුව, ශ්රී ලංකාවේ ගෝතටුව, එච්. එම්. විලියම් පෙරේරා සහ ගෘහණියක් වන ඩෝනා අමලින් කතෝගම්පෝලා ලෙස උපත ලැබීය. ඔහු ප්රාථමික අධ්යාපනය ලබා ගත්තේ ගොතටුව මහා විද්යාලයෙන් සහ ඩෙමාටගොඩ ශාන්ත මැතිව්ගේ විද්යාලය සාමාන්ය පෙළ ඕ / එල්එස් සඳහා ය. ඉන්පසු ඔහු උසස් පෙළ සඳහා මහාබෝධි මහා විද්යාලයට ඇතුළත් වූ අතර අවසානයේ ඉංග්රීසි ඉගෙනීම සඳහා ස්ටැෆර්ඩ් විද්යාලය. පාසල් කාලවලදී ඔහු මලල ක්රීඩකයෙකු ලෙස මෙන්ම එල්ලේ ක්රීඩකයෙකු ලෙස ද එක් කළේය. ඔහු හොඳ කෙටි දුර ධාවකයෙකු වූ අතර මීටර් 100 තුළ කුසලාන දිනා ගත්තේය. නන්දසිරිගේ එක් වැඩිමහල් සහෝදරියක්, එක් වැඩ කළ සහෝදරයෙක්, එක් බාල සොහොයුරියක් සහ එක් බාල සහෝදරයෙක්, නිමල් චන්ද්රසිරි. නන්දසිරි 1971 දෙසැම්බර් 18 වන දින ගායක මල්කාන්ති නන්දසිරි නන්දසිරි නන්දසිරි නෙන්ඩසිරි නෙන්ඩාසිරි නන්දසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නෙන්ඩසිරි නන්දසිරි නන්දසිරි නෙන්ඩාසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නන්දසිරි නාට්යයේදී හමුවිය. ඔවුන් විවාහයට පෙර සහ පසු ගීත මත සහයෝගයෙන් කටයුතු කළහ. ඔවුන්ගේ පුතා 1971 දී උපත ලැබූ විට, ඔහු සාමාන්ය අධික දරුවෙකු වූ අතර සංජය මාහාවා යන නම තැබීය. නමුත් පුත්රයා දින තුනකට පසු මිය ගියේය. ඔවුන්ගේ දෙවන දරුවා 1974 පෙබරවාරි 14 වන දින උපත ලැබූ ලේහාමානි අනුරාධ, වූ අනුරාධ, සංගීත ian යෙකු වන අනුරාධ, සංගීත ian යෙකි. ඇගේ සැමියා නිහාල් වික්රමදේසිරිදිරිිසූරිය සමඟ ශ්රී ලංකාවට පැමිණෙමින් තිබේ. වැඩිමහල් දියණිය ලෙස උපත ලැබූ මල්කාන්තිට සහෝදරියන් තිදෙනෙක් සිටී: නිර්මලා, නිරන්ජල, සකුන්තලා සහ සහෝදරයන් දෙදෙනා: කුමාර් සහ මනෝජ්. නිර්මලා රණතුංග ද ගායිකාවක් වන අතර ඔහු කැපී පෙනෙන තබ්ලා ක්රීඩකයෙකු සමඟ විවාහ වූ සිංගර් විජරත්න රණතුංග සමඟ විවාහ විය. නිර්මලාගේ දියණිය සෙව්වාන්ඩි රණතුංග ද ගායකයෙකි. නිජලා සරෝජ්නි 2010 මාර්තු 26 වන දින වයස අවුරුදු 63 දී 2010 මාර්තු 26 වන දින මියගිය අබවර්ධන අබවර්ධන අබවර්ධන අබේවර්ධනගේ අබේවර්ධනගේ අබේවර්ධන සමඟ විවාහ වූ ගායකයෙකි. සකුන්තලා මැනිලාහි වෙරිතාස් රේඩියෝවේ වැඩ කළේය. මනෝජ් පීරිස් යනු සුප්රසිද්ධ තබ්ලා වාදකයෙකු වන අතර ශ්රී ලංකාවේ සංගීත ian යෙකි.",
        "Lyrics of a song": "දේදුන්නේ පාට පාටින් ආදරේ බැන්දු \nසංසාරේ වන්දනාවේ ප්‍රේමයේ ළන්දු \nසන්ධ්‍යාවේ නිම් වළල්ලේ මායාවී දෑස දැල්වේ \nකවුරුන්දෝ ඈ නොවේදෝ ඈ මගේ නේදෝ // \nදේදුන්නේ පාට පාටින් ...................\n\nගංගාවේ ගීතයක් වී ගිම්හානේ මේඝයක් වී \nසන්තාපේ අංගනාවී ඈ මාගේ නේදෝ \nතුන්කල් දකිනා ඇල්මෙන් රඳනා \nතන්හාවකින් ළං ළං වෙනා \nදේදුන්නේ පාට පාටින් ...................\n\nරන් මෙවුලේ නෙත් රැඳේවි පා යුග්මේ සිත් ඇලේවී \nමල් යහනේ දේවතාවී ඈ මාගේ නේදෝ \nදෑතේ පැටලී කාමී අඳුරේ \nකැන්දා ගනී මෝහනය වී \nදේදුන්නේ පාට පාටින්................//",
        "Songs": "නවු ලොවා මේජන්, නළය සුවද, සීතා රා වසන්ත, අවදැක් කලා",
        "email": "sanath.nandasiri@srilankasingers.com"
    },
    {
        "Name": "සන්තුෂ් වීරමන්",
        "Birth Date": "5-Sep-77",
        "City": "කොළඹ",
        "Biography": "සන්තූෂ් වීරමන් උපත ලැබුවේ 1977 සැප්තැම්බර් 5 වන දින රිචඩ් පියරිස් හි විශ්රාමික අලෙවිකරණ අධ්යක්ෂක නාලකා වීරමන්ට ය.ඔහු සිංගර් දුෂියන්ත් වීරමන්ගේ වැඩිමහල් සහෝදරයා ය.සන්තුෂ් කොළඹ රාජකීය විද්යාලයේ අධ්යාපනය ලැබූ අතර එහිදී ඔහු සංගීතය, කලාව සහ ක්රීඩා මෙන්ම ශාස්ත්ර ics යින් ද විශිෂ්ට විය.අලෙවිකරණය සහ කළමනාකරණයේ ද්විත්ව මේජර්වරයකු සමඟ ඔහු සිය උපාධිය සම්පූර්ණ කළේය.සන්තූෂ් වීරමන්ගේ මව සංගීත පවුලක සිට කුඩා කල සිටම සංගීතයට පිවිසීමට බලපෑවේය.සන්තූෂ් වීරමන් සහ බතියා ජයකොඩි ව්යාපෘති කිහිපයක් මත සහයෝගයෙන් කටයුතු කළ අතර එය Bns සෑදීමට හේතු විය.ඔවුන් පසුගිය දශක දෙක තුළ ශ්රී ලංකාවේ වඩාත්ම වාණිජමය වශයෙන් සාර්ථක සංගීත පනහක් වී තිබේ.",
        "Lyrics of a song": "චාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ\n\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\n\nසන්සුන් සුසුම් ද කැළඹි\nඇයිද මොකදැයි ඇහුවා\nරාගයේ චන්ද්ර හැඟුමන්\nරණ්ඩු කෙරුවා\n\nමං කෙසේ කොයි ලෙසේ මුමුණ\nමේ ශෝක ගීතේ\nකවුරුවත් දන්නෙ නෑ දැන් මේ\nමං ඉන්නෙ හිරගේ\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\n\nදිවි ගිම් නිවෙන්න පැතුවේ\nමදුර ස්වරයයි ඔබගේ\nආදරේ හීනයක් නම්\nහැබෑ නොවෙනා\n\nමං කෙසේ දැවි දැවී ඉන්නෙ\nමේ වේදනාවෙන්\nඇස් අගින් ඔබ ලියූ කවි ගී\nමුමුණන්න මුවඟින්\n\nඔය මන්දහාසයෙන්\nසැනහේවි ජීවිතේ\nසෝතාප සඟවන්න\nඔබ එන්න ආදරෙන්\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ",
        "Songs": "අසූඩියිනි එල්ලීනා, ඒ.අයි.",
        "email": ""
    },
    {
        "Name": "ශිහාන් මිහිරංග",
        "Birth Date": "18-Mar-85",
        "City": "කොළඹ",
        "Biography": "බෙන්ට් (උපත 1985 මාර්තු 18), ශ්රී ලාංකික සංගීත ian යෙකු, රචනා සහ ගීත රචකයෙකු වේ. යථාර්ථවාදී සංදර්ශනවල හොඳම නිෂ්පාදනයක් ලෙස මිහිරංග බොහෝ විට ශ්රී ලංකාවේ තරුණ තරුණියන්ගේ \"සිහින පිරිමි ළමයා\" ලෙස හැඳින්වේ. 1990 දී නාමල් උඩුගමෙන් පසු 2000 ගණන්වල තරුණ සංවේදනය ඔහු බවට පත්විය. ෂිහාන් 1985 මාර්තු 18 වන දින පවුලේ වැඩිමලා ලෙස වෙලිවේරියාවේදී වැලිවේරියාවේ උපත ලැබීය. ඔහුගේ පියා වන ටිරෝන් බෙනෙට් මීට පෙර බහරේනයේ සේවය කළ ශබ්ද ඉංජිනේරුවක් වූ අතර මව නිල්මු මල්ලිකා ගෘහණියක්. ඔහුට සහෝදරියක්, ශානිකා මිහිරාවි ඇත. ඔහු කන්දන ඩි මැසෙනෝඩ් විද්යාලයේ අධ්යාපනය ලැබීය. ෂිහාන් 2012 පෙබරවාරි 25 වන දින ගිෂි ක්ලීමා සිල්වා සමඟ විවාහ විය. ඔහු ගායන යථාර්ථයේ පළමු කන්නයට සිරාසා සුපර්ස්ටාර් ප්රදර්ශනය කළේය. එය ශ්රී ලංකාවේ පළමු රියලිටි ප්රදර්ශනය වන අතර එහිදී පිරිමි අවසන් තරඟකරුවන් 12 දෙනෙකු තෝරා ගන්නා ලදී. ප්රදර්ශනය පුරා වඩාත් ජනප්රිය තාරකාව වුවද මිහිරංග තරඟයේ පස්වන ස්ථානය පැමිණියේය. ඔහු බොහෝ දුරට රූකාකාක්ඩා හෙන්ඩවකා, නිහහන්න්ද මෞත්රා සහ ඩෙකානානානා ලෙස ද ගායනා කළේය.",
        "Lyrics of a song": "අද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nපාළුව වී\nඅද මගේ\nහඬවන්නෑ ජීවිතේ\nපාළුව වී\nඅද මගේ\nහඬවන්නෑ ජීවිතේ\nඔබ දන්නෑ\nඅද මා\nඔබේ නමින්\nතනිවෙන්නෑ\nඅද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nසිත හැඟුමන් වේදනා\nමට නොකියා පාවුනා\nසිත හැඟුමන් වේදනා\nමට නොකියා පාවුනා\nඔබ නැති දා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nඅද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nතරු නෙතු කී\nඒ කතා\nඅද රහසේ සැඟවිලා\nතරු නෙතු කී\nඒ කතා\nඅද රහසේ සැඟවිලා\nඔබ ගිය දා\nමා හඬවා\nමට නොකියා\nමා දමා",
        "Songs": "එය රූනා දසා නෙටා, අහි මගා රවයා, අහි මැග රාවෝවා, ආර්.අයි.පී දෝනා පියනා, එසීහා, හිනානා විලේ, ක්ලේමිනා, මැජ් වෙලා අහෝසි කිරීම",
        "email": ""
    },
    {
        "Name": "සමන් ද සිල්වා ",
        "Birth Date": "",
        "City": "මොරටුව",
        "Biography": "ඔහු ප්රවීණ කලාකරුවෙකු සහ ගායකයෙකි.කොළඹ නාලන්දා විද්යාලයේ නිෂ්පාදනයක් වන සමන් ශ්රී ලංකාවේ පමණක් නොව ලොව පුරා සංදර්ශන රාශියක් පවත්වා ඇත",
        "Lyrics of a song": "නියරේ පිය නගලා\nමැණිකේ ඔබ දුර එනවා\nදැකලා වෙහෙස නිවී\n(සිත පිරුණා හද සෙනෙහස දැනුනා) //\n\nරන් ගොයම් කරල් පීදෙන ඔබේ දෙස නැමේ\nරන් රුවක් වගේ ඈතින් ඔබේ රුව මැවේ\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\n\nසුදු අතින් උයා මා වෙත ඇඹුල ගෙන ඔයා\nසෑම දා මෙසේ එනු මැන මල් සිනා සලා\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\nසිත පිරුණා හද සෙනෙහස දැනුනා ///",
        "Songs": "Aale Benda Mage, Neela Walawen, නියරේ පිය නගලා, Papara Papara, Pem Maligawe",
        "email": "saman.DeSilva@srilankasingers.com"
    },
    {
        "Name": "සම්පත් ශ්‍රි සෙනෙවිරත්න",
        "Birth Date": "",
        "City": "මොරටුව",
        "Biography": "ගයනා හා ර0ගන ශිල්පී සම්පත් ශ්‍රි සෙනෙවිරත්න මුල් වරට ප්‍රස0ග වේදිකාවට පිවිසියේමනුවර ලේක් සමාජ ශාලාවෙනි. බි ශ්‍රෙණියෙ ගුවන් විදුලි ගායෙකු වන් මොහු හින්දි ගී සදහා ද එක සේ ජන්ප්‍රියය. ඔහු පිදුම් ලද සම්මනයන් අතර: 1983 රාජ්‍ය සම්මනයෙන් ද, 1984-1992 යෞවන් සම්මානෙයෙන්ද, 1996 කලභුෂණ සම්මානෙයෙන්ද, 1992 ස්යොනාරා සම්මානයන්ද වේ. ච්ත්‍ර පටපසුබිම් ගයෙකුද වන මොහු 1985 වර්සෙයෙ සුන්දර රාත් නමින් ඒක පුද්ගල ගී ප්‍රසන්ගයක් ද පවත් වන ලදි විවිධ විදෙශයන්හි ස0චාරය කර ඇති මොහු සුමලි විජෙරත්න නෑමත්තීය සමග විවහකය",
        "Lyrics of a song": "නියරේ පිය නගලා\nමැණිකේ ඔබ දුර එනවා\nදැකලා වෙහෙස නිවී\n(සිත පිරුණා හද සෙනෙහස දැනුනා) //\n\nරන් ගොයම් කරල් පීදෙන ඔබේ දෙස නැමේ\nරන් රුවක් වගේ ඈතින් ඔබේ රුව මැවේ\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\n\nසුදු අතින් උයා මා වෙත ඇඹුල ගෙන ඔයා\nසෑම දා මෙසේ එනු මැන මල් සිනා සලා\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\nසිත පිරුණා හද සෙනෙහස දැනුනා ///",
        "Songs": "විදුලියක් වගේ, පහන් වෙන්න, ඇසුරින් මිදුනත්, කොම්පඤ්ඤ වීදියේ",
        "email": "Sampth.SriSeneviratna@srilankasingers.com"
    },
    {
        "Name": "ශානිකා වනිගසේකර",
        "Birth Date": "",
        "City": "තිඹිරිගස්කටුව",
        "Biography": "",
        "Lyrics of a song": "මංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ කව්රුන් කවදා මා කැන්දාගෙන යාදෝ//\n\nමව්පිය සෙවන්නේ මා තනි වේවි මංගල යහනේ ඔබ සැතපෙවි මගෙ හිමි සදු කොහෙදො\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ..\n\nදින සති ගෙවිලා කල් ගත වීලා නෑ තව ආවේ ආදර සිතුවිලි සාගර පතුලේ සැගවී යාවේ පෙම් සිතිවිල්ලෙ සිත කැලඹිල්ලෙ සිහින තොටිල්ලේ මාලතවිල්ලේ මගෙ හිමි සදු කොහිදො\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ..\n\nකල වයසත් ගත වීගෙන යනවා ගෙදරට යාලු මල්සර දුන්නෙන් ආල වඩන්නේ කෙදිනද යාලු හිමි සදු හමු වී පෙම් මල පීදී සලු පිලි දෑතින් කුමරු වඩීවි රෑ සයනේ සිහිනේ\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ...\n\nමව්පිය සෙවනේ මා තනි වේවි\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ...",
        "Songs": "ඕරා, ෆිඩෙයිගේ වචන ඇනා, එමා, හෙතා සිට නවතිනාන්, එන්ජින් කි. බිංගි, රයිඩ් කි",
        "email": "Shanika.Wanigasekera@srilankasingers.com"
    },
    {
        "Name": "ශෙල්ටන් මුතුනමගේ",
        "Birth Date": "",
        "City": "මීගමුව",
        "Biography": "",
        "Lyrics of a song": "මහ සයුරේ ගැඹුරු දියේ ගෙවන පිනේ සත්තාඥා ශෝක නැවුල් නැහැ අපේ සිනේ සම්පත් සොයාලා ඔරුවේ නැගිලා අපි වෙරළ බලා පදිමු යාළුවේ\n\nඑලනා දැල මාළුන් පිරිලා සිතනා ලෙස වාසිය ලැබුනේ. හෙට හිරු නයනා දිනේ දිවි රැක දෙන්නටයි අල්\n\nමේක තමා ශෝක නැති මුහුදු විනේ\n\nමහ යුරේ.......\n\nදියඹේ රැය මේ ලෙස ගෙවලා\n\nසැනසීමෙන් ආපසු එන්නේ\n\nසැනසුම ආහ්ගේ ලෝකයේ අඹු දරුවන්ගෙ ආදරේ\n\nමේක නවා ශෝක නැති මුහුදු විනේ //\n\nමහ යුරේ.......//",
        "Songs": "SMAA SEURE SMOUS GUBUකු ඩිය, මල් සියොන්ගහවොක්කොම්පින් තරණය කිරීම",
        "email": "shelton.muthunamage@srilankasingers.com"
    },
    {
        "Name": "ශර්ලි වයිජයන්ත",
        "Birth Date": "",
        "City": "ඉඹුල්ගොඩ",
        "Biography": "ෂර්ලි වයිජායතා යනු ජනප්රිය ශ්රී ලාංකික සංගීත ian යෙකු හා ගායකයාගෙන් එකකි",
        "Lyrics of a song": "ඈත සිතිජයේ හැඩට රුවින් දිලෙන තරුව ඔබ නම් මේඝ වලා සළු පට අතරින් මම ඔබ වෙත එන්නම්\n\n\nඉරට මුවාවෙන් සඳට මුවාවෙන් අපි ඉමුපිළිසඳරේ රන්දෝලාවෙන් කැඳවා යමි මම කුමරිය ඔබ මාගේ\n\n\nසඳළු තලාවේ මුනින් තලාවේ. කඳුලැල් පිරුනු නෙතින් සමුගන්නම් මම කුමරිය ඔබගෙන් ආයෙත් දකිනු රුසින් ඈත. තුෂාරා බිඳු අතරේ පිපුනු කසුම ඔබ නම් සඳ මඬලේ සඳ කුමරියනේ මම ඔබ සුරකින්නම් මම ඔබ සුරකින්නම්",
        "Songs": "Andara Kale, ඈත සිතිජයේ, Dora Kauluwen, Kawadada Aye Enne, Ma Hada Salena",
        "email": "shirley.waijayantha@srilankasingers.com"
    },
    {
        "Name": "සෝමසිරි මැදගෙදර",
        "Birth Date": "8-Nov",
        "City": "වලපනේ",
        "Biography": "(නොවැම්බර් 8 වන දිනෙන් උපත ලැබූ (නොවැම්බර් 8), ශ්රී ලාංකික ගායිකාවක්. කණ්ඩායම් ගායිකාවක් ලෙස තරුණ ගායනා කණ්ඩායමෙන් මවාගෙදර, තම දක්ෂතා පෙන්වීමට හැකි වූ අතර සඳයි තාරුවි, ආසා ඉමා සහ ඊසාරා බෙඩි පිත් සහ මතුත මුතු ඔවුස් වැනි ජනප්රිය ගීත කිහිපයක් ගායනා කර තිබේ. ග්රාමීය පවුලක බාලම දරුවා ලෙස නුවර එලියා හි වලපේන් හි වලපේන් හි වලපිහී ගම්මානයේ නොවැම්බර් 8 වන දින මත්තගෙදර උපත ලැබීය. ඔහුගේ පියා වන මේදගෙදර විද්යරත්න ගොවියෙකි. ඔහුගේ මව රන්කිරි කෘෂිකර්මාන්තයට පියාට උදව් කළ ගෘහණියක් විය. සෝමසිරි හි වැඩිමහල් සහෝදරයන් පස් දෙනෙකු සිටී. ඔහු තෙරධී සිද්ධාර්ථ විද්යාලයෙන් අධ්යාපනය සම්පූර්ණ කළේය. ගුරුවරයා යටතේ ඔහු පාසලේ සංගීතය ඉගෙන ගත්තේය. එම්. කේසා. ගමේ පීඊඊ කවි සහ වර්ින්දු ගීත කියවීමට ඔහු දක්ෂය. ඔහු විවාහ වූයේ දිගුකාලීන හවුල්කරු නීලා සෙනෙවිරත්න සමඟ ය. බෙල්වුඩ් සෞන්දර්යාත්මක නිකේතනයෙන් ඉවත්වීමෙන් පසු මහාරාගම තරුණ මධ්යස්ථානයේ සහකාර තරුණ සේවා නිලධාරියෙකු ලෙස සේවය කරමින් සිටියදී 1984 දී උගන්වයි 1984 දී උගන්වන්නේ 1984 දී ය. මෙම යුවළට පුතුන් දෙදෙනෙක් සිටිනවා - යසාස් සහ සහන් ධනුෂ්ක; සහ එක් දියණියක් වන යශෝධා රසාන්ජලී. යසාස් ද ගායකයෙක් සහ ශබ්ද ඉංජිනේරුවෙකි.",
        "Lyrics of a song": "මුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා\nපාළුවේ වැහි බීරමේ\nතනිවී බලා හිඳින්නේ\nකාටදෝ\nපවසන්නකෝ\nඔබගේ සෙනෙහෙ පුදන්නේ\nමා ලැබූ සිත් වේදනා\nඇයගේ ලොවේ පෙරදිනේ\nනෑ මැකී මතකෙන් මගේ\nඑය මා සිතේ දරන්නේ\nමුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා\nජීවිතේ හැම කාලයේ\nඔබගේ ලොවේ රැඳෙන්නේ\nරෑ දිවා දුක හා සැපේ\nහිඳිමි පලා නොයන්නේ\nමේ ලෙසේ තනි ජීවිතේ\nසැමදා ගෙවා පතන්නේ\nආදරේ පිළිගන්න බෑ\nයලි මා මුලා නොවන්නේ\nමුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා",
        "Songs": "අදාරා සුභාටා, අං එක්සා සරසාවි, අපා එක්කාල සරසාවි, අපා එක්ල සරස්ාවි, අපා එක්කලා, ආසා ඉමා ඒපී, අතා ඉනා, අතා රූටා, බැක්මස්, බැක්මස්, බැක්මස්, බැක්මස්,",
        "email": "somasiri.medagedara@srilankasingers.com"
    },
    {
        "Name": "සුජාතා අත්තනායක",
        "Birth Date": "12-May-42",
        "City": "කැලණිය",
        "Biography": "කලා සර්යි විශාරදයා මුදුන්කෝටුවා මුංචේ අරච්චිගේ සුජාතා පෙරේරා (උපත 1942 මැයි 12), වාචිකව හැඳින්වේ, එය ශ්රී ලංකාවේ ගීත රංගනයකි. ඇය සිංහල සිනමාවේ සහ ශ්රී ලංකාවේ සහ ඉන්දියානු දෙමළ සිනමාවේ ප්රමුඛ පසුබිම් ගායකයා වන අතර එය ශ්රී ලංකාවේ සහ ඉන්දියානු දෙමළ සිනමාවේ ය. සිංහල සංගීතයේ රන් සීනුව ලෙස සැලකේ, දශක හතකට වැඩි කාලයක් පුරා කැසට් 115 කට වැඩි ප්රමාණයක් සමඟ ශ්රී ලංකාවේ ගීතිකා භටයන් 115 කට වැඩි ප්රමාණයක් සමඟ \"ශ්රී ලාංකික ගීත රසිකයෙකු 115 කට වැඩි ප්රමාණයක් සහිතව ඇය ශ්රී ලංකාවේ ගීතිකා භටයින් 115 කට වැඩි ප්රමාණයක් සමඟ නිෂ්පාදනය කරන ලද කැසට් වර්ග 115 කට වැඩි ප්රමාණයක් සමඟ පටිගත කර ඇති බව ඇය වාර්තා කරයි. ඇය ශ්රී ලංකාවේ පළමු කාන්තා සංගීත අධ්යක්ෂවරයා ය. ඇය සිංහල චිත්රපට 400 කට ආසන්න සංඛ්යාවක් සහ ශ්රී ලාංකික ඉන්දීය දෙමළ චිත්රපට 20 කට \"ශ්රී ලාංකික ඉන්දීය දෙමළ චිත්රපට 20 ක් පසුබිම් ගායකයෙකු ලෙස දැක්වේ. ඇය සිංහල ගීත 6000 කට වඩා සහ විවිධ භාෂා 9 ක ගීත 1000 කට වඩා ගායනා කළාය. ඇය 1942 මැයි 12 වන දින කෙලනියා හි උපත ලැබුවේ සහෝදර සහෝදරියන් පස් දෙනෙකු සිටින පවුලේ තුන්වැන්නා ලෙස ය. ඇගේ පියා මුඩුකොටුව මුනසිංහ අරච්චිගේ ධර්මදාස පෙරේරා පොලිස් සැරයන්වරයෙකි. ඇගේ මව ජෙට්රූඩ් මාග්රට් වොල්බොෆ් අකා කන්ත, කුළුණ සහිත ශාලා නිළියක් සහ ගායකයෙකි. ඇය අධ්යාපනය ආරම්භ කළේ 1947 දී කෙලනියාවේ වෙමුල්ලා මහා විද්යාවේ සිට ය. ඇයට සහෝදරියන් දෙදෙනෙක් සහ සහෝදරයන් දෙදෙනෙක් සිටී. ඇගේ සොහොයුරිය වන රංජනී පෙරේරා සුප්රසිද්ධ නර්තන ගුරුවරයෙකු හා බාල සොහොයුරු සුසිල් පෙරේරා ජනප්රිය හා සංගීත ian යෙකි. ඇය විවාහ වී ඇත්තේ නවරත්න අතනායක සමඟ ය. ඇය රාජ්ය සංගීත විද්යාලයේ නවරත්න හමුවිය. මෙම යුවළට පුතුන් තිදෙනෙක් සිටිති - හේලි සජීවා, චානක, සමයින්. ඇගේ දෙවන පුත් කපිතාන් චානක සංජීවා 1992 සැප්තැම්බර් 25 වන දින දෙවන ඊලාම් යුද්ධයේදී පූනරින්හිදී පූනරින්හිදී මිය ගියේය. ඔහුගේ මරණයෙන් පසු, අත්තනානායක ගායනයෙන් ඉවත්ව සුදු සාරි ඇඳීමට පටන් ගනී. ඔහුගේ පුතාගේ මරණයෙන් පසු ඇය 1992 දී ශ්රී ලංකාවට පිටත්ව ගියහ. දැවැන්ත රසික ඉල්ලුම නිසා ඇය 2012 දී ජීවනා විලා මෙඩා නම් කර ගත් සාර්ථක ප්රසංග මාලාවක් ඉදිරිපත් කළාය.",
        "Lyrics of a song": "ඉතිපි සෝ භගවා අරහං සම්මා සම්බුද්ධෝ...\nසම්මා සම්බුද්ධෝ... සම්මා සම්බුද්ධෝ...\n(මල් සුගන්දේ දම් සුගන්දේ සිල් සුළං රැල් පාවෙලා\nසම්බුදුන් සම්භාවනීයයි සාධු සාධු වන්දනා) //\n\n(මිහින්තලාවයි දහම් අමාවයි ශාන්ත අනුබුදු නාමයයි\nකාට කාටත් මේ කියන්නේ ශාසනේ ඉතිහාසයයි) //\n(රත්නමාලි සෑ රජුන්ගේ දෙව් බඹුන් පූජා ලබයි\nමේ මහා ගල් මුල් කියන්නේ ඒ උතුම් අභිමානයයි) //\nමල් සුගන්දේ දම් සුගන්දේ …………….\n\n(රැල් නගා හෝ ගා ගලන්නේ ජාතියේ ජය පානයයි\nසිංහලේ විස්මන් කියන්නේ මේ පොළොන්නරු දේශයයි) //\n(දා ගැබයි මහ මේඝයයි නිල්වන් ගුවන් ගැබ යා වුණේ\nගල් කුලින් සිත්තම් වුණාදෝ මෙත් සිහිල් කරුණා ගුණේ) //\nමල් සුගන්දේ දම් සුගන්දේ …………….\n\n(මහා රජුන් තුන් සිංහලේ එහෙමයි එදා දස්කම් කළේ\nඒ උතුම් දහමෙන් තමා ලේ මස් පවා විස්කම් කළේ) //\n(ධීරවීරයි පූජනීයයි නෑ නිමක් ගුණ ගායනේ\nසිව් මහා දෙවිදුන් රකීවී මේ අපේ බුදු ශාසනේ) //\nසිව් මහා දෙවිදුන් රකීවී මේ අපේ බුදු ශාසනේ ///",
        "Songs": "අදාරා කෞලලි දස, අදාරා චරිකා, අඩා කන්ෆනා, අඒ.ඒ.ඒ.ඒ",
        "email": "sujatha.attanayake@srilankasingers.com"
    },
    {
        "Name": "සුනිල් එදිරිසිංහ",
        "Birth Date": "19-Dec-49",
        "City": "කොළඹ",
        "Biography": "පිකාකිරිජ් ජයප්රීති (1949 දෙසැම්බර් 19 වන දින උපත) ශ්රී ලංකා සම්භාව්ය සංගීත ian යෙකි. 1983 දී ලුයුකානායා හි මායා මිරින්ගුවා පිරුණුඩු ලෝගේ \"සඳහා 1983 දී\" මායා මිරින්ගුවා ලූපය \"සඳහා වූ නරඹීමේ ගායනය සඳහා ජනාධිපති සම්මානය එඩිරිසිංහ මහතා දිනා ගත්තේය. 1988 දී මාරාව් තාගගා සිට \"වලකුලක් ජෙනා මුවා කරමු\" සඳහා වන \"වලකුලක් ජෙනා මුවුමාරු\" සඳහා වන අතර 1990 දී ඔහුට 1988 දී රූගාඛ සංකාච් සම්මානය පිරිනමන ලදී. ඔහු 1988 දී සඳකදා පහානාහි \"තුලසා පවිත්ර\" සඳහා සරසවිය ගායනය සඳහා සරසවියා සම්මානය දිනාගෙන ඇති අතර 2002 දී පෝරොන්ඩුවෙන් \"පෝරෝන්ඩු\" සඳහා ද දිනා ගෙන ඇත. එඩිරිසිංහ මහතා දරුවන් හත්දෙනෙකුගෙන් බාලයා හත්දෙනාගෙන් උපත ලැබීය. ඔහු හැදී වැඩුණේ රබර් කර්මාන්තයක් අතර වරගොඩ කෙලනියා හි ය. එඩිරිසිංහ 1955 දී ශ්රී ධර්මලෝක විද්යාවේදී පාසැල් අධ්යාපනය ආරම්භ කළේය. ඔහු 1968 දී සපුගස්කන්ද මහා විද්යාලයට ගොස් පසුව ඩෙල්ගෝඩා කල්්යාන ප්රදීපා පිරිවෙනා සිය උසස් පෙළ රෝගය සඳහා ඉගෙන ගන්නා ලදී. ද්විතීයික අධ්යාපනය 1969 දී සිය ද්විතීයික අධ්යාපනය අවසන් කිරීමෙන් පසු එඩිරිසිංහ රජයේ මුද්රණ සංස්ථාවට වැඩ කිරීමට පටන් ගත්තේය. ඔහුගේ සහෝදර සටමාන්ද්රගේ මසුන්ද්රගේ මසුන්ද්ර චිත්රපටය සඳහා \"සඳකදා පහානා\" ගායනා කරන්නෙකු ලෙස ඔහු ආරම්භක ගායකයෙකු ලෙස තේරී පත්විය. මෙම ගීතය රචනා කර ඇත්තේ වික්ටර් රත්නායක විසිනි. එඩිරිසිංහ මහතා විශාරදයේ පී.වී හි සංගීතය හැදෑරූහ. නන්දසිරිගේ සංගීත ඇකඩමිය සහ 1970 දශකයේ මුල් භාගයේදී ඉන්දියාවේ ලක්නාව් විශ්ව විද්යාලය. 1975 දී ඉන්දියාවේ ගෞරවනීය භූතයේ සංගීත ඇකඩමියේ පළමු පන්තියේ ගෞරව උපාධිය ලබා ගත්තේය. ඔහු ශ්රී ලංකා ගුවන්විදුලි සංස්ථාවට සම්බන්ධ වූයේ ළඟදීමයි. 1980 දී එඩිරිසිංහ සිය පළමු කැසට් චන්ද්ර මැන්ඩලය නිකුත් කළේය. ඔහුගේ 70 වන උපන්දිනය සැමරීම සඳහා ඔහු විසින් මෙම උපහාර දැක්වීමේ උත්සවයක් 2019 දෙසැම්බර් 19 වන දින සවස 3 ට ශ්රී ලංකා පදනම් ආයතනයේ දී පැවැත්වේ. මේ අතර, ගායනය සමඟ ඔහු විසින් කර ඇති දේ විද්වත් ගවේෂණයකින් විදහා දැක්වීමෙන් පොතක පොතක් සමුද්ර වෙට්ටසිංහ විසින් ප්රකාශයට පත් කරන ලදී. සුනිලා සිරිතා යන මාතෘකාව යටතේ පුෂ්කරන් විසින් වන්නිරච්චි විසින් රචිත තවත් පොතක් - සුනිල් එඩිරිසිංහ දිවි සාරියා. 2021 දී ඔහු සිය පළමු එල්.පී. ඇල්බමය උළු \"සුනිලා යයාම\" සමඟ නිකුත් කළේය. එහි ජනප්රිය ගීත දහඅටක් සහ කෙටි දෙබස් කිහිපයක් සහිත ප්රසංග ඉදිරිපත් කිරීමක් ඇතුළත් වේ.",
        "Lyrics of a song": "පාරු පාලමෙන් කොලඹට\nගැල් පේලිය සැපත්\nඋනාගෑස් පහට ලංවෙනකොට\nඅපි හොදටම හවස් උනා\nසෙක්කු වීදියේ කම්බා\nදැක උබ මට මතක් උනා\nකයිමන් දොර කොඩ ඉදපං\nමං එනතුරු සෙලෙස්තිනා\nකොලබ රටේ ඉපදුනාට මටම ඔබින සෙලෙස්තිනා\nබේරෙ වැවට හද පෑව්වා වාගේ මට උබේ සිනා\nකවාකුරුත්තාව ඇදං මුතු දෙපොටක් ගෙලේ දමා\nසාන්ත බස්තියන් ඇලේ පාරු පදිමු සෙලෙස්තිනා\nමහ මංකඩ කවි මඩුවක් හෙට හවසට පැවැත් වෙනා\nනං දරාපු කවි කාරයො එහි එන බව කතා උනා\nට්රෑම් කාර් එකේ ගිහින් කවි අහමුද සෙලෙස්තිනා.\nඉංගිරීසි රජින වගෙයි මට නම් උබ සෙලෙස්තිනා",
        "Songs": "සඳ එලිය, සුන්දුමුදු ෂිනාකාක්, හේමිතුදු ෂිනාකා, සමනලා සිරිපා, අහසා, බාලමූප, අහසානා බාලමපා වටාටා, අහසන් පැන්ග්බා වටටා, අඳෙරේට්, එබේරි සන්ඩෝරි, ඉමාහ්",
        "email": "SunilEdirisinghe@srilankasingers.com"
    },
    {
        "Name": "සුනිල් පෙරේරා",
        "Birth Date": "14-Sep-52",
        "City": "නාරාහේන්පිට",
        "Biography": "උස්වාත්ත ලියනගේ අයිවෝර් සිල්වෙස්ටර් සුනිල් පෙරේරා (1952 - 1952 - 20 සැප්තැම්බර් 14 සැප්තැම්බර් 14), ශ්රී ලාංකික හ callist යෙක්, ගිටාර්, ගීත රචකයෙකු සහ නිර්මාපකයෙකු වූවන්. ශ්රී ලංකාවේ සංගීත ඉතිහාසයේ වඩාත්ම බලගතු සංගීත ians යෙකු ලෙස විස්තර කර ඇති, පෙරේරා නායකයා සහ ජිප්සීස් හි ප්රධාන ගායනාකරුවා විය. ඔහු ශ්රී ලංකාවේ පෝෂණය සමඟ සම්බන්ධ වූ අතර \"බායිලා චක්රවේති\" යන අන්වර්ථ නාමය ලබා ගත්තේය. පෙරේරා 1952 සැප්තැම්බර් 14 වන දින සහෝදර සහෝදරියන් දස දෙනෙකු සිටින පවුලක උපත ලැබීය. ඔහුගේ පියා, ඇන්ටන් පෙරේරා සංගීත ian යෙකු වීමට පෙර හමුදාවේ සිට ඇති අතර මුල් ජිප්සීස් පටිය සාදයි. ඇන්ටන් රජයේ තැපැල් දෙපාර්තමේන්තුවේ ලිපිකරුවෙකු වූ අතර \"ග්ලූකෝරාසා\" නමින් මිහිරි නිෂ්පාදන සමාගමක් ද පවත්වාගෙන ගියේය. ඔහුගේ මව ඩොරයින් පෙරේරා ය. ඔහු අධ්යාපනය ආරම්භ කළේ මොරටුවා ශාන්ත සෙබස්තියන් විද්යාලයේ සිව්වන ශ්රේණිය වන අතර කොළඹ ශාන්ත පීතර විද්යාලයේ පාසල අවසන් වන තෙක් ය. ඔහුගේ පාසල් කාලයේ ඔහු විද්යාලයේ සංගීත කණ්ඩායමේ සාමාජිකයෙකි. ඔහුට වයස අවුරුදු 11 දී ඔහු ගිටාරයක් බවට පත්විය. පෙරේරා විවාහ වූයේ 1967 මාර්තු 18 වන දින උපත ලැබූ ගීතා කුලතුංග සමඟ ය. ඇය ප්රසංගයකට සහභාගී වෙමින් සිටියදී ඇය සුනිල් හමුවෙයි. කුලතුංගගේ පියා මහින්ද, ශ්රී ලංකා පොලිසිය සමඟ උප පොලිස් පරීක්ෂකවරයෙකි. 1981 ඔක්තෝබර් 25 වන දින කුලතුංගගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ දෙමව්පියන්ගේ ඇය පැහැරගෙන ගොස් ඇති වාර්තා වලින් පසුව පෙරේරා පොලිසිය විසින් අත්අඩංගුවට ගනු ලැබීය. නඩුව පසුව පහත වැටුණි. කුලතුංග වයස අවුරුදු 16 දී ඇය සහ පෙරේරා විවාහ ගිවිස ගත්තා. ඔහුට පුතුන් දෙදෙනෙක් සිටියහ: සජිත් සහ ගයාන් සහ දියණියන් දෙදෙනෙක්: රෙහානා සහ මනිෂා. වැඩිමහල් පුත් සජිතා විවාහක වන්නේ ප්රසිද්ධ සිංගර් ඩල්රීන් රින්රීන්ගේ දියණිය සමඟයි. ඔහුගේ බාල පුත් ගයාන් යනු සංගීත කණ්ඩායම \"තාත්තා\" පිහිටුවා ගත් සංගීත ian යෙකි. ඔහුගේ බෑණනුවන් වන ලත්ත්රා පෙරේරා \"ඩොක්ටර්\" හි සංගීත ian යෙකු හා ආරම්භක සාමාජිකයෙකි. 2021 අගෝස්තු මාසයේදී පෙරේරා කොවි-19 දෙනා සඳහා ධනාත්මකව පරීක්ෂා කළ අතර ඔහුගේ මරණයේ කටකතා සමාජ මාධ්ය කෙරෙහි සංසරණය වීමට පටන් ගත්තේය. සැප්තැම්බර් 5 වන දින, නියුමෝනියාව හේතුවෙන් ඔහු නැවත රෝහල් ගත කර ඇති අතර ඔහුගේ 69 වන උපන්දිනය සතියකට පෙර 2021 සැප්තැම්බර් 6 වන දින සිට ඔහු රෝහල් ගත කර තිබේ.",
        "Lyrics of a song": "අනං මනං බෙහෙත් වලට ඇයි ගෙවන්නේ සල්ලි (ලොකු සල්ලි)\nඕන ලෙඩක් හොඳ වෙනවා බොන්න කොත්තමල්ලී (කොත්තමල්ලී)\nරුමේනියාවෙළු තියෙන්නේ හොඳම කොත්තමල්ලී\nලංකාවට ගෙන්නන්නේ අපේ අමල් මල්ලී (ලංකාවට ගෙන්නන්නේ අපේ අමල් මල්ලී)\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඔය ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ\nපොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nකොත්තමල්ලී\nතරුණ වෙන්න සමහර අය විටමින් පෙති බොතී (විටමින් බොතී)\nඑක්සසයිස් කරලා කරලා සමහරුන්ට හතී (අනේ හතී)\nඔය අරවා මේවා මොකුත් නොකර කොල්ලා වගේ ඉන්නේ\nමම තාමත් උදේ හවා කොත්තමල්ලී බොන්නේ\n(පනහා පැනලා උනත් එයා ෆිට් එකේම ඉන්නේ)\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඔය ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ පොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\n(මොනවද මල්ලි)\nකොත්තමල්ලී\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඅනේ ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ පොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nඕන නෑ සෝඩා, සැන්ඩි කොත්තමල්ලී\nඅයිස් කැට එපා මල්ලි, උණු උණු වෙම බොන්න මල්ලි\nබිව්වට කොත්තමල්ලී ඩෝප් වෙන්නේ නෑනේ මල්ලි\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nකොත්තමල්ලී\nමතට තිත",
        "Songs": "Adanapa hithanena, Aiara raththarahne, Aiaiai Mali, Aiaiai Mali, Ahaiai Mat Mata, Ahaina hina hina hina hina, hina hina hina hina hina, hina hina hina hina hina, hina hina hina hina hina, hina hina hina hina hina, Hina Hina hina hina hina, hina hina hina hina hina, hina hina hina hain hain,",
        "email": ""
    },
    {
        "Name": "ටි.එම්.ජයරත්න",
        "Birth Date": "13-Apr-44",
        "City": "දොඩන්ගොඩ",
        "Biography": "ශ්රී ලංකාවේ දොඩංගෝඩාවේ දී දඩන්කුන් මුඩියන්සලේජ් ජයරත්න (1944 අප්රියෙල් 13) දොඩංගෝඩාවේ දී ද හැඳින්වේ. 1978, 1979, 1980 සහ 1987 දී ඔහු ශ්රී ලංකාවේ ජනාධිපති සම්මානය හිමි කර ගෙන තිබේ. ජයරත්න මහතා, මහනුවර සහ කුරුණෑගල මාලියාදේව විද්යාලයේ ශාන්තන්තෝනියේ විද්යාලයේ අධ්යාපනය ලැබීය. ඔහු ගංගා බලකායේ ජන හා පර්යේෂණ ඒකකයේ ප්රධානියාගේ ප්රධානියා ලෙස ඔහු ගායනා කිරීමට ඇදී ගියේය. සිංහල ගැමි ගීත කිහිපයක් ගායනා කරන ලෙස ඔහුගෙන් ඉල්ලා සිටි කුලතිලකව \"ගණයි thol sadeun\" ඇතුළු වූයේ ගුවන් විදුලියෙන් විකාශය වීමයි. ඔහුගේ පළමු ගීතය 1970 දී පටිගත කළේය. සුනිල් ආරියරත්න විසින් රචිත සහ ප්රේමසිරි කෙමදාස විසින් රචනා කරන ලද සහ රචනා කරන ලද \"ලහිරු දහසේක්\" සමඟ ඔහු සිය පළමු ගීතය වාර්තා කළේය. 1978 දී ඔහු සිය පළමු කැසට් තරංග පරිමාව - 01. මේ වන විට ඔහු තම රන් හ voice චිත්රපට 79 කට ලබා දී ඇත. මෙම චිත්රපට අතර ධර්මසිරි බණ්ඩාරනායක ධර්මසේන පතිරාජාගේ සහ හන්සා විලක් ශ්රී ලංකා ඉතිහාසයේ හොඳම චිත්රපට ලෙස සැලකේ. 1980 දී ජයරත්න හංසා විලක් චිත්රපටය සඳහා \"හින්ඩ් සෝර් පයා විදා\" හි සුනිලා අබේසේකර සමඟ සුනිලා අබේසේකර සමඟ යුගලයක් විය. මෙම ගීතය ධර්මසේන පතිරාජා සංගීතය සමඟ සංගීතය සමඟ ලියා ඇති අතර ප්රේමසිරි කෙමදාස විසින් ශ්රී ලංකාවේ ජනප්රිය ගීතයක් බවට පත්විය. නීලා වික්රමසිංහ සමඟ ඔහුගේ යුගල ද විශාල ජනප්රිය පහරක් විය. එසේම ඔහු සමහර ගීත සඳහා සංගීතය රචනා කර ඇති නමුත් ඔහු දක්ෂ ගායනාකරුවෙකු ලෙස කීර්තියක් අත්කර ගත්තේය.",
        "Lyrics of a song": "වළා තීරයෙන් එහා කොහේද ලෝකයක්\nසොයා ඇදෙන් පැතුම් බිඟුන් අපේම ලෝකයක් - අපේම ලෝකයක්\n\nතරංගයක් ලෙසින් ඇදී බිඳී නොයන් සිතින්\nවසන්තයක් ලෙසින් උදාව එන්න ජීවිතෙන්\nවළා තීරයෙන් එහා ...........\n\nසිහිල් සහන් සුසුම් සරින් පවන් රොදක් ලෙසින්\nනැවුම් පැතුම් අරන් වඩින්න පෙම් උයන් දොරින්\nවළා තීරයෙන් එහා ...........",
        "Songs": "ඇඩාත් අම්බා තාප්පය ඉරිදා, ඒ.අයි.වී වේවා ටිමියා, අචසේසා හින්කා, අකාසාස්සේ හින්කා, ඇඩසේකා ෂබායා, අන්සර යයාකා,.",
        "email": "tm.jayarathne@srilankasingers.com"
    },
    {
        "Name": "උමාරියා සිංහවංශ",
        "Birth Date": "5-Jan-94",
        "City": "කොළඹ",
        "Biography": "උමරියා බ්තිත් අයේෂා සිංවාන්සා (උපත 1994 ජනවාරි 5 වන දින), ජනප්රියයි, ජනප්රියයි. ඇය ශ්රී ලංකා ගුවන්විදුලි සංස්ථාව විසින් සැමවිටම A ශ්රේණියට ලබා දුන් ලාබාලම සංගීත ian යා ය. ශ්රී ලංකාවේ කොළඹ, උමාරියා, උමාරියාව 2005 දී වයස අවුරුදු 11 දී ඇගේ සංගීත ජීවිතය ආරම්භ කළේය. ඇය ඇයගේ මංගල්යය වූයේ අසාහි මෑන් ෆාබිනා චිත්රපටයේ පසුබිම් ගායකයෙකු ලෙස ය. පෑන් ඒෂියා මියුසික් ජාත්යන්තර සංගීත තරගය සහ ක්රිමියාවේ සංගීත උළෙලට ජාත්යන්තර තරඟයේදී රිදී සම්මාන දිනා ඇත. 2020 දී ඇගේ තනි \"මෙන්ඩා පමා\" ශ්රී ලංකාවේ සුපිරි පහරක් වූ අතර ඉතා කෙටි කාලයක් තුළ දසුන් මිලියන 10 ක් විය. දිස්සියක් මිලියන 22 ක් සමඟ යූ ටියුබ් හි වඩාත්ම නරඹන ලද කාන්තා කලාකරුවන් අතර ඇය ලැයිස්තුගත කරන ලදී. ඇය ඉන්ස්ටග්රෑම් හි ශ්රී ලංකා ගායිකාවක් වන ඇයගේ වැඩිපුරම අනුගමනය කරයි. සමස්ත ලංකා සංස්කෘතික පරිසර ආරක්ෂණ සංවිධානය විසින් ඇයට 'කලා කීර්ති අභිමානි' ගෞරව නාමය ලැබුණි. මේ අතර, ඇය සංගීතයට ඇය දක්වන දායකත්වය වෙනුවෙන් \"අයියා ප්රන්නමා සම්මානය\" ලබා ඇති අතර 2021 වසරේ ගීතිකාව සඳහා SLIM-NILESENS හි 2021 ක් පිරිනමන ලදී.",
        "Lyrics of a song": "දෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nනෑ සත්තමයි\nඔබමයි මගේ ආදරේ\nසයුරෙන් මෙහා\nසිටියත් සදා පාළුවේ\nබොඳ වෙන්නෙපා දැන්\nඔබ ඇන්ද සිතුවම්\nහදේ\nපන්හිඳට හුරුවී\nකවි ලිව්වා මා මුළු රැයේ\nඉකිබින්ද සුසුමන්\nඔබ හින්දා වැලපෙයි\nමගේ ළයේ\nඑනකං බලා ඉන්නෙමි\nමේ දෙනුවන් අයා\nදෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nසඳ රේණු අතුරා\nගිනි දැල්වු අපෙ යහන මේ\nතුරුලේ හොවා මා\nඅඳුරේ කියූ ආදරේ\nමිණි මුතු එපා දැන්\nඔය දෑස මගේ ජීවිතේ\nප්රියේ\nඑනකං බලා ඉන්නෙමි\nමේ දෙනුවන් අයා\nදෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nනෑ සත්තමයි\nඔබමයි මගේ ආදරේ\nසයුරෙන් මෙහා\nසිටියත් සදා පාළුවේ",
        "Songs": "ඩෙනිමැක් වැටුප, ඩෙනිමැක් වැටුප, ආ, රේන්, හන්තනා සයිහයින්, ඇගේ මල්, කුමුඩින් නැත, කුමුඩින් ඕකි",
        "email": ""
    },
    {
        "Name": "ඩබ්. ඩී. අමරදේව",
        "Birth Date": "5-Dec-27",
        "City": "මොරටුව",
        "Biography": "ඩබ්. ඩී. අමරදේව උත්තර භාරතීය රාගධාරී සංගීතයෙන් සිංහල ගීත ක්‍ෂේත්‍රය පෝෂණය කල ‍‍ගෞරවණීය කලාකරුවෙකි. 1927 වර්ෂයේ දෙසැම්බර් පස් වන දින මොරටුවේදී මෙළොව එළිය දුටු, වනක්කුවත්ත මිටි වඩුගේ දොන් ඇල්බට් පෙරේරා, ප්‍රකට ගායන හා සංගීතඥයෙකු ලෙස ශ්‍රි ලංකාවේදී හඳුනා ගනු ලබන්නේ ඔහුගේ ආරෝපිත නාමය වූ අමරදේව නමිනි. සිතාරය, තබ්ලාව, හාර්මෝනියම වැනි ශාස්ත්‍රීය සංගීත භාණ්ඩ එක්කොට ගනිමින්, සිංහල ජන සංගීතය සහ භාරත ජනමූල සංගීතය ස්වකීය නිර්මාණ විෂයට දායක කර ගනී. දරුවන් හය දෙනෙකුගෙන් යුත් පවුලක බාලයා වු අමරදේව, දොන් ගිනෝරිස් පෙරේරා සහ මැගී වෙස්ලිනා මෙන්ඩිස්ට දාව උපත ලැබුවකු විය. කුඩාකල දී අමරදේව සංගීතමය ආභාෂය ලැබුවේ තම පියාගෙනි. එමෙන්ම ඔහුගේ වැඩිමහලූ සහෝදරයෙකු ඉන්දීය ශාස්ත්‍රිය සංගීත ගුරුවරයෙකුද වුයේය. අමරදේව අධ්‍යාපනය ලැබුවේ ශ්‍රි සද්ධර්මෝදය මිශ්‍ර පාසලෙනි. ඔහු ද්විතියික අධ්‍යාපනය ලැබුවේ පානදුර ශ්‍රී සුමංගල විද්‍යාලයෙනි. ඉන්පසු ඔහු කළුතර විද්‍යාලයටද බලපිටිය සිද්ධාර්ථ විද්‍යාලයටද ඇතුළත් වුයේය. ‘අශෝකමාලා’ චිත්‍රපටය රූපගත කරන අවධියේ එම චිත්‍රපටයේ සංගීත අධ්‍යක්‍ෂවරයාවු මෙහොමඞ් ගවුස් මාස්ටර් තම සංගීත කණ්ඩායමේ ප්‍රධාන වයලීන වාදකයා ලෙස අමරදේව සම්බන්ධ කර ගත්තේය. ‘අමරදේව’ යන නාමය ඔහු ලැබුවේ මහාචාර්ය එදිරිවීර සරච්චන්ද්‍රයන් අතිනි. ලක්නව් හි පිහිටි බාත්ඛන්ඬේ සංගීත විද්‍යා පීඨයෙන් අධ්‍යාපනය හැදැරූ අමරදේව පසුව ලංකාවට පැමිණ ශ්‍රි ලංකා ගුවන් විදුලි සංස්ථාව හා සම්බන්ධව කටයුතු කළේය. ලාංකීය ජන සංගීතයේ සංස්ථාපනය විමසා බැලීම සදහා 1950 මැදභාගයේදී සිය ජන ගායනා ව්‍යාපෘතිය වෙනුවෙන් \"පණීභාරත, කිරිගනිතා, ගුණමලා, උක්කුවා සහ සුරඹා\" වැනි උඩරට ශාස්ත්‍රීය නර්තන විශාරදයන්ගේ අනුදැනුම ලැබීය.එම සංගීත රටා එක් තනි තාලයක් වටා පමණක් ගෙතී ඇති බව හදුනා ගන්නා ඔහු, ඒවාට මධ්‍ය තාලයක් සදහා අනුගත වන පද මාලා එක් කිරීමට තීරණය කරයි.එහිදී එකල පැවැති ඇතැම් සීමා කිරීම් පසෙකලීමටද ඔහු පෙළඹෙයි.මේ අන්දමෙන් බාහිර තත්වයන්ගේද බලපෑම ලත්, සිංහල සංගීතයට අනන්‍ය වූ නියම ජන සංගීත සංස්කෘතියක් බිහිකරලීමට අමරදේව සමත්වෙයි. පසුව වික්ටර් රත්නායක,සුනිල් එදිරිසිංහ, සනත් නන්දසිරි වැනි කලාකරුවන් භාවිතයට යෙදුනු සරල ගී විශේෂය නිර්මාණය කිරීම සඳහාද ඔහු ක්‍රියාකාරීව දායක වෙයි. පිලිපීන රමෝන් මග්සයිසායි සම්මානය (2001), ඉන්දියානු පද්ම ශ්‍රි සම්මානය සහ ශ්‍රි ලංකාවේ කලාකීර්ති ජනාධිපති සම්මානය (1986), මෙන්ම දේශමාන්‍ය සම්මානය(1998) ආදී සම්මාන රැසක් දිනා ගැනීමටද අමරදේව සමත් වෙයි.එමෙන්ම 1967, යුනෙස්කෝ මැනිලා සිම්පෝසියම සහ, \"ගවුමි සලාම්\" නම් වූ මාලදිවයින් ජාතික ගීය සදහා 1972 දී බ්‍රිතාන්‍ය එළිසබෙත් රැජිනගේ ආරාධනයෙන් යුතුව තනුව නිර්මාණයට දායක වීම ආදියෙන්, ඔහු ජාත්‍යාන්තරය තුළ ලාංකේය අනන්‍යතාව සැළකොට සිටියේය. වඩු කාර්මිකයෙකු වූ වනක්කුවත්ත වඩුගේ දොන් ජිනෝරිස් පෙරේරා සහ බාලාපුවඩුගේ මැගී වෙස්ලිනා මෙන්ඩිස් යන මවුපිය යුවලට දාව, මොරටුව ප්‍රදේශයේදී අමරදේව උපත ලබන්නේ සත් දෙනෙකුගෙන් යුත් පවුලේ බාලම දරුවා ලෙසටයි. තම පියා බෞද්ධයෙකු වීමත් මව කතෝලික තැනැත්තියක් වීමත් නිසා බෞද්ධ හා කතෝලික හර පද්ධතීන් මිශ්‍රවුණු පවුලක ජීවත් වීමේ හැකියාව නිතැතින්ම අමරදේවට ලැබෙයි. අමරදෙව සංගීතය කෙරෙහි යොමු කරන්නේ මොරටුමුල්ල වඩු කාර්මික විද්‍යාලයේ වයලීන නිපදවන්නෙකු හා අලුත්වැඩියා කරන්නෙකු වූ ඔහුගේ පියා විසිනි. අමරදේව, කුඩා කළ තම මවගේ ස්තෝත්‍ර ගායන වලට හිතුමනාපයේ වයලීනයේ තත් හඬවන්නට පුරුදුව සිටියේය.ඔහුගේ වැඩිමහල් සොහොයුරා විසින් ඔහුට ඉන්දියානු ශාස්ත්‍රීය සංගීතය උගන්වනු ලැබීම අමරදෙවගේ සංගීත ජීවිතය ඔපවත් වීම සදහා පවුලෙන් ලද තවත් පිටුවහලක් විය. ඔහුට වයස අවුරුදු හත වන විට ජපන් ටින් වයලීනයක් පියාගෙන් ලද ත්‍යාගයක් වශයෙන් ඔහුට හිමිවේ. කොරළවැල්ලේ විහාරස්ථානයේ මාලාලංකාර නායක තෙරණුවන් යටතේ ස්වකීය මූලික අධ්‍යාපනය ලබන අමරදේවයන්ගේ සංගීත ප්‍රතිභාවේ අපූර්වත්වය දුටුවන්, විහාරස්ථානයේ කවි හා ගාථා ගායනා කිරීම සඳහා අමරදේවයන් හට ආරාධනා කරයි. අනතුරුව තම ග්‍රාමයේ ගීතිකා කණ්ඩායමේ නායකත්වය දැරීමටද අමරදේවයන්ට හැකියාව ලැබෙයි. ශ්‍රි සද්ධර්මෝදය බෞද්ධ මිශ්‍ර පාසලට ඇතුළත් වී අධ්‍යාපනය ලබන අමරදේව, මොරටු විද්‍යාලයෙන් පවත්වන ලැබූ කවි ගායනා තරගයකින් ජයග්‍රහණය ලබන්නේ මේ අතරදීය. එසේම කොළඹ කලා සංගමය විසින් මෙහෙය වූ ගායනා තරගයකින් ජයග්‍රහණය ලැබීමට අමරදේවයන් නායකත්වය දැරූ පාසල් ගායක කණ්ඩායමට හැකියාව උදාවේ. මෙම ජයග්‍රහණ වලින් උද්දාමය ලද අමරදේවයන්ගේ පාසල් ගුරුවරු, ඔහුව ලංකා ගුවන් විදුලි සේවයෙහි ගායක මඩුල්ලට ඇතුලත් කිරීමට ක්‍රියා කරයි. මේ අන්දමින් දක්ෂතා ප්‍රදර්ශනය කරන අමරදේව, 1945 වර්ෂයේදී ජන කලා මණ්ඩලය විසින් පවත්වන ලද ගායනා හා වයලීන වාදක තරගයකින් රන් පදක්කම දිනා ගැනීමට බුහුටි වෙයි. තම ප්‍රාථමික අධ්‍යාපනය නිමා කිරීමෙන් අනතුරුව ඉංග්‍රීසි භාෂාව සදහා ලද ශිෂ්‍යත්වයකින් පානදුර ශ්‍රී සුමංගල විද්‍යාලයට ඇතුළත් වීමේ හැකියාව අමරදේවයන්ට ලැබේ. එහිදී විදුහල්පති ඩැනිස්ටර් තෝමස් ප්‍රනාන්දු (ඩී.ටී. ප්‍රනාන්දු ) මහතා සමග දැන හැඳුනුම් කමක් ඇති කරගන්නා ඔහු, ඩී.ටී. ප්‍රනාන්දු මහතාගේ උපකාරීත්වයෙන් කළුතර විද්‍යාලයටත් ඉන් අනතුරුව, බලපිටිය සිද්ධාර්ථ විද්‍යාලයටත් ඇතුළත්ව අධ්‍යාපනය ලැබීමේ අවස්ථාව උදා කර ගනියි. මෙකලදී \"අශෝකමාලා\" චිත්‍රපටයේ රූගත කිරීම් ඇරඹෙන අතර, මොරටුවෙහි ජෙරාඩ්.ජේ.පීරිස් නැමැත්තෙකු විසින් අමරදේවයන්ව එම චිත්‍රපටයේ සංගීතය මෙහෙය වූ, මොහොමඩ් ගවුස් මාස්ටර් වෙත හඳුන්වා දෙනු ලබයි. අමරදේවයන්ගේ ශක්‍යතාවන් හඳුනාගන්නා ගවුස් මාස්ටර් විසින් තම වාදක මණ්ඩලයේ ප්‍රමුඛතම වයලීන වාදක ශිල්පියා බවට අමරදේව පත්කරනු ලබයි. ඩී.ටී. ප්‍රනාන්දු පවසන අන්දමට, ඔහුගේ සහොදරයා වූ කොරළවැල්ල පාසලේ සංගීත ගුරුවරයා වශයෙන් සේවය කළ ඩ්බ්.ජේ.ප්‍රනාන්දු විසින් අමරදේවයන්ගේ දක්ෂතාවන් හඳුනා ගනු ලබයි. අමරදේව පාසලේදී වයලීන වාදන සම්භන්ධයෙන් දක්වන බුහුටි බව ඔහුගේ නිරීක්ෂණයට ලක්වේ. පසුව අමරදේවගේ පියා ඔහුට වයලීනයක් තනා දෙන අතර, ඔහු පියා යටතේ වයලීන වාදනය හදාරනු ලබයි. ඔහු පසුව අශෝකමාලා චිත්‍රපටය සදහා මොහොමඩ් ගවුස් වෙත හදුන්වාදීම සිදුවන්නේ, ඩී.ටී.ප්‍රනාන්දු මහතාගේ උපකාර ඇතුව ඉගෙනීමේ කටයුතු සඳහා අමරදේව කළුතර බලා යාමෙන් වසර කිහිපයකට පසුවය. අශෝකමාලා චිත්‍රපටයේ පද රචකයා වශයෙන් කටයුතු කරන්නේ ඩී.ටී. ප්‍රනාන්දු මහතා වන අතර, ඔහු චිත්‍රපටයේ අධ්‍යක්ෂකවරයා වූ ශාන්තිකුමාර් සෙනෙවිරත්න මහතා සමග ඇති කරගෙන තිබූ දැඩි මිත්‍රත්වය මේ සදහා පිටුවහලක් වෙයි. තම උසස් අධ්‍යාපන කටයුතු සදහා 1950 වර්ෂයේ මැද භාගයේදී ඉන්දියාවේ ලක්නවු නුවර බාත්ඛන්ඩේ සංගීත අධ්‍යයනායතනයට ඇතුළත් වෙයි. අමරදේව ලංකාවට පැමිණි පසු දිනක් කළුතර සිට කොළඹ බලා ධාවනය වන බසයකට මොරටුවේදී ගොඩ වැදෙන අමරදේවයන්ට, බසයේ සිටින ඩී.ටී.ප්‍රනාන්දු මහතා මුණගැසෙන අතර එහිදී තමා සඳහා පද්‍ය රචනා කර දෙන ලෙසට අමරදේවයන් ඉල්ලා සිටියි. මෙහිදී බසය ධාවනය වන අතර ඩී.ටී.ප්‍රනාන්දු මහතා විසින් \"පීනමුකෝ කළුගගේ\" ගීතය රචනා කරන අතර, ඔහුට ගීතයේ අවසාන කොටස ගායනා කිරීමට නොහැකි වන්නේ බම්බලපිටිය ප්‍රදේශයේදී බසයෙන් බැසයාමට අමරදේවයන්ට සිදුවීම නිසයි. තම ඉගෙනීමේ කටයුතු අහවර කරන අමරදේව, මොහොමඩ් ගවුස් සමග එක්ව, චිත්‍රපටයක වැඩ සඳහා ඉන්දියාව බලා යයි. \"ඇයි යමෙකු කලේ ආලේ\" ගීතය සදහා ගායනයෙන්, නර්තනයෙන් හා රංගනයෙන් යන ත්‍රිවිධ අංශයෙන්ම දායක වීමට අමරදේව මෙහිදී සමත් වෙයි. ඉන්දියාවේ ලක්නවු නුවර බාත්ඛන්ඩේ අධ්‍යාබනායතනයෙහි ලැබූ පරිචයත් සමග, ලංකා ගුවන් විදුලියෙහි නිත්‍ය ගායකයෙකු ලෙස සේවයට එක් වීම තුළින්, ස්වකීය ප්‍රතිභාව හා දැක්ම මින් පෙර නොවූ තරම් වූ වඩා පුළුල් ශ්‍රාවක ගහණයක් වෙත සම්ප්‍රේශණය කිරීමේ හැකියාව ඔහුට උදා වේ. බාත්ඛන්ඩේ අධ්‍යයනායතනයෙහිදී ලබන සතතාභ්යාසයන්ගේ දැනුම ලබන දොන් ඇල්බර්ට් පෙරේරා ලංකාවට පැමිණෙන්නේ පණ්ඩිත් වනක්කු වඩුගේ දොන් අමරදේව ලෙසිනි. අමරණීය ආත්මයක් ලද දේවයාණන් යන අර්ථය ලද මේ නාමය ඔහුට ලබාදෙන්නේ මහාචාර්යය එදිරිවීර සරච්චන්ද්‍රයන් විසිනුයි. මේ සමය වන විට ශ්‍රි ලංකාව ස්වාධීන ජාතියක් ලෙස නිදහස ලැබූ මුල්ම අවදිය වූ අතර, ශ්‍රි ලාංකේය අනන්‍යයතාවක් සහිත සංගීත විදිය නම් කවරක්ද යන ගැටළුව, සමාජීය ප්‍රාඥයන්, කලාකරුවන් සහ පොදු මහජනතාව අතර විමසීමට බඳුන් දුන් තත්වයක් විය. මෙම තත්වයන්ට අනුකූලව, ස්වදෙශික ජන සංගීතය සමග, ඔහු ඉන්දියාවෙදී හැදෑරූ සංගීතයත් ඇසුරුකොට ගෙන වඩා සුඛනම්ය වූ සංගීත වහරක් මතුකොට ගැනීමට අමරදේව සමත් වෙයි. දකුණු ඉන්දියානු සහ ද්‍රවිඩ සංගීත ආකෘති පිළිබද අමරදේවයන් කළ පර්යේෂණාත්මක හැදෑරීම් ඔහුගේ සංගීත භාවිතාවේ නව මානයන් අතර වේ. ශ්‍රි ලංකාවේ අසහාය පද්‍ය රචකයෙකු වූ මහගම සේකරයන් හා එක්ව, අමරදෙවයන් විසින් කරන ලද ස්වර රචනා ශාස්ත්‍රීය සිංහල පද්‍යයේ ස්වර විභේදනයන් පිළිබඳ වූ ඔහුගේ අනන්‍ය ප්‍රතිභාව ගවේෂණය කරන්නක් වී තිබේ. මේ වන විට අමරදේවයන්ගේ සංගීත භාවිතාව සමස්ත ජාතියක භාවමය ආත්මය ප්‍රවර්ථනය කරන්නක් බවට පත්ව තිබේ. කාව්‍යමය නාට්‍ය (කරදිය, නළදමයන්ති ආදිය), චිත්‍රපටි (රන් මුතු දූව, ගම්පෙරෙළිය, රන් සළු, දෙළොවක් අතරේ, ගැටවරයෝ, රෑන ගිරවු, තුන්මං හංදිය ආදිය), නුර්ති (වෙස්සන්තර ) ආදී කෘතීන්ට මෙන්ම ගුවන් විදුලි හා රූපවාහිනී වැඩසටහන් වෙනුවෙන් ගීත දහස් ගණනක් ගායනා කිරීමට අමරදේවයන් හැකියාව ලැබීය. අමරදේව සහ ඔහුගේ බිරිය වන විමලාට දාව රන්ජන අමරදේව නමින් පුතෙකු සහ සුභානි අමරදේව - දක්ෂ ගායන ශිල්පිණියෙකි, ප්‍රියන්වදා අමරදේව නමින් දියණිවරුන් දෙදෙනෙකු සිටිති.",
        "Lyrics of a song": "සන්නාලියනේ සන්නාලියනේ මේ හිමිදිරි උදයේ \nසන්තෝසෙන් ඔබ හිනැහී හිනැහී කාටද ඇඳුම වියන්නේ \nමේ පොඩි ඇඳුම වියන්නේ \nමාලගිරා තටු සේම රුවින් යුතු නිල්වන් ඇඳුම වියන්නේ \nකාටද ඇඳුම වියන්නේ \nමාලගිරා තටු සේම රුවින් යුතු නිල්වන් ඇඳුම වියන්නේ \nඊයේ ඉපදුනු කුලුඳුල් දූටයි මේ පොඩි ඇඳුම වියන්නේ \n\nසන්නාලියනේ සන්නාලියනේ මේ හැන්දෑ යාමේ \nහැඩ වැඩ දමලා ලස්සන කරලා කාටද ඇඳුම වියන්නේ \nදිලිසෙන ඇඳුම වියන්නේ \nසැන්දෑ අහසේ රන්වන් පාටින් දිලිසෙන ඇඳුම වියන්නේ \nකාටද ඇඳුම වියන්නේ \nසැන්දෑ අහසේ රන්වන් පාටින් දිලිසෙන ඇඳුම වියන්නේ \nඒ කුලුඳුල් දූ දීගෙක දෙන්නයි මංගල ඇඳුම වියන්නේ \n\nසන්නාලියනේ සන්නාලියනේ සීතල හඳ එළියේ \nමැළැවුණු මුහුණින් වෙව්ලන දෑතින් කාටද සළුව වියන්නේ\nහීතල සළුව වියන්නේ \nකණකොක් තටුවේ සුදුමැලි පාටින් සීතල සළුව වියන්නේ \nකාටද සළුව වියන්නේ \nකණකොක් තටුවේ සුදුමැලි පාටින් සීතල සළුව වියන්නේ \nමියගිය ඇයගේ මිනිය වහන්නයි සීතල සළුව වියන්නේ",
        "Songs": "ඒඩාර් හැන්ග්රම්, ආදා ඩිඩාඩු, අහිඩා, කඩුආ, අහිවඩා හේරන්, විකාර හොරන්, අහා කංගා ගංගා, අපා ගංගා ගංගා ගාලා, අටෙතනයීන් ගංගා ගාලා Basi, Ahtu Aga Dili Wanamal ,s ම",
        "email": ""
    }
]