[
  {
    "Name": "ඩී. අජන්ත සී. පීරිස්",
    "Birth Date": "10th January",
    "City": "මාකොල",
    "Biography": "Ajantha peiris is a prominent vocalist and multy-instrumentalist in Sri Lanka. He is the son of late Don Vincent Peiris known as \"Vincent Master\" who was a prominent Sri Lankan vocalist, violinist and music composer in early days. He was born in Kandy. He Studied Music from his father at the beginning and he was a student of Visarada Ginadasa master and Visarada Vineetha Pallavala in his childhood. He studied Prathamaa in Hindustan Music from Visarada Nirmala Ranathunga and Madhyama and Visharada from Sangeeth Nipun Prasantha Kuragama. Currently He is reading his visarada at Nawaara sangit vidyaalaya sri lanka (affiliated to bhathkhande sangit vidyapeet, lucknow India .He obtained his first degree B.Sc from University of Ruhuna and M.Sc from University of Colombo. He is a member of British Computer Society and also a Member of Computer Society in Srilanka. He has worked as a Software engineer for ANCL and Commercial Bank of Srilanka, Senior Manager, AGM ( ICT) in Srilanka Insurance. Currently he is working asthe General manger In Lanka Bell and Bell Solution, as a Director in Melstar Technology and Executive director in Bell Vantage.",
    "Lyrics of a song": "මගේ සෙනෙහසින් මෙලොවට බිහිවි කිරිකැටියෙක් මගේ දොතට ආදා අප තනිකර දා වෙනතක ගිය මගේ පියාණන් සිතින් හැදින්නා //\n\nඔබ නොදුටුව දා මගේ සිත සිතුවේ එ සෙනෙහස මට අහිමි කියා හදින් හැදිනෙදා මා එ සෙනෙහස ඔබ විදි දුක දැනි මගේ නෙත හැඩුවා //\n\nහිස පිරිමැද මගේ පුතේ කියන්නට මා ලග නැති විට ඔබත් හඩන්ඇති කිසි දා නොසිදෙන පිය සෙනෙහස ගැන කදු ලැලි හංගා සිතින් තැවෙන්ඇති //",
    "Songs": "Baluwemi mathakayen obe ruwa, Numba Matama ridau tharam, Heena kade, Ganga numbata ma pem kala, Tharu diluna, Mage Senehasin, Pipunoth Numba Pipiyan Mathu Sasare, Kuppi Lampuwa eliyen Gapele, Mona detawath maava den One Nehe",
    "email": "Ajantha.Peiris@srilankasingers.com"
  },
  {
    "Name": "අමල් පෙරේරා",
    "Birth Date": "",
    "City": "මහරගම",
    "Biography": "",
    "Lyrics of a song": "මායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී\nකවදාවත් රිදවන්නෑ හිමිවේනම් උන්මාදිනී\n\nපාඩම් පොතේ සුවඳ අකුරින් ලියා දුන්\nඋන්මාද ගීතේද ගැයුවේ ඔයා\nඒ පොත් කොනේ ලියුව හසුනත් ඔයාටයි\nමේ පෙම් හැඟුම් නැද්ද දැක්කේ ඔයා\n\nහැමදාම නෙතු කීව ඒ පෙම් කතාවේ\nහිතවත් කමක් නේද දැනුනේ කියා\nකවදා ද ඉටුවන්නෙ මේ ප්රාර්ථනාවන්\nදුක් ගින්දරේ හීන ඇවිලී ගියා\n\nමායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී\n\nමල්හීන හිත බැන්ද කිරිකෝඩු කාලේ\nඑක හිනයක් ගාව මම නැවතිලා\nතරු වාගෙ දිලිහෙද්දි පොඩි ඇස් ඔයාගෙ\nබෑ දැන් කියාගන්න හිත ගොළුවෙලා\n\nදැනගත්තදා ඈත වෙන්වී ගියාදෙන්\nහැමදාම විඳවන්න මා මෙහි තියා\nනොකියාම ඉන්නම් මගේ ප්රාර්ථනාවන්\nමිතුදම් හොඳයි අහිමි වෙනවාට වඩා\n\nමායම් තරු රෑනේ බැල්මෙන් මිදී\nපායන් ආ සඳටයි බැඳුනේ වෙලී\nරෑනෙන් මිදුනා මා නැ අත් බැඳී\nමා නම් අද ඉන්නේ ප්රේමේ ගිලී\nසීතාවියක් හින්දා රෑ නෑ නිදී\nඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැඳී",
    "Songs": "Adahannath Ba, Hadu Sulange, Heenayak Wage Oba Awa, Hiru Devi Devi, Hiru Sangawa, Lassanai Aadare, Mal Pita Mal, Mayam Tharu Rane, Nende Tharaha Wenna",
    "email": "amal.perera@srilankasingers.com"
  },
  {
    "Name": "අමරසිරි පීරිස්",
    "Birth Date": "21-Jul-46",
    "City": "බොරලැස්ගමුව",
    "Biography": "He was born on 21 July 1946 in Boralesgamuwa as the eldest of the family. His father Albert Peiris was a classical artiste at Radio Ceylon popular in 1940s. Albert was the first disciple of the Master musician H.W. Rupasinghe. His mother M.K. Asilin was born in Meddewatta, Matara was a housewife. He has three younger sisters – Irene, Shriyalatha and Somalatha. As a child, he dreamed of becoming a train driver due to the influence of his uncle Piyasoma Nanayakkara. He completed primary education from Boralesgamuwa Ananda Vidyalaya and later attended to Buwanekaba Vidyalaya, Maharagama and studied music in Advanced Level class. Later in 1962, he attended to Heywood Institute of Art. He is married to Nanda Koralage, a student who came to the Heywood to play Ezraj. The couple has one son, Madhawa and four daughters – Janaki, Anuradha, Nadeera and Subashini. Madhava is a singer as well as a talented guitarist. He lives in Italy. Daughter Janaki is an Aesthetic Instructor at Devi Balika Vidyalaya. Anuradha is a dancer. She lives in Australia. Nadeera is the Milagiriya Branch Manager of Bank of Ceylon.",
    "Lyrics of a song": "හන්තානට පායන හඳ\nලස්සනයිද කියන්න \nමා නොදකින ඒ පුර හඳ\nඔබට හැකිය දකින්න //\n\nඅඳුරු වලා වහිනා කල\nසරසවි බිම තෙමන්න //කුඩේ යටින් ඔබ යන කල\nඑපා තනිය දැනෙන්න\n\nලතා මඬුලු අත වනාවි \nඑපා අහක බලන්න // \nමා ගැන මතකය ගුලි කර\nමහවැලියට දමන්න\n\nහන්තානට පායන...//",
    "Songs": "Amaraniya Wedo Minisa Widunena Mudunathadi, Hantanata Payana Sanda Lassanaida Kiyanna, Hanthana Kanduwatiya Eda Wagei Adath, Iki Gasa Handana Athithayaka Kandulu Ekka, Oba Eda Nam Sanda Wagemai, Wahi Kirilli ",
    "email": ""
  },
  {
    "Name": "අමිත් වල්පොල",
    "Birth Date": "",
    "City": "හෝකන්දර",
    "Biography": "Amith Walpola is one of the Popular Sri Lankan musician and singer. He is the second son of great Dharmadasa walpol",
    "Lyrics of a song": "මංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\nවේය සිතෙ සෝකෙන් මේ ආලෙන් මේ බීමෙන්\nවිනාසෙ වැටි වැලපෙනවා සැමා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nරූපෙට රැවටිල ඇති සිත රාගෙන්\nනාස්ති කළේ කාලේ වැරදි තාලෙන්\nමිහිරි රස මිහිරි\nවූ රාගේ වින්දේ ඇයිද විස ලෝකයා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nජීවිතේ මේකද නැහැ තව තේරී\nමේ ලොව සිහිනෙකි මායාකාරී\nමිහිරි විනෝදේ වූ රාගේ\nවින්දේ තේරී තේරී වේදනා\nමංමුලා වෙලා අඳුරෙ මේ යන්නෙ කොහෙ දැන් අප සැමා\n\nමේ ලෙස ඇයි ඔබ ලෝකෙ මුලාවෙලා\nආදර මිහිරි විනෝදෙ එපා වෙල\nමායා මේ මායා\nදැලෙහි පැටලී වෙලීල ඇයි අනේ\nමංමුලා වෙලා …………",
    "Songs": "Ambare, Ganga yanne koheda, upatha laba, man mulawela, iranamata sawoma, jeewana me gamana, oyai mamai, pagala yamuko",
    "email": "amith.walpola@srilankasingers.com"
  },
  {
    "Name": "අමිතා වැදිසිංහ",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Amitha Wedisinghe is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "බැද්ද පුරා සුදු රෙද්ද වගෙයි යස \nඉද්ද පනා මල් කැන් පිපිලා.....//\n\nසද්දෙ මොකෝ අවුරුද්ද ඇවිල්ල ද \nසද්දෙ මොකෝ අවුරුද්ද ඇවිල්ල ද \nනැද්ද කනෙයියෙනි රොන් හැදිලා\n\nබැද්දට මල් වරුසාවක් වැහැලද \nනිල් කොළ පිට ඒ මල් පොද ඉහිලද .......//\n\nපාර වටේ ඇති සේරම ගස්\nසරු සාර හැඩයි ගෙඩි හට ගැනිලා \nගෙඩි හට ගැනිලා\n\nපේර දිවුල් පලු වීර ඉදී එන\nවාරෙ වගෙයි මේ පැනි පිරිලා\n\nබැද්දට පැනි වරුසාවක් වැහැලද \nගස් වල ගෙඩි පැනි වැස්සට තෙමිලද .......//\n\nරෑන ගිරා සැළලිහිණි කුරුල්ලන් \nසීනු හඬින් රස ගී ගයලා \nරස ගී ගයලා\n\nතාන තනා තම් දාන කියා\nඑළිමාන වටේ කැරකේ නටලා\n\nබැද්දට ගී වරුසාවක් වැහැලද\n\nගී පොද මේ හොට අස්සට පෙරිලද.....//",
    "Songs": "Aadara Charika, Ambiliyo, Anothaththa Wila, Badda Pura Sudu Redda Wage, Eka Mohothak, Galana Dole, Ginna Niwannata, Hadanna One",
    "email": "Amitha.Wedisinghe@srilankasingers.com"
  },
  {
    "Name": "ආනන්ද සමරකෝන්",
    "Birth Date": "13-Jan-11",
    "City": "පාදුක්ක",
    "Biography": "Egodahage George Wilfred Alwis Samarakoon (13 January 1911 – 2 April 1962) known as Ananda Samarakoon was a Sri Lankan composer and musician. He composed the Sri Lankan national anthem \"Namo Namo Matha\" and is considered the father of artistic Sinhala music and founder of the modern Sri Lankan Geeta Sahitya (Song Literature). Samarakoon was born to a Christian family in Padukka, Ceylon on 13 January 1911. He had his primary and secondary education at Christian College, Kotte, presently known as Sri Jayawardenapura M.V.Kotte. His Sinhala Guru was Pandit D.C.P. Gamalathge. Later he served his Alma mater as a teacher of Music and Art. Samarakoon left for the Visva-Bharati University, Santiniketan in India to study art and music. After six months he abandoned his studies and returned to Sri Lanka, and changed his name to Ananda Samarakoon, embracing Buddhism. Then he served as the music teacher of Mahinda College, Galle from 1938 to 1942. He committed suicide in 1962, possibly driven by unauthorized changes to lyrics in a composition.",
    "Lyrics of a song": "සිරි සරු සාර කෙතේ ගොයම් පැසීලා මහිමේ// \nපිස ගෙන එන සුළගේ කරල් නැමී නැමී දිලේ// \nහා හා ඇසේ ඇසේ////\n\nගොවි දන තුති නද දී කපති ගොයම් තොසේ තොසේ//\nයමු යමු හණික නගෝ අපි ද ගොයම් කපන ලෙසේ//\n\nහිමිදිරියේ.//\n\nහිමිදිරි සිරිය ළඟාවේ//\n\nපාමින තුටු කොමළ සිනා දිනරද අඹරේ නැගෙනා//\nකොවුලන් ගී හඬ ඇසෙනා ලක් මව සැනසේ නිතිනා//\n\nහිමිදිරියේ..//\n\nහිමිදිරි සිරිය ළඟාවේ//\n\nසිරි සරු සාර කෙතේ ගොයම් පැසීලා මහිමේ// \nපිස ගෙන එන සුළගේ කරල් නැමී නැමී දිලේ// \nසිරි සරු සාර කෙතේ....",
    "Songs": "පොඩීමල් එතනෝ, Vilay Malak Pipila, Poson Pohoda, Asay madura, Sunila Guvanay, Punchi Suda, Nilvala Gangay, Sumano, Pudamu Kusum, Siri Saru Saara Ketay",
    "email": ""
  },
  {
    "Name": "ආනන්ද වීරසිරි",
    "Birth Date": "16th November",
    "City": "කොළඹ",
    "Biography": "Mr. Ananda Weerasiri is one of the most experienced and talented resource persons in oriental music in Sri Lanka today. In addition to being a beloved teacher of many students he is also respected as an affectionate mentor, having shared his wisdom to shape the career of many young musicians. After studying music at the Institute of Performing Arts, Mr. Ananda Weerasiri started his musical career as a school teacher in 1972. He was also a singer of exceptional aptitude and a gifted musician both of which were put to good use by many music directors. Mr. Ananda Weerasiri himself is a creative music director and composer. He has directed music for stage dramas and teledramas. In his career as a teacher, Mr. Ananda Weerasiri served in several leading schools in Sri Lanka and rose steadily through the ranks. Being a dedicated teacher and a strict disciplinarian, it was not surprising that several opportunities came his way to move on to administration or to take up higher positions as an educationist but he opted to be close to the pupil and counted a dedicated and unblemished service as a teacher up to his retirement. Mr. Ananda Weerasiri is a founder director of “Kalabhumi” and in addition to being its longest serving resource person, is its mentor and counselor",
    "Lyrics of a song": "මහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nවිදු නැණයෙන් අබිසෙස් ලබමින්නේ\nසඳ මතුපිට පියවර එසවෙන්නේ\nඅප පමණද එක තැන කැරකෙන්නේ\nඅප තනිකර ලෝකය දිව යන්නේ\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\n\nඅපේ හදට සතුටක් මුසු වේ නම්\nඅපේ දුකට සුසුමක් මතු වේ නම්\nඅපේ හිතට දිරියක් ලැබ දේ නම්\nඑදා අපට පෙරමග සූදානම්\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nමහා මෙරක් ලෙසට\nහිතේ උපන් බරට\nහඬා දොඩා පල නොලබන හින්දා\nඋදා ළහිරු විලස\nඑබී හිඳිමු ලොවට\nසිනා මලක් මුව අද්දර රන්දා\n\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා\nආජු තපර ලාහිලා\nපීජි තපර ලාහිලා\nආජු තපර පීජි තපර\nබිස්කු බිස්කු ලාහිලා",
    "Songs": "Maha merak lesata, Ananda Bodhi Samine, Asata Nidi Nathi, Atha Neela Kandu Pele, Hiru Milinawa Giya Mohothe, Hitha Watakara Mal Pipenne, Kothanaka Ho Oba, Ma Hitha Alma, Premaye Suwen Sadanna, Sakvithi Padawiya",
    "email": "Ananda.weerasiri@srilankasingers.com"
  },
  {
    "Name": "අනිල් භාරති",
    "Birth Date": "",
    "City": "පානදුර",
    "Biography": "",
    "Lyrics of a song": "අද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nසතියේ දින හත, ගැන ගැන මගෙ සිත\nඉරිදා දින මත, මගෙ පැතුම් රැඳි ඇත\nසඳ පායන තුරු, කුමුදු පිපෙන තුරු\nමම ඉමි නිරතුරු, එන ඉරිදා වන තුරු\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඔබෙ සියුමැළි වත, පන ගන්වයි සිත\nපැටලී හදවත, සැමදා පවතිනු ඇත\nඉරිදා දිනකට, ඇති මගේ සහතික\nමැණ බර කිරුමට, හැකි වේවිද කෙනෙකුට\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද\n\nඅද වෙයි ඉරු දින, ඔබ හමුවේවිද\nඔබ හා බැඳි හද, අද නොතැවේවිද\nමගෙ හද විල මැද, සැලෙන ඕළු කොඳ\nඅද සුපිපිපේවිද, මගෙ සිත තුටු වේවිද",
    "Songs": "Aawa Ingland, Aawa Soya Soya, Ada Andure, Ada Wei Iru Dina, Ayanu Kiyala, Bambareku Henduwa, Bethlehem Pure, Biso Menike",
    "email": "anil.bharathi@srilankasingers.com"
  },
  {
    "Name": "ඇන්ජලීන් ගුණතිලක",
    "Birth Date": "23-Dec-39",
    "City": "කෝට්ටෙ",
    "Biography": "Angelina Rachel de Lanerolle (Sinhala: ඇන්ජලීන් ගුණතිලක; 23 December 1939 – 29 March 2019), popularly known as Angeline Gunathilake or Anjalin Gunathilaka, was a Sri Lankan singer, primarily working as a playback singer in Sinhala film industry. Considered the Silver bell of Sinhala cinema, Gunathilaka worked on over 5000 playback songs in a musical career that spanned nearly six decades. She was an A-grade singer who graduated from Sri Lanka Broadcasting Corporation. She died at the age of 79 while receiving treatment at National Hospital of Sri Lanka, Colombo.",
    "Lyrics of a song": "කවදා හෝ සසර කතර අතරමගක දී\nදුටුවා ඔබ මට අමතක නොවන තැනක දී\nඑතැන් පටන් මම එමි සෙවනැල්ල නියා වේ\nකියන්න බෑ මහිමය මා බැන්ද දයාවේ\nකවදා හෝ සසර කතර අතරමගක දී\n\n(මිදුලෙහි ඇති ආලෝකය නිවසට එන්න) //\nසුදු ඔබගේ දෑතට මගෙ දෑතම දෙන්න\n(මිදී දුකින් රස බලන්න සිතමි මීවිතේ) //\nරිදී ඉරකි ඔබ මාගේ අඳුරු ජීවිතේ\nඅඳුරු ජීවිතේ\nකවදා හෝ සසර කතර ................\nකවදා හෝ සසර කතර අතරමගක දී\n\n(පවසනු බැරි නම් ඉදිරියෙ කරුණු ඹබෙ හිතේ) //\nමට පණිවිඩ එවනු මැනවි කුරුල්ලෙකු අතේ\n(දුකයි සැපයි ජයයි පරාජය සැම මැද්දෙන්) //\nඔබෙයි මගෙයි අඳුරු ලොවට සඳ පායද්දෙන්\nසඳ පායද්දෙන්\nකවදා හෝ සසර කතර ................\nකවදා හෝ සසර කතර අතරමගක දී",
    "Songs": "කවදා හෝ සසර කතර, Adarawanthayeki, Adarayen Wenweela, Adare Hithenawa Dakkama, Ahanna Nangi Malliye, Aluth Irak-Madu Sihina, Amara Pem Lathawe, Ambare Ada Netha, Atha Dilisena Hiru Sadu Ran Tharu, Athu Aga Mal, Baala Massine, Bangali Walalu",
    "email": ""
  },
  {
    "Name": "ඇනස්ලි මාලේවන",
    "Birth Date": "June 13th, 1947",
    "City": "රත්නපුර",
    "Biography": "ඇනස්ලි මාලේවන is a Sri Lankan musician. Often considered \"The Prince of Sinhala Pop\", Malewana is well known for being a master of contemporary Baila worked with popular musical bands The Moonstones and Super Golden Chimes. Malewana was born on June 13, 1947 in Ratnapura, Sri Lanka and attended St. Joseph's College, Colombo. He is married to Swarnamali and the couple has one son and one daughter. The songs performed by Malewana and Clarence over their three decades have recently been credited, by the group Pahan Silu, as having served to influence them in crafting their unique musical style. His voice has been heard by Londoners over BBC Radio London 206 on the London Sounds Eastern radio program and on community radio in the United States and in Australia.",
    "Lyrics of a song": "සිහින පැතුම් විමනේ - රස මිහිර ගෙනා පුතුනේ\nනැලවී නැලවී හිනැහී හිනැහී - නිදියන් පොඩි පුතුනේ\n\nදෑසයි කුඩා ඔබගේ -ළපටි දෙතොල් පුතුනේ - කාගෙයි කියා සිතුවේ\nමුහුණයි රුවයි ඔබගේ - පැහැයයි හැඩයි පුතුනේ මාගෙන් නොවැ ලැබුණේ\nසිහින පැතුම් ...........\n\nමා මෙන් ඔබත් පුතුනේ - මිනිසෙක් වෙලා දෙරණේ - රට දැය කෙරේ බැඳිලා\nමව්බිම ඔබෙයි සිතලා - පණ මෙන් ඔබේ රැකලා - දිරි ගත යුතුයි පුතුනේ\nසිහින පැතුම් ...........",
    "Songs": "සිහින පැතුම් විමනේ, Mathakai Thamath, Ruwanpuren Indala, Thotiya, Manamali, Goyam Kapanawa, Kalu Mame, Mango Nenda, Pawuru Walallak",
    "email": ""
  },
  {
    "Name": "ඇනස්ලි නානායක්කාර",
    "Birth Date": "",
    "City": "මිහින්තලය",
    "Biography": "Annesley Nanayakkara is one of the Popular Sri Lankan musician and singer.",
    "Lyrics of a song": "ළපලු ලතා මණ්ඩපයේ\nකඳු යායේ සෙවණැල්ලේ\nලොවේ උකුසු දෙනෙත් වලින්\nසැඟවී ගමු කුමරියනේ\n\nමිහිදුම් සළු සේද සේළ\nඋකුළු තලාවෙහි දවටා\nඅපේ සිඟිති සිහින සිතුම්\nසපුරා ගමු කුමරුවනේ\n\nවසන්තයේ එක් සිහිනෙක\nඔබ මා හා අතිනත් ගෙන\nඅනන්තයට පාවී ගිය\nඅයුරු අද ද සිත්හි නැඟේ \n\nගලා හැළෙන පෙණ බුබුළේ\nමුවග සිපින නලරැල්ලේ\nඒ සිහිනය සැබෑ ලොවේ \nආදරයක් බවට හැරේ\n \nවන වදුලේ රජ දහනේ\nපෙම් රකුසන් පලවා හැර\nසුපිපි කුසුම් දාමයකින්\nඅභිෂේකය උදා කරමු\n\nවන පලවැල නෙළා ගෙනත්\nමුව මීවිත පුරවන්නට\nසදා සොඳුරු සුහද ලොවක්\nඅප වෙනුවෙන් තනා ගනිමු\n\nළපලු ලතා මණ්ඩපයේ\nකඳු යායේ සෙවණැල්ලේ\nලොවේ උකුසු දෙනෙත් වලින්\nසැඟවී ගමු කුමරියනේ\n\nමිහිදුම් සළු සේද සේළ\nඋකුළු තලාවෙහි දවටා\nඅපේ සිඟිති සිහින සිතුම්\nසපුරා ගමු කුමරුවනේ.",
    "Songs": "ළපලු ලතා මණ්ඩපයේ, Badde Gam Madde, Buddan Saranan Gachchami (Buddha Diwakarayano), Hansa Vile Hasagana Wee, Kaiman Dorakada, Kalpana Mawa, Kandulu Podak (Nirasha), Lapalu Latha Mandapaye, Ninda Ma Nethin",
    "email": "annesley.nanayakkara@srilankasingers.com"
  },
  {
    "Name": "ඇන්ටන් ජෝන්ස්",
    "Birth Date": "3-Jun-37",
    "City": "අලුත්කඩේ",
    "Biography": "ඇන්ටන් ජෝන්ස් (3 June 1937 – 21 February 2016) was a Sri Lankan singer and songwriter. Considered as a prominent Baila singer in Sri Lanka, Jones had several hits, including Mini Gawuma and Uyala Pihala. His songs are composed about special events that took place in this country, thus becoming the only singer who sang from real events. He was born on 3 June 1937 in Colombo to a Burgher family in Hulftsdorp. His father was a businessman. He is an alumnus of St. Sebastian Maha Vidyalaya, Hulftsdorp. He has one elder sister.For the duration of his musical career, Jones also worked as an English stenographer for the Bank of Ceylon and private company Julius & Cruise since 1963. He retired in 1997 completing 35 years of service. He entered music under the guidance of his friend Wally Bastiansz in the early 1950s. Jones played a member of Bastiansz's band, initially got to join the choir. In 1958 he performed for the first time in front of a live audience for a Radio Ceylon event with the song Kanthoruwa Kanthoruwa. Jones had released 37 cassettes and eight CDs and often tackled contemporary events in his songs which include Maru Sira, Sepala Ekanayake, Kanthoruwa, Premawathi Manamperi and Podi Vijay. He had sung only a single duet in his career, with Angeline Gunathilake. Many of his songs were composed by Jones himself. He also composed many of the songs.",
    "Lyrics of a song": "බුදුන් තුන් වරක් වැඩි ශ්‍රී ලංකදීපය - දහම් සඟුන් සෙවනෙ දරුවො හැදුනු දේශය\nමොකක්ද ශ්‍රී ලංකාවට වුණු විනාශය - තුට්ටු දෙකට මිනී මරනව නැහැනෙ කිසි බිය\n\nපාසල් යන්නට පෙර වැඳ රැගෙන අවසර - සිරිත් පරිදි පාසල වෙත නැගුව පියවර\nඒ වන විට රුදුරු මරුව සිටියෙ ඉව කර - ඒ මොකවත් දන්නෙ නැහැනෙ සමන් කුමාර\nපන්තියෙ පළවෙනිය වුණේ සමන් කුමාර - මොනිටර් කම දැරුවෙත් පොඩි සමන් කුමාර\nමුළු පාසල බැබලුව සිසු සමන් කුමාර - අද පාසල් නාවෙ ඇයිද සමන් කුමාර\n\nලිපියක් ලැබුණා ගෙදරට පොලිසි නොයන්න - ලක්ෂ එක හමාරක් පාසලේ තබන්න\nනැත්නම් වෙන්නේ දරුවට මරුව දකින්න - කොහොම පපුව වාවන්නද අම්මට ඔන්න\nලියුම් ලියාගෙන දරුවට කරල කරදර - සිරිවර්ධන මුදලාලිට යැව්ව බලකර\nඒ මොහොතෙත් දරුව මරල තිබුණු තොරතුර - දැන ගත්තේ පස්සේ විමසුමෙන් දොස්තර\n\nඅපරාෞ නීතිය මෙය සවනට වැටිලා - පව්ලේ හිතවතෙක්ව පොලිසියෙන් සැක කළා\nඔහු අල්ලා ගෙන කරද්දි කරුණු විමසලා - අපරාදේ සුලමුල ඔහු විසින් හෙලි කළා\nපාන්සියේ කඳු යායට පොලිසිය ඇදුනා - ඝන කැලේක ගල් දෙබලක සමන් හමුවුණා\nහදවත සසලව යන මේ පුවත සැලවුනා - උගුරු දණ්ඩ විකා ඔහුව මරාල තිබුණා\n\nඑන්න පුතේ යන්න කියා නංවා සයිකලේ - අරන් ගියා සමන්ට පා බොරුවට ලීලේ\nපපුවක් නැති මිනිසුන් පා මුදලට ආලේ - නොදරුවෙකුගෙ ජීවිතෙ ඇයි මෙහෙම නැති කළේ\nකිරට හඬන කිරි දරුවන් නොදුටු උදවිය - පවක පිනක කිසි වෙනසක් නොමැති මේ අය\nතිරිසන් ලෙස අය්යෝ මේ ලොවට බිහි විය - උන්මයි වෙන්නේ මේ සිරිලකට සාපය\nබුදුන් තුන් වරක් ...........",
    "Songs": "සමන් කුමාර, Aasai Bayai, Abeetha Asamasama-Dimbulagala, Allaganna, Americawa - Thrastha, Anuwana Rata, Asuwada Sumithura, Baby Play The Ramba, Baluwama Ahinsakai, Dadikala Mage Mawuni, Daksha Vilasin, Eka Pana Se, Kanthoruwa Kanthoruwa",
    "email": ""
  },
  {
    "Name": "අසන්ක ප්‍රියමන්ත පීරිස්",
    "Birth Date": "",
    "City": "මොරටුව",
    "Biography": "Asanka Priyamantha Pieris is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "සියඹලා මලක් ඔබේ දෝතේ පිපෙනකොට\nඉගිලිලා යන්න බැහැ ඔය ඇස් දෙකෙන් මට\nපියඹලා ඇදෙන රන් සමණල යුවලකට\nනුඹේ හිතේ පෙම් සුවද ඇති තනි නොතනියට\n\nපෙම් හසුන් ඔබ ලියූ කවි පේලී සුන්දරයි\nරත්තරන් හදවතේ ආදරේ පිවිතුරුයි\nපෙම් හසුන් ඔබ ලියූ කවි පේලී සුන්දරයි\nරත්තරන් හදවතේ ආදරේ පිවිතුරුයි\nතනිවෙන්න දෙන්නෙ නෑ මේ හිත\nඔබට ආදරෙයි\n\nසියඹලා මලක්...\n\nනෙතු සිඹින පුර හද ලස්සනයි රැයකට\nඅමතක කරන්නෙපා මා ඔබේ සදවත\nනෙතු සිඹින පුර හද ලස්සනයි රැයකට\nඅමතක කරන්නෙපා මා ඔබේ සදවත\nහීනෙන් ඇවිදින් මගේ යහනේ\nඉන්න දෙව් දුව\n\nසියඹලා මලක්...",
    "Songs": "සියඹලා මලක්,Ada Sanda Nalale, Adarei Man Oya Hithata, Ahasa Usata Mawu Guna, Andura Iki Bindina, Andurata Huruwu Dese, Atapethiya Mala, Atha Wana Pethin, Athul Hithe - Amma",
    "email": "asanka.priyamantha@srilankasingers.com"
  },
  {
    "Name": "ආත්මා ලියනගේ",
    "Birth Date": "June 1st",
    "City": "කලුතර",
    "Biography": "Athma Liyanage is a Sri Lankan singer and songwriter. He became popular in the early 90s with the song 'Liyathambara'. He gained popularity with the Millennial generation with his new songs 'Ayemath adaren' and 'Sitha dura handa'.",
    "Lyrics of a song": "ලියතඹරා මෘදු කුසුමකි ඈ\nතවුසන්ගේ දැහැනේ සම බිඳිනා \nනෑ ලෝකෙ ජීවේ ඇයයි...//\n\nමායාව මායාව ලොව රවටනා \nසිහිනයකි සිහිනයකි අඳුරෙ පාවෙනා \nවීණාව තත් අතර මෘදු ස්වරෙ ඇයමයි \nමා හදට රස ගෙනෙන මදුවිත ඇයයි\n\nලියතඹරා මෘදු කුසුමකි ඈ\n\nමිරිගුවකි මිරිගුවකි අප රවටනා \nදුර ඈත සිතිජයකි ඉම නොපෙනෙනා \nනිල් නයන බිගුකැලකි නෙත් සරය සුමුදුයි \nමගෙ ජීවෙ වැලි කතරෙ දිය බිඳ ඇයයි\n\nලියතඹරා මෘදු කුසුමකි ඈ",
    "Songs": "ලියතඹරා, Epa Kandulel Sala, Kandu pamula sita, Ayemath adaren, Sitha dura handa, Na Thawath Hithak, Ahimi Nethu Aga",
    "email": "athma.liyanage@srilankasingers.com"
  },
  {
    "Name": "අතුල අධිකාරි",
    "Birth Date": "March 8 in 1966",
    "City": "හලාවත",
    "Biography": " Adikari Mudiyanselage Pubudu Athula Adikari was born on March 8 in 1966 at Mahawewa in the Chilaw District to A.M. Kumaradasa Adikari and Lalitha Wickremanayaka. Famous singer Nelu Adikari is Athula’s only younger sister. Athula’s was a musical family. Though his father taught English and Science subjects at school, he loved to play music instruments and sing along with Athula’s mother who was a music and dancing teacher. The background his sister and he got since their childhood moulded them to reach the peak as of at present though they never had any intention of choosing music as their profession. Every one born to this world is gifted with some talent to live. To what height they can climb up is decided by their previous Kamma (good deeds). However much you try to divert one’s path of destiny, it won’t change. Athula’s was also a similar story. Athula studied the alphabet first at Ananda Vidyalaya, Chilaw where his mother was a teacher. He then entered Royal College, Colombo through a Grade Five Scholarship. Athula studied Trinity College piano music upto grade 5. The Guitar was always an attraction. He learnt the Eastern music notes in singing from his mother. Music was his forte, Tennis and Badminton were among his few hobbies. Neil Warnakulasuriya, a guy who was a few years senior to Athula, was also from the same village, Mahawewa. Neil was at Thurstan College, Colombo, and after his exams he decided to form a band of his own. Neil and Athula knew each other since they were kids. As Athula re-entered Ananda Vidyalaya, Neil who was in search of young musicians invited Athula to join them. 'Sunflower' which blossomed in Chilaw spread its popular fragrance all over the island within a short spell of time. Meanwhile Athula managed to sit for A/Ls in 1984, and inevitably strengthened his partnership with the band. `Sunflower’ released their first cassette in 1986. Athula was the keyboardist and had not tried his talents as a singer. But, in 1988, he tried his luck as a singer and released his first solo `Ran Palase’. Out of 12, six songs were hits. Not merely girls, but little ones, middle aged and elders soon became his fans.",
    "Lyrics of a song": "මගේ කියා ඈත් වෙලා වේදනා දුන්න \nහිත ළග පෙම් සිහින වල හිදින්නේ ඔබම \nඇස් දෙක ආයේ ඔබේ ඉතින් හිමිවෙන් නැතිවාට \nකදුළු මතක අපේ සිහින කර හඩන්නෙ තනිව \nඅඩන්නේ තනිව...\n\nදුර රැදිලා කදුළු දරන් මට හිදින්න බෑ \nමා තනිවම විදිනවා දුක ඔයා දන්නෙ නෑ \nනාඳුනනා ලෙස හැරදා මට ඉන්නට බෑ \nකවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ \nයලි හිමිවෙන්නෙ නෑ..\n\nහිත දවනා මතක තියන් මට හිදින්න බෑ \nරෑ තනිවම හැඩුව තරම් ඔයා දන්නෙ නෑ \nමේ දෑසට යලි කිසිදා ඔබ හමුවන්නේ නෑ \nකවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ \nයලි හිමිවෙන්නෙ නෑ...\n\nමගේ කියා.....",
    "Songs": "මගේ කියා ඈත් වෙලා, Aadara Sithin, Adare - Pini Mal Wal Amuna, Adare Soya, Ahinsakai Ea, Anda Manda Sanda, Atha Lokayen, Boho Kalak Oya, Daiwaye Saradamin, Dan Ithin Wena Kumak Karannada, Dansal Langa, Dewatha Eli Se, Eka Dawasak, Eka Heenen, Guru Para Digata",
    "email": ""
  },
  {
    "Name": "බන්දුල විජේවීර",
    "Birth Date": "",
    "City": "අලව්ව",
    "Biography": "Bandula Wijeweera is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "කුල ගෙදරින් දුම්බර කඳු වැටියේ\nකැන්දන් එනවා දුම්බර මැණිකේ\nමනු කුල සිරිතට පති කුලයට අද\nකැන්දන් එනවා දුම්බර මැණිකේ //\n\nවන ලන්දෙ හැංගුණු\nමූණ පොඩ්ඩක් කෝල වෙයි\nගම් මණ්ඩියේ...\nගහ වැල් පිපී සුවඳින් පිරී අද\nපෙම් කෙළි වැව් කණ්ඩියේ //\n\nවාසනාවන් හරි වාසනාවන් ////\n\nකුල ගෙදරින්...\n\nදඹ රත්තරං හැඩ දා සොඳින් කළ\nරූපයක් ඇඹුමක් වගෙයි\nඔහෙ ඇස් වහක් නැත හෝ වහක් නැත\nආකහේ තරුවක් වගෙයි //\n\nවාසනාවන් හරි වාසනාවන් ////\n\nකුල ගෙදරින්...",
    "Songs": "කුල ගෙදරින්, Ane Seeye, Dotha Pura, Duppathunge, Gath Mitiya, Guru Gedara, Hitha Heela Na, Issara Kale Ape Seeyala, Kanda Surinde, Kula Gedarin-Hula Wali",
    "email": "bandula.wijeweera@srilankasingers.com"
  },
  {
    "Name": "භාතිය ජයකොඩි",
    "Birth Date": "22-Dec-76",
    "City": "කොළඹ",
    "Biography": "Bathiya Jayakody was born to a military family. His father was late Maj. Gen. Nihal Jayakody and mother Mohini Jayakody. His singing abilities come from his mother’s side. His maternal grandmother Somi Singhika Basnayake who hailed from Hillwood College, Kandy, was in the college choir and his mother a classically trained pianist and a piano tutor. Bathiya started classical piano music from the age of seven and continued to excel in music throughout his school career. He started his education in Holloway Primary School in India and upon return in 1984, he entered Isipathana College, Colombo for a brief period. In 1988, he joined Ananda College, Colombo, where he later held the position of Deputy Head Prefect in 1995 and was decorated as a President Scout of the Scout Troop in 1994. After his secondary education at Ananda College, he completed his degree and obtained BSc (Hon) Business from the Manchester Metropolitan University, UK. He later started learning the music technology with the Sri Lankan music artist Dilup Gabadamudalige. He also joined the Marry Anne Singers Colombo and studied opera, jazz and Broadway singing under the Mary Anne David School of Vocal Music. During the late 90s, Bathiya worked as a freelance vocalist singing for radio jingles and commercials together with Ranga Dassanayake. During this period, Bathiya Jayakody and Santhush Weeraman collaborated on a few projects, which led to the formation of BnS. They have been one of the most commercially successful music acts in Sri Lanka in the last two decades.",
    "Lyrics of a song": "චාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ\n\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\n\nසන්සුන් සුසුම් ද කැළඹි\nඇයිද මොකදැයි ඇහුවා\nරාගයේ චන්ද්ර හැඟුමන්\nරණ්ඩු කෙරුවා\n\nමං කෙසේ කොයි ලෙසේ මුමුණ\nමේ ශෝක ගීතේ\nකවුරුවත් දන්නෙ නෑ දැන් මේ\nමං ඉන්නෙ හිරගේ\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\n\nදිවි ගිම් නිවෙන්න පැතුවේ\nමදුර ස්වරයයි ඔබගේ\nආදරේ හීනයක් නම්\nහැබෑ නොවෙනා\n\nමං කෙසේ දැවි දැවී ඉන්නෙ\nමේ වේදනාවෙන්\nඇස් අගින් ඔබ ලියූ කවි ගී\nමුමුණන්න මුවඟින්\n\nඔය මන්දහාසයෙන්\nසැනහේවි ජීවිතේ\nසෝතාප සඟවන්න\nඔබ එන්න ආදරෙන්\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ",
    "Songs": "Unmadini Hanguna, Ai Kale Adare, Anande Wahi Walawa-Hiri Poda Wassa, Apatai Me Mihithale, Ape Gam Gode, Baila Gamuda Remix Karala, චාන්දනී පායලා, Dedunna Sedi, Denna Dena, Gassana Danga Malla, Gum Nade Ranen Rane, Hiri Poda Wessa, Hitha Nabara Thaleta",
    "email": ""
  },
  {
    "Name": "සී. එල්. ෆොන්සේකා",
    "Birth Date": "",
    "City": "මොරටුව",
    "Biography": "Veteran Singer, song writer, music director stage and tele drama actor C.L. Fonseka better known as ‘Sonny’ to his close friends was recognized with ‘The Kala Bhushana’ award for his outstanding services in the artistic field. C.L has been singing from the age of nine and went on to act on stage with personalities like the late ‘Rukmani Devi’ and later on in stage dramas such as ‘Rankada’ & ‘ Dhamini’. He also provided music for the Song of Moratuwa titled “Siribara Moratu Game’’ the theme song of the Moratuwa Arts Forum. C.L had the distinction of working with great names such as Pandith W.D Amaradeva, Austin Munasinghe, Anura Mahanama, Sunil Shantha, Thissa Siri Perera and emerged as a graded radio singer in 1952 during the early Radio Ceylon days.",
    "Lyrics of a song": "\"දැන් ඉතින් සමුගන්න වෙලාවයි\nඔය කදුලු ඇස් දෙකට බර වැඩී\nමට දෙන්න ඒ කදුලු තනි කමට ලග ඉන්න\nමට අකැප ඒ ලොවට දැන් ඉතින් ඔබ යන්න..\"",
    "Songs": "Aadare Saadaya, Aluyama Hirikada Pinne, Deegeka Yannata, දැන් ඉතින් සමුගන්න වෙලාවයි, Ena Walin Death Pa, Ko Ran Ethana, Mal Mal Mal, Mangala Me Suba Mohothe",
    "email": "CL.Fonseka@srilankasingers.com"
  },
  {
    "Name": "සිරිල් ටියුඩර් ප්‍රනාන්දු",
    "Birth Date": "28-Jan-21",
    "City": "කොළඹ",
    "Biography": "සිරිල් ටියුඩර් ප්‍රනාන්දු (28 January 1921 – 17 October 1977), popularly known as C.T. Fernando, was a Sri Lankan singer and composer. One of the most popular singers in Sri Lankan music often known as the First Pop singer in Sri Lanka, Fernando was praised by critics for the themes and wording of his songs like \"Vana Bamaru,\" \"Bilinda Nelwa Ukule\" and \"Rosa Male.\" His other popular songs include \"Lo Ada Ninde\", \"Gile Male Tarawa\" and \"Mariya Mawu Kuse\".",
    "Lyrics of a song": "ලෝ අඩ නින්දේ මේ රෑ යාමේ \nසඳ රැස් වතුරේ කිමිඳෙන්නේ \nරන් තරු බැබලේ නිල් ආකාසේ \nලස්සන මල් වාගේ\n\nකිරල ගසේ ගෙඩි දිය මත වැටිලා \nපහලට බැස යයි දිය රැල්ලේ \nනාමල් පිපිලා නැලවෙති සුළඟේ \nසුවඳ හමා දසතේ\nසෝබන මේ නදියේ සෝබන මේ නදියේ \nසඳරැස් වැතිරෙන්නේ\nලෝ අඩ නින්දේ…………\n\nඇල් කෙතකින් එන දැරියක ගේ හඬ \nදැන් දැන් මා හද නළවන්නේ \nමහ රෑ හින්දයි ඇයගෙ රිදී හඬ \nදසතම පැතිරෙන්නේ\nකවුරුද ඇල්හේනේ කවුරුද ඇල්හේනේ\nගී හඬ පතුරන්නේ\nලෝ අඩ නින්දේ…………",
    "Songs": "Vana Bamaru, Bilinda Nelwa Ukule, Rosa Male, ලෝ අඩ නින්දේ, Gile Male Tarawa, Mariya Mawu Kuse, Punsanda Hinahenne, Ranwan Ran Kendi",
    "email": ""
  },
  {
    "Name": "චම්පා කල්හාරි ජයසේකර",
    "Birth Date": "26-Mar-74",
    "City": "පිලියන්දල",
    "Biography": "Kalhari was born in Colombo, the daughter of a musician and a lecturer in aesthetic university colombo, Sangeet Visharad H.D.S Jayasekara. She is also a mother to Hettiarachchige Don Sanchith Jayasekara born in 2004. She was educated in Visaka Vidyalaya, Colombo and studied music in Bhathkande music college lucknow India. She did Sangeet Visharad in 1994 and Sangeet Nipun in 2015. She currently resides in Nugegoda.",
    "Lyrics of a song": "මල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ \n\nමල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ\nකවදත් මේවාගේ...මල් හිනැහෙන පාරේ \nකවදාද යන්නේ ඉස්කෝලෙ ආයේ \nසුවඳත් අද වාගේ..සිරවේ හද යායේ \nසමුගන්න කඳුළින් දෙනුවන් පිරිලා \nමේ අපේම පන්තියේ යහළු යෙහෙළියෝ දමා \nහැරයන්න මට බෑ පාසැල් බිමෙන් එහා\n\nමල් යායෙ සමනල්ලු කෝ..පාලුවී ගිහින්\nඉස්කෝලෙ අන්තිම දවසයි අපේ \nමල් යායේ සමනල්ලු පාළුවේ ගිහින් \nඉස්කෝලෙ අන්තිම දවසයි අපේ\n\nවැහිදාට පාරේ මඩ බිංදු ඉහිලා \nසුදුපාට ගවුමේ සිතුවම් පිරිලා \nපාඩම් කියෝලා..ගී සිංදු කියලා \nවේලාව නොගෙවා ගුරු සිත් නිවාලා \nජීවිතේ කතන්දරේ.. හෝඩියේ ඉදන් ලියූ\nඉස්කෝලෙ යුගයේ නිමවේ වි දුකෙනී..\n\nමල් යායෙ සමනල්ලු කෝ..පාලු වී ගිහින්......",
    "Songs": "මල් යායේ සමනල්ලු, Ahase Negena, Ajao Sathire, Aruna Geethaye, Barka Barse,, Bilindu Lowe, Chanda Mere Gar, Dethe Elleela, Dilena Ambara, Dina Me Mal Wiye",
    "email": "champa.kalhari@srilankasingers.com"
  },
  {
    "Name": "චාන්දනී හෙට්ටිආරච්චි",
    "Birth Date": "",
    "City": "නුගේගොඩ",
    "Biography": "Chandani Hettiarachchi one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "ලස්සන සමනලයෝ කොහෙන්ද ඔය පාට\nදිස්වෙන පබලු එකින් එක දිලිසෙන දාට \nලෝකෙට සුර ලෝකෙට ලස්සන පිවිතුරු පාට \nරන් මුතු බබලයි රන් මෙහෙසිය වූ දාට...//\n\nවිලාසිතා මන බඳිනා විලාසිතා \nවිලාසිතා නෙතු රැක්ෂෙනා විලාසිතා \nදිලෙන තරු වලින් නැහැවෙන විලාසිතා \nමලට පෙති වගේ බබලන විලාසිතා\n\nහමනා සුළඟට එක පැහැයක් එක් වූ වොත්\nගලනා මුහුදේ රළවල පැහැයක් වූවොත් \nඅදට වඩා හෙට උපදින නව දවසක් වුවොත් \nඅලුත් අලුත් දේවල් තව ලෝකෙට එක් වූවොත්...//\n\nවිලාසිතා මන බඳිනා විලාසිතා...\n\nලස්සන සමනලයෝ කොහෙන්ද ඔය පාට...\n\nවිලාසිතා මන බඳිනා විලාසිතා...//",
    "Songs": "ලස්සන සමනලයෝ කොහෙන්ද ඔය පාට, Adaren Datha Lan Wuna, Ahanna Mahathuni (Yasa Angana), Ahimiwa Giya De Gana Sithamin, Ai Minisune (Gee Gayala), Anandaneeya Rathriye, Araliya Mal Pokura, Arunata Pera, Awa Obe Upanda",
    "email": "chandani.hettiarachchi@srilankasingers.com"
  },
  {
    "Name": "චන්ද්‍රලේඛා පෙරේරා",
    "Birth Date": "1-Dec-61",
    "City": "කුරුණෑගල",
    "Biography": "Perera was born to a middle-class family in Kurunegala. As a child she often sang at home. At school she frequently sang and successfully took part in inter-school competitions. While studying she sang for the band \"Spring Time\" in Kurunegala. She met her future husband Rookantha Goonatillake in 1976 when he was a keyboard player for the band. Perera married Rookantha Goonatillake in 1989, and she has three daughters and a son. Two children from her previous marriage; Daughter Shyami Nadisha and Son Yohan Kumarage. She has two daughters with Rookantha, Raini Charuka and Windy.",
    "Lyrics of a song": "වන සිව්පාවුන් වැනි මිනිසුන් මැද\n\nදෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන්\n\nමනු ලෝ තලයේ වාසනාවන්\n\nවල්මත් වුවන් දැක මහ වන මැද යායුතු මාවත පෙන්වා\n\nඒ දෙස බලමින් සැනසෙන මිනිසුන් ඉටු දෙවියන් ලොව සිටිනා\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද\n\nදෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nකඳුළු සලන්නන් කඳුළින් ගොඩ ගෙන\n\nමුවගේ හසරැල් රඳවා තුටු කඳුළින් නෙතු සරසන දෙවියන් පුද දෙමු දෙවොලට කැඳවා\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත..\n\nඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්\n\nවන සිව්පාවුන් වැනි මිනිසුන් මැද දෙවි දේවතාවුන් වැනි මිනිසුන් ඇත.. ඒ දේවතාවන් දිව්‍යාංගනාවන් මනු ලෝ තලයේ වාසනාවන්",
    "Songs": "වන සිව්පාවුන්, Ada Andanawa Himiyani Yashodara, Adaraya Nisa, Adarayen Pirila Mage Hitha, Adare Sanathanai, Aida Puthe, Akase, Akashaye Sudu Meedume, Alawantha Kam Bandata",
    "email": "chandralekha.perera@srilankasingers.com"
  },
  {
    "Name": "චන්ද්‍රසේන හෙට්ටිආරච්චි",
    "Birth Date": "7-Sep",
    "City": "කොළඹ",
    "Biography": "Chandrasena Hettiarachch is one of the Popular Sri Lankan musician and singer. චන්ද්‍රසේන හෙට්ටිආරච්චි (born 7 September), popularly as Chandrasena Hettiarachchi, is a Sri Lankan singer. Having emerged from the youth choir as a group singer, Hettiarachchi has been able to show his talents and sang several popular songs such as Mal Mal Vile, Amma Jeewana, Oya Nisa Mage Sina, Kelesaka Keewath and Nawala Annasi.",
    "Lyrics of a song": "කවදාවත් යලි ඔබ නාවත් අමතක කරන්න බෑ තාමත්\nඅමතක කරන්න බෑ තාමත්\nඔබ වෙන්වුණු බව දැන දැන උන්නත් ආදරෙයි මා ඔබට තවත්\nආදරෙයි මා ඔබට තවත්\nආයේ දවසක හමුවීලා... ඉන්නට ආසයි ලංවීලා //\n\nඅපි හමුවුන තැන් තාමත් එහෙමයි වෙනස්වුණේ ඔබවිතරයි\nකාලය ගෙවුනත් දුක තව එහෙමයි\nසිත විමසන්නේ ඔබ ගැනමයි\nආයේ දවසක හමුවීලා ඉන්නට ආසයි ලංවීලා //\n\nඅපි ඈත් වෙලා ඉමු කීවත් සිහි වෙන්නේ ඔබ ගැනමයි\nඔබ තනිකල සිත කවුරුත් නොපතයි\nහැමදාටම මං ආදරෙයි\nආයේ දවසක හමුවීලා ඉන්නට ආසයි ලංවීලා //",
    "Songs": "කවදාවත් යලි ඔබ නාවත්, Mal Mal Vile, Amma Jeewana, Oya Nisa Mage Sina, Kelesaka Keewath, Nawala Annasi, Abiyachanayai Devindunge, Amma Jeewana Uyan There, Atha Atha Chandra Mandale, Bim Malak, Dahasak Hiru Sandu Payala",
    "email": "chandrasena.hettiarachchi@srilankasingers.com"
  },
  {
    "Name": "චරිතා ප්‍රියදර්ශනී පීරිස්",
    "Birth Date": "19-Oct-67",
    "City": "නුගේගොඩ",
    "Biography": "Priyadarshani was born on 19 October 1967 in Mirihana, Nugegoda. She has one older sister, Malika. Her father, Ariyadasa Peiris, was a popular radio artist and filmmaker. Her mother, Pushpa Wijeratne, was a housewife who died in 2001 after a brief illness. Priyadarshani completed education from Anula Vidyalaya, Nugegoda. She sang in every school ceremony along with her classmate Deepika Priyadarshani. At the school, Charitha studied Kandyan dancing under Daya Nellampitiya and Christine Dissanayake. She was an active member of the school's Eastern band and took part in guiding and netball. Charitha is married to singer Edward Jayakody. The couple has one son, Chandeepa and one daughter, Sharanya Rasodi. Since 1994, Edward and Charitha have worked together as artists in the United People's Freedom Alliance political campaigns.",
    "Lyrics of a song": "පන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ\n\nමේ බවක් තේරුණේ නැති කමින් ලෝකයේ\nනැති කමයි රජ වුනේ දුක් නොවවු මිනිසුනේ\nමේ බවක් තේරුණේ නැති කමින් ලෝකයේ\nනැති කමයි රජ වුනේ දුක් නොවවු මිනිසුනේ\n\nහෙට වුනත් නෑ පමා\nපණ පොවා ජීවිතේ\nරළ පෙළක් සේ නැගෙව්\nමියැදුනත් හාමතේ\n\nවීරියෙන් රට නැගූ දහදියෙන් බිම තෙමු\nජීවිතේ වේදනාවෙන් සදාකල් ගෙවූ\nවීරියෙන් රට නැගූ දහදියෙන් බිම තෙමු\nජීවිතේ වේදනාවෙන් සදාකල් ගෙවූ\n\nමිනිසුනේ හදවතේ\nලේ වලින් පණ ලැබු\nපරපුරක් බිහි කරව්\nමාවතේ තනි නොවූ\n\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\nපන්සලේ, පල්ලියේ දහදියෙන් අපි තැනූ\nපිළිම දාගැබ් පෙනේ ලෝකයක් දන නැමූ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ\n\nඒ අපේ ශක්තියයි\nඒ අපේ ජීවයයි\nවන්දනාකරන්නේ\nවන්දනා ලබන්නේ",
    "Songs": "පන්සලේ, පල්ලියේ, Ahas Gebe Tharu Keta, Ananda Weena Weye, Andara Lande, Andurakata, Api Punchi Pancha, Apsaraviye Kiyanna, Arunu Yaamaye, Chankaniye Paara Pura, Handapaana Wetena, Jeevithaye Yowun Viye",
    "email": "charitha.priyadarshani@srilankasingers.com"
  },
  {
    "Name": "චාමික සිරිමාන්න",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Chamika Sirimanne is one of the Popular Sri Lankan musician and singer. Chamika's grandfather is a cousin of Wasantha Sandanayake's husband, Dharmadasa Perera. Chamika's father is a talented saxophonist Susil Sirimanne.",
    "Lyrics of a song": "අපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nඅපි එක්වුණ මතකය සිහියට එනවිට\nකඳුළුයි දෑස තෙමන්නේ\nමම ඔබ ගැන හිත හිත දුක් වෙන හැමවිට\nමනසයි වන්දි ගෙවන්නේ\n\nහිතන්න බෑ හිත කීරිගැහෙනවා\nඔය සුදු මූණ මතක් වී\nසිඹින්න බෑ මුව අහක බලනවා\nමගෙ මුව එක්ක තරහ වී\nකියන්න බෑ අපෙ ආදර කතාව\nකඳුළුත් එක්ක සිනාසී\nසොයන්න බෑ තව ඔයා වගෙ කෙනෙක්\nආදරෙ කරන්න පෙර සේ\n\nඅපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nසුන්දර සිනාව සුරතල් සිනාව\nදකින්න ආසයි අඳුරේ\nදැවටුණ හැටි ආදරෙයි කියා මට\nදැනෙනවා කිති කැවි යහනේ\nතොල් පෙති සිඹින්න ආසයි ඇත්තට\nතුරුලට ගෙන ඔබ පෙර සේ\nආදරෙ කියන්න තව එක සැරයක්\nවෙන්වී යන්නට මත්තෙන්\n\nඅපි වෙන්වෙන තරමට කියනා දේවල්\nකොහොමද උහුලාගන්නේ\nඅපි වෙන්වෙන තැනටම කටයුතු වෙනකොට\nකොහොමද බල බල ඉන්නේ\n\nඅපි එක්වුණ මතකය සිහියට එනවිට\nකඳුළුයි දෑස තෙමන්නේ\nමම ඔබ ගැන හිත හිත දුක් වෙන හැමවිට\nමනසයි වන්දි ගෙවන්නේ",
    "Songs": "අපි වෙන්වෙන තරමට, Aye Enna Pana Mage, Bambaru Nodutu Mal, E Kale Oba Mahata, Giraviyage Gele, Heena Nathath, Hitha Hadaganna Ba, Mage Duppath As Deka",
    "email": "Charmika.Sirimanne@srilankasingers.com"
  },
  {
    "Name": "චිත්‍රාල් සෝමපාල",
    "Birth Date": "4-Nov-66",
    "City": "කොළඹ",
    "Biography": "Peragaswatte Chandana චිත්‍රාල් සෝමපාල (born 4 November 1966), aka Chity Somapala, is a Sri Lankan hard rock and heavy metal vocalist and a music director. He is known for his work with European power metal bands Firewind, Power Quest, Avalon, Faro, Red Circuit, and Civilization One. Somapala gained popularity in his home country due to his Sinhala track \"Nadee Ganga\" which was released in 1998. Chandana Chitral Somapala was born in Colombo, Sri Lanka, on 4 November 1966. His parents, Peragaswatte Liyana Acharige Somapala and Chithra née Perera, were musicians, music directors and producers. His parent's song, \"Dambulu Gale\" was recreated by Somapala to mixed feedback by critics. He has three brothers: Prasanna, Rohan, Nalin, and one sister, Piumi. Somapala was educated at Isipathana College (formally Greenlands College), a national school for boys, located in Colombo. While there, he played cricket, football (soccer), and hockey.",
    "Lyrics of a song": "නදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ\n\nසුළං රැල්ලේ දැවටිලා මන්ද මාරුතයේ\nසොයා යන්නෙමි\n\nගලා එන මන්දාකිණී\nහභා යමි හමුවෙන තුරා\nජීවිතේ උතුම් පැතුමන් හා\nනිරතුරුව අභිමානයෙන්\nමංමුළා නොවේ කිසිදා\nජවය මා සතු වේ\nදිරිය ගන්නෙමි\n\nගලා යන දහසක් නදී\nබලා සිටී මා එන තුරා\nනිරතුරුව අභිමානයෙන්\n\nනදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ\nනදී ගංගා තරණයේ\nසැරිසරා සැඩ මාරුතේ\nඉන්ද්රඛීලයක් සේ\nනොසැලී මා යන මාවතේ\nසිංහ ලෝකයේ\nසිංහ ලෝකයේ",
    "Songs": "නදී ගංගා තරණයේ, Malakuth Thibuna, Dambulugale, දෙදුනු රන් ඔවිල්ලේ, Sinha Lokaye Sinhaya",
    "email": ""
  },
  {
    "Name": "ක්ලැරන්ස් විජේවර්ධන",
    "Birth Date": "3-Aug-43",
    "City": "කොළඹ",
    "Biography": "Vithana Kuruppu Arachchilage ක්ලැරන්ස් Arthur Somasinghe විජේවර්ධන (3 August 1943 – 13 December 1996) was a Sri Lankan singer, composer and musician. Considered one of the most respected musicians in Sri Lanka, Wijewardena revolutionized Sri Lankan Sinhala Pop Music with the use of the electric guitar in Sinhala music, in the 1960s. Due to his influence on Sinhala pop music, he is often named as the father of Sri Lankan pop music. Clarence Wijewardena was born on 3 August 1943, in Haputale, Sri Lanka, to an estate medical practitioner. His family moved to Batugedara, Ratnapura, and Clarence abandoned a budding career as a planter to pursue music full-time. He completed education from Hatton Highland College and Mahasen College, Yatawatta. He married Sheela Ramadasa and they had one daughter, Amila Priyadarshani. Wijewardena died on 13 December 1996, at the age of 53, in Sri Lanka after a long struggle against ruptured gastric ulcers and gangrene due to acute Diabetes.",
    "Lyrics of a song": "ආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\n\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\n\nතටු සිදිලා වැළපෙනවා.\nසිත ඇදිලා... හිනැහෙනවා...\nමල් ඇතිරූ... සුව යහනේ...\nමල් අතුරා පවන් සැලූ\nආදරවන්තයින් පෙළූ...\nබොළඳ කතා...\nආදරේට කියන කතා බොළඳ උනාට\n\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\nආදරේට කියන කතා බොළඳ උනාට\n\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට...\nමල් ගොමුවේ...\n\nතුරු සෙවනේ...\n\nහමුවෙනවා...\nවෙන් වෙනවා...\nඋයන් කොනේ...\nඅවන් හලේ...\nඋයන් කොනේ හමුවෙනවා\nඅවන්හලේ වෙන් වෙනවා\nබොළඳ කතා...\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට\nආදරේට කියන කතා බොළඳ උනාට\nසාගරේක ගැඹුර දැනේ නොවෙද ඔයාට",
    "Songs": "ආදරේට කියන කතා, Aluth Lowak, Atha Epita Hima Kanden, Awasan Hasun Pathin, Daivaye Iranama, Duwa Ma Wage, Eatha Dinaka Oba, Gamen Liyumak Awilla, Geeyen Mathwela, Gei Dorakada, Hada Mal Gomuwe, Hada Wile, Hiru Sandu Athare, Hiru Sandu Makila, Hiruge Lowedi, Jeewitha Kathare, Kageda Gon Wassa - Mage Kumbure, Kanda Surinduni, Kimada Nawe, Kiri Kawadi Sina, Kiri Muhuda Kalambala Gena, Kiri Sudu Sele, Lapalu Sewane",
    "email": ""
  },
  {
    "Name": "ඩැල්රීන් සුබී",
    "Birth Date": "",
    "City": "පිලියන්දල",
    "Biography": "Dalreen Suby is one of the Popular Sri Lankan musician and singer. Dalreen Suby (Arnolda) is a popular pop singer from Sri Lanka who started her career in the early 1970s and still very popular in Sri Lanka. One of her earlier hits was \"Stranger Boy\" which came out in the 70s. She sings both in English and Sinhalese. She recently toured Canada and the United States with The Gypsies.",
    "Lyrics of a song": "ටික්කි ටිකිරි ටිකිරි සිනා පාලා..\n\nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..\nටික්කි ටිකිරි ටිකිරි සිනා පාලා.. \nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..\n\nපුංචි පුංචි මල් වැටිච්ච රෙද්ද ලස්සනයි\n\nදකින දකින අයගේ ඇස් පිනයි..... \nපරවී කිරිල්ලි වගේ ඉගිල්ලී........ \nපරවී කිරිල්ලි වගේ ඉගිල්ලී\nඈ යයි මුකුළු පෙන්නලා\nටික්කි ටිකිරි ටිකිරි සිනා පාලා.. \nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නල\n\nපුංචි නිලමේ හැංගි හැංගි ඇගේ රුව බලා\n\nආදරේට විහිළුවක් කලා...\n\nමැණිකේ ඔරවලා නිලමේ දෙස බලා\n\nමැණිකේ ඔරවලා නිලමේ දෙස බලා \nඈ යයි මුකුළු පෙන්නලා.......\n\nටික්කි ටිකිරි ටිකිරි සිනා පාලා..\n\nරං වළල්ල අතේ දමාලා\nඉගත් නලෝලා බදත් නලෝලා.. \nඈ යයි මුකුළු පෙන්නලා..",
    "Songs": "ටික්කි ටිකිරි ටිකිරි සිනා පාලා, Adara Loke, Apa Dedena Pamanak, Chuda Manike, Gepelata Aawa, Kelle Kelle, Nalawena Mawu Ukule, Oba Ha Semada, Oba Ma Sathuwei Kiya",
    "email": "dalreen.suby@srilankasingers.com"
  },
  {
    "Name": "දමයන්ති ජයසූරිය",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "",
    "Lyrics of a song": "උන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nඔබ හදවත මා හඳුනාගත් සේ\nමා හදවත ඔබ හැඳින ගනීදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nචන්ඩ මාරුතේ ඉන්ද්රකීලයක් වගේ\nනොසැලී ඉන්නට වරම් ලැබේදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nඉඳුනිල් දෙනයන සටහන් වේ\nසමනල වසන්ත යෞවනයේ\nඉඳුනිල් දෙනයන සටහන් වේ\nහා-හා-හහා-හා-හහා-හා\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්",
    "Songs": "උන්මාද වූ ප්රේමාදරේ, Aa Maga Ketiy, Api Katha Nokara Imu, Aware Pipi, Dase Nidimatha, Dewadasi Man, Giye Aida Mawa Thanikara, Hada Dawalu, Hiru Deviyo",
    "email": "damayanthi.jayasuriya@srilankasingers.com"
  },
  {
    "Name": "දමිත් අසන්ක",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Samith Asanka is one of the Popular Sri Lankan singer",
    "Lyrics of a song": "මං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා\n\nඅහස් මාළිගා නැහැ ඔබ නිසා මැවී\nසැක සංකා නැහැ ඔබ ගැන හිතේ රැදී\nහිමිකම් නොකියමි ඔබට මගේ කිසිදා\nඋරන නොවන්නෙමිඔබ අන්සතු වූ දා\n\nමං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා\n\nඅතැඟිලි බන්ඳන නපතමි පෙමින් බැඳී\nඔබ සිරකරලන දොරගුලු දමනු බැරී\nනෑකුල සිරිතෙන් සැලෙනා පෙමක් නොවේ\nපෙමට පෙමින් යන පෙම් ලොව මෙයයි අපේ\n\nමං හින්දා ඔබෙ\nනෙතඟින් කදුලක් හෙලන්නෙපා\nමං හින්දා ඔබෙ\nහද තුල සුසුමක් නැගෙන්නෙපා\nගිවිසා ගනිමු අපි\nපෙම් යුවලක් සේ කිසිදා එක් නොවෙනා",
    "Songs": "Adare Hithenawa, Adare Na Adare, Alapili Ispili Bala Bala, As Ridenakam Bala Unnath-Raththaran, Bageta Salun Doren Ringa, Handa Wate Das Mane, Jeewithe Nam, Kandulu Tharukata, මං හින්දා ඔබෙ",
    "email": "damith.asanka@srilankasingers.com"
  },
  {
    "Name": "දසුන් මධුෂාන්",
    "Birth Date": "2-Feb-96",
    "City": "රත්මලාන",
    "Biography": "Dasun Madushan (born 2 February 1996) is a Sri Lankan singer. He is the winner of the fifth season of Sirasa Superstar. He studied at Prince of Wales' College, Moratuwa. Madushan participated in Shihan Mihiranga Bennet's group in the contest. Some songs performed by him, such as : \"Sinhayo\", \"Menik Apsaravi\", \"Pransha Yuwathiyan\", \"As deka Piyaana\" were well received. His first song is the Swapna theme song, which he sang with Sirasa Superstar season 3 winner Shanika Madumali. He later debuted his first solo songs \"Ansathu Wee\" and \"Mage As Walin\".",
    "Lyrics of a song": "සෙවනැල්ලට පාට ගේනා\nදේදුන්නක වර්ණ තවරලා\nදිගු ගමනක යන්න මා හා\nපය නොගැටෙන මාවතක් සොයා\n\nසීමා නැති ජීවිතේ\nපියඹමු අරමුණු සොයා\nතාමත් ඇත හදවතේ\nකාටත් නොකියා ලියා තියා\n\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ,\nඅපේ කාලේ\nකාටවත් කිසිදා අත නොපා සදා\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ,\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා\nහසරැල්ලක වාරු සොයලා\nනොපැකිලිව ම එන්න පියඹලා\nහෙට දවසට අර්ථයක් සොයා\nඅද වෙහෙසෙමු කාලයෙන් එහා\n\nසීමා නැති ජීවිතේ\nපියඹමු අරමුණු සොයා\nතාමත් ඇත හදවතේ\nකාටත් නොකියා ලියා තියා\n\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා\nඉරනම ඉබේ විසඳෙනා කාලේ කාලේ\nඉහේ මල් පිපේ මාගේ මාගේ\nරජෙක් වෙන්න මට ඕනේ ඕනේ\nඅපේ කාලේ\nකාටවත් කිසි දා අත නොපා සදා",
    "Songs": "Sinhayo, Menik Apsaravi, Pransha Yuwathiyan, As deka Piyaana, Ansathu Wee, Mage As Walin, සෙවනැල්ලට පාට ගේනා",
    "email": ""
  },
  {
    "Name": "දයාන් විතාරණ",
    "Birth Date": "18-Apr-62",
    "City": "රාජගිරිය",
    "Biography": "දයාන් විතාරණ, (born 18 April 1962), is a Sri Lankan singer and a photographer. He has sung more than 330 songs across many genre. He was born on 18 April 1962 in Nuwara Eliya as the youngest of the family with two elder sisters – Niranjali Sunethra and Nirmali Savithri. His father Piyasena Witharana was a Local Government Officer and mother Nalini Decibel Jayasuriya was a housewife. He lived in Nuwara Eliya from 1962 to 1967 and then moved to Kandy until 1972. In 1968, he entered primary section of Dharmaraja College, Kandy and then entered St. Thomas' College, Matale from grade 6. In 1986, he moved to Colombo with the family and in 1992 permanently resides in Kamathawatte, Rajagiriya. On 6 January 1976, when Dayan was 13 years old, his father died at the age of 54 by a heart attack. After his father's demise, his mother started a cookery class and a needlework. His mother suffered from cancer for many years where she died on 25 April 2006. Former parliamentarian Gamini Jayasuriya is the cousin of Dayan's mother. Dayan is single, and he said he will not marry in the future as he is living according to the Buddhism.",
    "Lyrics of a song": "ඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සෙනෙහස ගොඩ ගලයි\nඋණුසුමට මාව තෙමෙයි...\n\nමා ඔබෙයි ඔබම කියයි\nඔබ මගෙද මටම භයයි\nමා ඔබෙයි ඔබම කියයි\nඔබ මගෙද මටම භයයි\nඔබ සදක් වගේ හැඩයි...\nහෙට අමාවක ද සැකයි...\n\nඔබ හැගුම් බරව දොඩයි\nඒ වදන් කවිම තමයි\nඔබ හැගුමබරව දොඩයි\nඒ වදන් කවිම තමයි\nඔබ වසන්තයක් වගෙයි...\nහෙට ගිමන්හල ද සැකයි...\n\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සුසුම් පවන් සලයි\nමගෙ කොපුල් පුරා වෙලෙයි\nඔබෙ සෙනෙහස ගොඩ ගලයි\nඋණුසුමට මාව තෙමෙයි...",
    "Songs": "Ahasa Wage, Allen Nala, Api Heta Gana Pasuwa Hithamu, Awasana Wasanthaya, Digu Kalak Ma Hithe Siraklala, Draffodil Mala - Sitha Ma Soragena, Geetha Govinde, Hanthane Kandu Mudunata, ඔබෙ සුසුම් පවන් සලයි",
    "email": "dayan.witharana@srilankasingers.com"
  },
  {
    "Name": "දයාරත්න පෙරේරා",
    "Birth Date": "",
    "City": "බත්තරමුල්ල",
    "Biography": "Dayarathna Pererais one of the Popular Sri Lankan musician and singer.",
    "Lyrics of a song": "ඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nලවන් හසකැන් නුවන් කැල්මන් හොදින් හදුනන්නේ ආදරේ\nනුවන් රැහැනින් බැදෙන්නට පෙම්\nනොමැතිදො මා කෙරේ\nමගේ විජිතේ සිනහ නොමැතේ විඩාපත් වේද ජීවිතේ\nඔබෙ ඇසුරෙ ඔබේ සෙවනෙ නවාතැන් වෙද මා වෙතෙ\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි\nඔබෙ පෙම් ලොල් හදෙ නොකැලැල් ලැගුම් සොයමින් නුවන් අයා\nයොවුන් බිගු දැල් හෙලු හසරැල්\nමසිත සුසුමන් දවා ගියා\nමගේ විජිතේ සිනහ නොමැතේ විඩාපත් වේද ජීවිතේ\nඔබෙ ඇසුරෙ ඔබේ සෙවනෙ නවාතැන් වෙද මා වෙතෙ\nඔබට සිත ආදරේ කරයි\nදෙතොල ගොලුවී සිටි\nනැගුන සෙනෙහෙ කියනු බැරිවි\nමගේ සිත වේදනා විදි\nඔබට සිත ආදරේ කරයි",
    "Songs": "Atha Hinahna, Aththatu Diga Harina, Aya Mata Seetha Devi Nowe, Bingu Bama Bama, Bo Wali Maluwe, Dangakara Keliththi, Digu Neth Hasarelle, Gini Weli Kathare, ඔබට සිත ආදරේ කරයි",
    "email": "Dayarathne.Perera@srilankasingers.com"
  },
  {
    "Name": "දීපිකා ප්‍රියදර්ශනී පිරීස්",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "දීපිකා ප්‍රියදර්ශනී පිරීස් is a Sri Lankan singer. One of the most popular female singers in Sri Lanka, she is the only Sri Lankan vocalist to awarded with Gusi Peace Prize. Deepika Priyadarshani was born on 13 July in Kalubowila as the third child of the family. Her father, Sumanadasa Peiris was an engineer. Her mother Karuna Peiris is a retired nurse. She completed education at Anula Vidyalaya, Nugegoda. She has one elder brother, Ajith Peiris and one elder sister, Ajantha Peiris who died when she was 3 years old. Her youngest sister is Shalika Peiris. At early times, her mother had gone to sing for various programs on Sri Lanka Radio. Mother's sister Priya Gunawardena is also a singer. She obtained Bachelor of Music Education (1st class) Vocal Visharadh, (1st class) from Bhatkhande University, India in 1990 and Master of the Arts in Mass Communication from University of Kelaniya in 2007. Later she obtained Bachelor of Education in 2002. On 15 August 2018, Deepika married longtime partner Chamika Herath, a banker by his profession. Also as a lyricist, Chamika composed many famous songs such as Maga Denethata Denatha Thea sung by Deepika.",
    "Lyrics of a song": "සමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\n▪︎▪︎▪︎\nනිල් වන රේඛාවේ රෑ කෝකිල ගී රාවේ\nකාලය පැන යයි එන්න ඉගිල්ලී - තාමත් සඳ ඇවිලෙයි\nනිල් වන රේඛාවේ රෑ කෝකිල ගී රාවේ\nකාලය පැන යයි එන්න ඉගිල්ලී - තාමත් සඳ ඇවිලෙයි\nදෙසිතක පෙම් සුවඳ නොහිම් - විඳිමු ඉතින් සමනළයෝ\n\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\n▪︎▪︎▪︎\nසුන්දර මල් වාරේ මල් සුවඳයි ගං තීරේ\nහිම කඳු යායේ පෙම් රජ දහනේ රෑටත් මල් පීදේ\nසුන්දර මල් වාරේ මල් සුවඳයි ගං තීරේ\nහිම කඳු යායේ පෙම් රජ දහනේ රෑටත් මල් පීදේ\nමියුරු සුරම් ගී මනරම් ගයමු ඉතින් සමනළයෝ\n\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා\nසමනළ රෑනයි රෑ හඳ පානයි\nහදවත කළඹා පැනගිය පියඹා කෝ ඒ සමනළයා",
    "Songs": "Ahasa Numba Metharam, Ahasai Oba Mata, Anna Balan Idikada Langa, Atharaman Wu Kirilli, Ayubowan Pembaraneni, Bo Dushkara Wu, Bol Pini Kata, Boralu Anena Paya Ridawana, සමනළ රෑනයි රෑ හඳ පානයි",
    "email": "deepika.priyadarshani@srilankasingers.com"
  },
  {
    "Name": "ඩෙස්මන්ඩ් ද සිල්වා",
    "Birth Date": "",
    "City": "මාතර",
    "Biography": "Desmond de Silva is a Sri Lankan singer and entertainer, noted for his youthful voice that has changed little over four decades of performing, and regarded as the \"King of Baila.\" Born in Matara in southern Sri Lanka, De Silva has performed to packed concert halls across the world. He is married to Deanna de Zilwa and the couple has two sons. Elder son Steve de Silva was a dancer and a vocalist. Steve died at a private hospital in Colombo after a brief illness.",
    "Lyrics of a song": "ආයා දොම්පෙ ආයා දුකට සැපට කදිම දොම්පෙ ආයා\nදොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා \nඅංගො මන්ගො ලයිසා ලුසියා සිලියා මිසියා ඇගියා මැගියා\nපපිනගෙ දුව මහත ඩොලිය පුංචි බේබි කිව්වා මැණිකා\nගියා ගියා යන්ට ගියා ගමට ගිහින් එන්න ගියා \nනෑ නෑ තවමත් නෑ නෑ\nඑහෙම යයිද අපේ දොම්පෙ ආයා \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nපළල් උකුල ගස්ස ගස්ස ආයා යනකොට \nකොළඹ හතේ බෙන්ස් කාර් එනවනෙ ලඟට \nලක්සන ආයගෙ හැඩරුව හින්ද කරුමෙට \nනෝනා එනවා මහත්තයත් එක්ක යුද්දෙට \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nදොම්පෙ ඉඳලා කොළඹ ආවේ පුංචි ආයා දැන්\nහරි ලස්සන වෙලා මගේ නෝනා වාගේ පෙම් \nආදරේට අතින් ඇදල රහස කීවේ මං \nකැමති නැතුව වගේ යන්නෙ මොකද රත්තරන් \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\n\nආයා වරෙන් මගේ ලඟට ගෝල් ෆේස් එකට යන්න\nඋඹේ ලස්සන රෝස පාට තොල් පෙති වල රස බලන්න\nරස බල බල අයිස් කිරිම් බාල්දියක් අරන් දෙන්න \nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා\nආයා දොම්පෙ ආයා පණ යනවා උඹ හින්දා ආයා",
    "Songs": "Amba Damba Naran, American Bancha, Api Wage Kollan Gena, Ara Balapanko, ආයා දොම්පෙ ආයා, Aya Mage Aya, Ayarin Josapin, Barabageka Tharama",
    "email": ""
  },
  {
    "Name": "ධනපාල උඩවත්ත",
    "Birth Date": "1-Nov",
    "City": "මොරටුව",
    "Biography": "Kala Bhushana Thelge Wayaman Peiris (born 1 November), popularly known by stage name ධනපාල උඩවත්ත, is a Sri Lankan singer. An indispensable singer on the outdoor stage, Udawaththa has been able to show his talents and sang several popular baila songs such as Ae Neela Warala, Ma Adaraneeya Mage Amma Wethatai, Man Italiye Thani Una, Nelum Wile Nelum Nelana and Ranga Nadeeka.",
    "Lyrics of a song": "මා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nඅව්ව වැස්ස රෑ දහවල් එකයිනෙ අපට\nඑකම සිතින් අවිත් ඉන්නෙ අපි සේවයට\nකිසිම බයක් දැනෙන්නෙ නෑ කොහොමත් හිතට\nසේවය කරනෙමි මිය යන තුරු ලක්බිමට\nමම සේවය කරනෙමි මිය යන තුරු ලක්බිමට\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nවීර පුතුන් බිහි කර රට රකින්න පුදනා\nඅම්මවරුන් පායුග වැඳ පුදන්න ඕනා\nඅම්මේ ඔබ කළ සේවය සදහට අගනා\nඉතිහාසයේ ලියවෙයි මතු දිනයක සොඳිනා\nලක් ඉතිහාසයේ ලියවෙයි මතු දිනයක සොඳිනා\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\n\nඅම්මේ මම සිතුවේ මේ ලිපිය ලියන්න\nමේ සටනින් මා මියගිය දිනයක ඔන්න\nමා මෙහි නැති අඩුපාඩුව මකා දමන්න\nබාල පුතත් හමුදාවට බාර කරන්න\nඔබේ බාල පුතත් හමුදාවට බාර කරන්න\n\nමා ආදරණීය මගේ අම්මා වෙතටයි\nමේ ලියන්නෙ අරක්ෂක කදවුරේ සිටයි\nඅපි ඉපදිල ඉන්නෙ අපේ රට රැක ගන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nමා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි\nඅම්මෙ මා කැපවුනෙ ඒ යුතුකම ඉටුකරලන්නයි",
    "Songs": "Ae Neela Warala, මා ආදරණීය මගේ අම්මා වෙතටයි, Man Italiye Thani Una, Nelum Wile Nelum Nelana, Ranga Nadeeka",
    "email": "danapala.udawattha@srilankasingers.com"
  },
  {
    "Name": "ධනිත් ශ්‍රී",
    "Birth Date": "22-Dec-94",
    "City": "මහනුවර",
    "Biography": "ධනිත් ශ්‍රී (born 22 December 1994) is a Sri Lankan singer, composer and songwriter. He is considered one of the most popular artists in Sri Lanka. Dhanith entered the mainstream music industry with his 2018 hit \"Pandama\". The alternative rock feel of this song is complemented by his high-pitched vocals as well as the mix of Sri Lankan traditional drum beats and synthesizers. It became number one on TV and radio charts concurrently. Dhanith Sri was born on 22 December 1994 in Kandy, Sri Lanka. He was educated at Vidyartha College, Kandy and Kingswood College, Kandy. He was graduated from University of Peradeniya with a specialised degree in electrical and electronic engineering.",
    "Lyrics of a song": "පන්දම රැගෙන යන්න එන්න මා හදවතට\nනෙතු දැහැන් බිඳිනා රන් සලුව ඇඳ\nලියතඹර ලෙලවා හද මඬල යට\nදෙන්න මැණිකෙ මගෙ පපුවට ගින්දර\n\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\nහදවත පතුලේ යකු බෙර වැයුනේ\nතම්දෙන තානේනේ නා\nඅනේ මගේ යකුනේ නටපන් හනිකේ\nතම්දෙන තානේනේ තානේනේ තානානේ\n\nතම්දෙන තානේනේ නා\n\nඉණ වට බැන්දා වූ මුතු පොට සැලෙනකොට\nපන්දම දැවෙනවා හද ගිනි ලවාගෙන\nවැහි කළුව එනවා නුඹ නැති දාට\nසිත් අහසම පුරවා අන්ධකාරෙක\n\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\nමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී\nරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේ\n\nහදවත පතුලේ යකු බෙර වැයුනේ\nතම්දෙන තානේනේ නා\nඅනේ මගේ යකුනේ නටපන් හනිකේ\nතම්දෙන තානේනේ තානේනේ තානානේ",
    "Songs": "නෞකාව, පන්දම, සඳගනාව, ගින්දර, එහෙම දේවල් නෑ හිතේ මගේ, ආලෝකවර්ෂ, ආදරියේ, නිවාලන්න මා, රෝජා, වේදිකාවේ",
    "email": ""
  },
  {
    "Name": "දුශ්‍යන්ත් වීරමන්",
    "Birth Date": "7-Jun-80",
    "City": "කොළඹ",
    "Biography": "Dushyanth Weeraman is a Sri Lankan, singer, dancer and actor who gained attention as the winner of the reality talent show \"Sirasa Dancing Stars\" in 2008. He is a winner of the \"Ten Outstanding Young Persons of Sri Lanka award in 2013. He is also the younger brother of Santhush Weeraman who is one half of the Sri Lankan pop-duo, Bathiya and Santhush.",
    "Lyrics of a song": "වාසනා ලොවක් ගෙනාව දිව්‍ය ලෝකෙ ඉඳලා ආව කෙල්ලේ \nසුරූපි කෙල්ලේ \nවේදනා ලොවින් මෙමාව ගලවගත්ත මා සුරූපි කෙල්ලේ \nසුරූපි කෙල්ලේ\n\nදුගී පැලක තරුණයෙක් අතේ \nරිදී මැණිකෙ රත්තරං නැතේ \nමාළිගාව හැරදමාලා ආවෙ ඇයි කඳේ\n\nදෙමාපියන් මුදල් වතුපිටි \nඑපා කියා පැලට ආ හැටි \nලොවට පෙන්නුවානෙ \nනියම ආදරේ හැටි\n\nරිදී ඉරයි වැහි වලාකුලේ\n\nපිපී සුවඳ දෙන නෙළුම් මලේ \nමගේ අන්ධකාර දවිය ඔබයි එළි කලේ",
    "Songs": "Pana Senehasa, Jeththu None, Vasana Lovak, Dedunna Wage, Mathake Hasarel, Nelum Vilen Pena, Omari Latha, Obawa Mata Himi Na, වාසනා ලොවක් ගෙනාව",
    "email": ""
  },
  {
    "Name": "එඩී ජයමාන්න",
    "Birth Date": "15-Feb-15",
    "City": "මීගමුව",
    "Biography": "Wanniaarachchige Don David Victor Jayamanne, popularly known as Eddie Jayamanne was a popular Sri Lankan comedian and actor of early Sri Lankan cinema. He was born on 15 February 1915 in Periyamulla, Negambo to a Christian family as the youngest of the family with seven siblings. His father, W. Don Thomas was a teacher at Maris Stella College. He was educated at the Cross College of Negombo, St. Peter's College, Negombo, St. Mary's College, Negombo and Maris Stella College. His elder brother B. A. W. Jayamanne was a renowned filmmaker and producer. Eddie married fellow Minerva troupe player Rukmani Devi after falling in love through their involvement in the same plays. Devi's parents challenged their engagement in court but they were allowed to go through with their marriage. On 25 July 1981, Eddie died from a Heart Attack. During his last days he was residing in 172, Palliyawaththa, Handala. His death was reported by a neighbor, P.K. Piyadasa. He was buried in \"Manyokhena\" Cemetery in Negombo.",
    "Lyrics of a song": "කොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nපිටකොටුවද මේ අනේ කඩ සාප්පු බොහො තිබේ\n\nපාර මැද්දෙ පීලි උඩින් ට්‍රැම් කාර් යනවනේ\n\nමහා පුදුමෙ මේක වේ තට්ටු දෙකේ බස්ය මේ ඒ පාරෙන් මේ පාරෙන් හරව හරව යනවනේ කොළොඹ ජැටියටා යමි නැව් බලන්නටා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nකොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රියා\n\nහන්දියෙ අර හිටන් ඉන්න රාළහාමි අත්දෙක මැෂින් එකක් වගේ නිකන් අර පැත්තට මේ පැත්තට හරව හරව පිටිපස්සට කාර් ලොරි බර කරත්ත බස් ඉස්ටොප් වෑන් එක මෙතන වදේ හරි ජරමර\n\nමොකද බොලේ මේ තරම්ම සෙනග කිව් එකේ අපේ ගමේ නාඩගමක් ඇවිල්ල ද මෙහේ කලිසම් ඇඳ බයිසි කලේ තරුණ තරුණියෝ ලැජ්ජ නැතුව යනව මොවුන් ගෝල් පීස් එකේ\n\nහො ගාන පොකුණටා යමි පා තෙමන්නටා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රී යා\n\nකොළොම්පුරේ ශ්‍රියා කොළොම්පුරේ ශ්‍රියා බොහොම ලක්ෂණයි කොළොම්පුරේ ශ්‍රියා ශ්‍රී යා",
    "Songs": "Thakkita Tharikita Udapana Natanna Hithuna, කොළොම්පුරේ ශ්‍රියා",
    "email": ""
  },
  {
    "Name": "එඩ්වඩ් ජයකොඩි",
    "Birth Date": "6-Apr-52",
    "City": "නුගේගොඩ",
    "Biography": "Jayakody Arachchige Don Edward Timothy Jayakody, popularly as Edward Jayakody, is a Sri Lankan musician, singer and composer. Jayakody has directed the music for hundreds of Sinhala films and television serials and has also composed many songs for children's programming (\"Koppara Koppara\"). Jayakody won the Swarna Sanka Award in 1987 for Best Male Singer for the film Gedara Budun Amma. He won Best Music Director in 1979 and 1980 for the plays Nidane and Aparadaya Saha Danduwama. Jayakody was born on 6 April 1952 as the youngest child with six siblings of Don Raphial Jayakody and Victoria Jayakody in Hettimulla, Kegalle, Sri Lanka. His mother died on 29 April 2017. Jayakody received his early education at Bandaranaike Junior School, and received his secondary education at St. Mary's College, Kegalle of Kegalle. He joined the church choir while attending Bandaranaike and learned music while at St. Mary's, under teacher H. Samarapala. Jayakody is married to popular songstress Charitha Priyadarshani where the wedding was celebrated on 17 January 1991. The couple has one son, Chandeepa and one daughter, Sharanya Rasodi.",
    "Lyrics of a song": "මාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී\nහිතේ භෘංග සේනා කිපී රොන් මතින්\nසොයන්නේ නුරා පැන් තිගේ මල් මුවින්\nහිතේ භෘංග සේනා කිපී...\nආ... ආ... ආ...\nහිතේ භෘංග සේනා කිපී රොන් මතින්\nසොයන්නේ නුරා පැන් තිගේ මල් මුවින්\nසනසාලනූ ඒ පිපාසා...\nමාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී\nප්රභා රන් කැළුම් දී සලා නේත්රයන්\nනිවාපන් ළඳේ චිත්ත පීඩා නොහිම්\nප නි ස රි\nප නි ස ග\nනි ස ග ප නි ස නි ප ග ස නි\nප නි රි ස ස ග\nප නි නි ස ග රි රි රි ග රි ප ම ග රි ස නි\nම ග ස නි\nප්රභා රන් කැළුම් දී සලා නේත්රයන්\nනිවාපන් ළඳේ චිත්ත පීඩා නොහිම්\nරශ්මි දෙවා චන්ද්රයා සේ...\nමාරම්බරී\nකෝල වී පෑ මුවේ මන්දහාසේ\nමන ලෝල වේ උන්මාද වී\nමා හදා සෑම දා පුණ්යවන්තී\nමාරම්බරී",
    "Songs": "Adarayath Muhuda Wage, Adawan Desin, Ahasa Iri Thaluna, Akikaruda Obe Sithath, Akuru Maki Na, Anathuru Angaweemak, Anna Balan Bera Handin, Anna Balan Sanda, මාරම්බරී",
    "email": "edward.jayakody@srilankasingers.com"
  },
  {
    "Name": "ෆීලික්ස් ඇන්ටන්",
    "Birth Date": "",
    "City": "බත්තරමුල්ල",
    "Biography": "",
    "Lyrics of a song": "නිලම්බරේ කැලුම් පිර් සරා සඳ වගේ මගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ නිලම්බරේ කැලුම් පිරී සරා සඳ වගේ ඔබේ හදේ සදා රැඳී ඉන්න මට සිතේ\n\nමියුරු තෙපුල් පවසා මා හද සනසනු මැනේ සිරිකත මෙන් මගෙ පැල තුල රැඳෙන්න පියබඳේ සුව සහනය මිහිර මවා එන්නෙමි ඔබ වෙතේ ඔබේ හිතට ආලෝකය වෙන්නෙමි හැම වෙලේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nමගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nඔබේ හදේ සදා රැඳී\n\nඉන්න මට සිතේ\n\nදිවිය සුමුදු මලින් පිරුණ සුව යහනක් නොවේ හිරිහැර මැද කඳුළ සුසුම ඇතිවිය හැක ලොවේ ඒ හැමටම මුහුණ දෙන්න සිතේ දිරිය ඇතේ\n\nපැමිණෙන සැප දුක එකලෙස විඳගමු ජීවිතේ\n\nනිලම්බරේ කැලුම් පිරී සරා සඳ වගේ මගේ හදේ සදා රැඳී ඉන්න ප්‍රිය ළඳේ\n\nනිලම්බරේ කැලුම් පිර් සරා සඳ වගේ\n\nඔබේ හදේ සදා රැඳී ඉන්න මට සිතේ\n\nලා ලා ලාලා ලා... ලාලා\n\nලා... ලා ලාලා\n\nලා... ලාලලා...",
    "Songs": "Aadara Priya Landune, Dedena, Dinapatha Apa, Ekama Isavuve, Hada Gee Pothe, Maa Hade, Mal Madahaase, Mal Nelala, නිලම්බරේ කැලුම් පිරී",
    "email": "felix.anton @srilankasingers.com"
  },
  {
    "Name": "ෆෙ‍්‍රඩී සිල්වා",
    "Birth Date": "6-Feb-38",
    "City": "මොරටුව",
    "Biography": "Haupe Liyanage Athukorala Morris Joseph Ranabahu, popularly as Freddie Silva (06 February 1938 – 29 October 2001), was a Sri Lankan film actor, and playback singer, who appeared from 1973 until 2002. Freddie was known for being one of the most popular Sri Lankan comedians of the 1960s, 1970s and 1980s. He appeared in over 400 films and Produced 2 films, of which 300 were screened at the celebration of fifty years in Sinhala Cinema. Silva was born Haupe Liyanage Athukorala Morris Joseph Ranabahu in Puvakaramba, Moratuwa, and was an only child. Silva's father was an overseer for the Moratuwa Urban Council and his mother was a member of Salvation Army. Growing up he was fascinated with singing and dancing. St. Sebastian's College was his Alma mater. In the 1950s Silva performed the Alanson Mendis composition \"Bar Bar Bar\" in front of Sir John Kotelawala and was warmly received. He used this opportunity to get a letter of recommendation from Kotelawala which he presented to Livy Wijemanne of Radio Ceylon to secure a job as a radio artist. Silva's first recording was \"Mottapala.\" He followed the song with \"Bar Bar Bar\" now updated with music by P. L. A. Somapala. It was a success. Subsequent efforts teamed Silva with the late Premakirthi de Alwis. Their work include comedic songs like \"Aron Mama\", \"Pankiritta\", \"Nedeyo\", \"Handa Mama\", \"Kekille Rajjuruwo\" and \"Parana Coat\" (from Lokuma Hinawa). Silva's crowning achievement is considered the tune \"Kundumani.",
    "Lyrics of a song": "පාන් කිරිත්තා තක්කිට තරිකිට උඩ පැන පැන නටතෙයි පාන් කිරිත්තී රබාන අරගෙන කරබාගෙන වයතෙයි උන්ගේ පැටවුන් වටේට ඉඳගෙන දෑතින් හඬ තලතෙයි මේවා බල බල තනි කෑදැත්තෙක් කීචි බීචි කියතෙයි\n\nපාන් කිරිත්තා තමන්ගෙ පාඩුවෙ නැටුම පටන් ගත්තේ අහල පහළ කිසිවෙකුටත් ඒකෙන් හිරිහැරයක් නැත්තේ කොහේද ඉඳ පැමිණුනු කෑදැත්තා වහලා අර අත්තේ.. උන්ගේ නැටුමට බාධා කරමින් ගීය පටන් ගත්තේ\n\nපාන් කිරිත්තා තක්කිට තරිකිට උඩ පැන පැන නටතෙයි පාන් කිරිත්තී රබාන අරගෙන කරබාගෙන වයතෙයි උන්ගේ පැටවුන් වටේට ඉඳගෙන දෑතින් හඬ තලතෙයි මේවා බල බල තනි කෑදැත්තෙක් කීචි බීචි කියතෙයි\n\nපාන් කිරිත්තා නැටුම නවත්තා කේන්තියෙන් ආවා කෑදැත්තාගේ කළු අත්තටුවෙන් අල්ලා සෙලවුවා ඊට පස්සෙ ඌ සට සට ගාලා මොන මොනවද කීවා.. ළඟට කිට්ටු වී මා ද ගොළුවතින් ඊට සවන් පෑවා\n\nඅනුන්ගේ වැඩ ගැන විවේචනය කර කර ඉන්නවට වඩා තමන් දන්න දේ හරියට කරපන් කියලා කීය හඬා\n\nඅනුන්ගේ වැඩ ගැන විවේචනය කර කර ඉන්නවට වඩා\n\nතමන් දන්න දේ හරියට කරපන් කියලා කීය හඬා",
    "Songs": "Aron Mama, පාන් කිරිත්තා, Nedeyo, Handa Mama, Kekille Rajjuruwo, Parana Coa, Kundumani",
    "email": ""
  },
  {
    "Name": "ෆැලන් ඇන්ඩ්‍රියා",
    "Birth Date": "13-Sep-95",
    "City": "කලුතර",
    "Biography": "ෆැලන් ඇන්ඩ්‍රියා ජැන්සන්, is a Sri Lankan singer and performer. She began her career in music after winning the title in Derana Dream Star season IX. She is a versatile singer of many genres. Falan Andrea was born on 13 September 1995 in Kaluthara, Sri Lanka, as the eldest child of Rex Jansen, a former police officer and Renuka Jansen, a government teacher. She has two younger sisters. Falan attended Holy Family Convent, Bambalapitiya where she mainly studied oriental music. Later she learned oriental music from Dr. Nanda Malini. She studied Human resource management after leaving high school and worked at a private company.",
    "Lyrics of a song": "මත් මධු පිරෙනා සද්දේ පල්ලා ප්‍රේම කරලා නෑ අත් අල්ලා පාරේ නින්දෙදි පෙනෙනා හීන හලාලා ආලෙට ලොල් වී හීන මැකීලා නෑනේ\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ\n\nනිතඹේ දෙනෙතේ පැටළේවී මාගේ\n\nපැටලී වෙන දේ නොදනීවී වාගේ //\n\nමා දිහා බලනා මල් සරුන් ඇස් ගසා මට නගනා සුරල් නැවතුම් නොම වේවි මා වෙත ළංවෙලා නෙත් වසා දහසක් බැමි මුදන් හිත් සොරා ගන්නම් ගී සරීන් කෙළවර නැති ප්‍රේම වේවි මංමුලා\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ.\n\nනිතඹේ දෙනෙතේ පැටළේවී මාගේ පැටලී වෙන දේ නොදනීවී වාගේ//\n\nමත් මධු පිරෙනා සද්දේ පල්ලා ප්‍රේම කරලා නෑ අත් අල්ලා පාරේ නින්දෙදී පෙනෙනා හීන හලාලා ආලෙට ලොල්වී හීන මැකීලා නෑනේ\n\nහිතේ ගුම් නාදේ - රුවේ ලංකාරේ හිත් කොනේ ඇතිදේ මාගේ නොදනීවී උන් රැවටේවී ආයේ.\n\nනිතඹේ දෙනෙතේ පැටළේ වී මාගේ පැටලී වෙන දේ නොදනීවී වාගේ //",
    "Songs": "දියණියයි ඈ, පෙම්මානේ, පැටලී, හාදු, ළමැද හොවාලා, මල්සර හීසර මානේ",
    "email": ""
  },
  {
    "Name": "ගාමිණී පතිරණ",
    "Birth Date": "",
    "City": "මොරටුව",
    "Biography": "Mr. Gamin Pathirana is one of the most experienced and talented resource persons in oriental music in Sri Lanka today.",
    "Lyrics of a song": "( ලෝකයා මැවූ දෙවි පියාණෙනි\nදෙවි පියා මැවූ පුත්‍රයාණෙනි...//)\nලොවට සැමට සෙත සදන්න\nලොවට ඉපදුණේ ජේසු තුමණි....\n\nදිළිඳු පැලක සීත රැයක බෙත්ලෙහෙම් පුරේ\nචමත්කාර තරු එළියෙන් ලොවට හෙළි කළේ \nජේසු නමින් අප මුදවන කුමරු ඉපදුනේ කුමරු ඉපදුණේ.....\n\nලෝකයා මැවූ....\n\nඅප වෙනුවෙන් දිවි පුදකළ වීරයාණෙනි \nසුමග දකින පාර කියන නියමුවාණෙනි\nපාප බිමට දහම් දෙන ජේසුතුමනි ජේසුතුමනි.....\n\nලෝකයා මැවූ....",
    "Songs": "raththaran sina, nil dase, seetha nil, obata nathido nawa, doni, supembara, ashave, sadhun sihil, ලෝකයා මැවූ",
    "email": "Gamini.Pathirana@srilankasingers.com"
  },
  {
    "Name": "ග්‍රේෂන් ආනන්ද",
    "Birth Date": "15-Mar-57",
    "City": "තංගල්ල",
    "Biography": "Bajjala Walawwe Gretien Ananda Abeykoon (15 March 1957 – 29 December 2010), also as ග්‍රේෂන් ආනන්ද or Greshan Ananda, was a Sri Lankan singer, composer, songwriter and a lyricist. Considered as the best Sinhalese film score musician to have emerged in the country since the veteran artist the Late H.R. Jothipala, Ananda sang for more than 400 films with a musical career that spanned nearly three decades. He died at the age of 52 while receiving treatments at National Hospital of Sri Lanka, Colombo",
    "Lyrics of a song": "හිම රේණු වැටෙනා සීතලේ\nනෙත ගාව රදවා ආදරේ\nසුදු සේල සුළඟේ පා කලේ\nඔබ නේද මාගේ බිසෝ\n\nරන් තෝඩු සැලෙනා රාවයේ\nසිත ගාව බැන්ඳු මාලිගේ\nරතු රෝස යහනා සෑදුවේ\nමට නේද මගෙ මල් සරෝ\n\nමදු පානයක් සේ ගෑවිලා\nයනවා ද දෙතොලේ ගෑවිලා\nමනමාලයන්ගේ චේතනා\nනොකියා ද පාලා සිනා\n\nමුතු මාලයක් සේ යාවුනේ\nඅපි ආත්ම ගණනේ පෑ සෙනේ\nමනමාලියන්ගේ චේතනා\nපවසාවි දෑසේ ලතා",
    "Songs": "Adara Seenuwa, Adari Sagari Ma Hade Mandire, Akasha Gangawe Pawee Gena, Anupama Senehe, Bale Punchi Kale Wage, Bindu Bindu Kandulu Gala, Chandana Allen Nala, Datha Dilena Bandi Walalu, Dathe Ran Muthu, හිම රේණු වැටෙනා",
    "email": ""
  },
  {
    "Name": "ගුණදාස කපුගේ",
    "Birth Date": "7-Aug-45",
    "City": "ඇල්පිටිය",
    "Biography": "Ellamulla Kapuge Gunadasa (7 August 1945–3 April 2003) popularly known as ගුණදාස කපුගේ, was a Sri Lankan singer, musician, music director and playback singer. He was well known among Sri Lankans due to the philosophical background of his music renditions and lyrics selected for his work.",
    "Lyrics of a song": "බිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.\n\nට්රැක්ටරේ යකඩ ගජසෙන්\nකුංචනාදයෙන් ඇළලුණ\nවෘක්ෂ දේවතාවුන් බිම වැටී පණ ගසයි\nමිනී මල් පිපුණු සීතල\nනිම්න භූමියේ ඇටකටු\nසතර රියන් කඩ අහිමිව\nවිලාපය නඟයි.විලාපය නඟයි.!\n\nබිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.\n\nකැලෑ මල් පිපී රතු තොල්වලින්\nකෑ ගසා ඉල්ලන ජාතියේ නිධානය\nරන් රුවන් කරඩු කොයි.\nවෑකන්ද කඩා බිම් කටු\nකම්බියෙන් බෙදා මේ රණ\nබිමේ හිස ගසා දමනා\nකඩුව බිම දමවු... කඩුව බිම දමවු...!\n\nබිම්බරක් සෙනග ගැවසුණු\nචන්ද්ර සූර්යයා ඉපදුණු\nස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ.\nයුද්දෙකට ඇවිත් රුපුසෙන්\nසත් මුහුදු මතින් ගුවනින්\nකම්බි වට කළේ මනරම් මාළිගාව කෝ.",
    "Songs": "Aan Nage Sal Aththe, Abisarikawange, Ae Mage Nelum Mala, Ahasa Usata Naga Giyata, Allata Shilpa, Allata Shilpa Singa, Amme Nube As, Andura Wetee Eai, Asunath Nasena, Atha Dilena Tharu Diha, Awado Sansare, බිම්බරක් සෙනග",
    "email": ""
  },
  {
    "Name": "එච්.ආර්. ජෝතිපාල",
    "Birth Date": "12-Feb-36",
    "City": "කොළඹ",
    "Biography": "Hettiarachchige Reginald Jothipala (12 February 1936 – 7 July 1987), popularly as එච්.ආර්. ජෝතිපාල, was a Sri Lankan playback singer in the Sinhala cinema as well as a film actor. Considered as the best playback singer in Sri Lankan film history, Jothipala lent his voice to all classes of actors ranging from Eddie Jayamanne to Ranjan Ramanayake. He also worked as an opera singer. He died in July 1987 at the age of 51 year from cardiac arrest. Jothipala was the undisputed choice in films that were made in the late sixties and through the seventies, the period during which he also began to act. Though Jothi was criticized for singing to the tunes of popular Hindi songs, particularly of Mohammed Rafi, he also sang under the batons of P.V. Nandasiri, Premasiri Khemadasa, Sarath Dassanayake and Milton Mallawarachchi. Jothipala is considered the backbone of Sri Lankan playback singing. He has voiced a wide array of actors across many decades in his era. Apart from singing, he also acted in 33 films.",
    "Lyrics of a song": "ආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nවේදනා කන්දේ ඉඳලා\nආදරේ දැක අත වනලා\nසුළඟේ පාවී සුසුම් හෙළා වී\nදුලීකා. දුලීකා. දුලීකා. දුලීකා.\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා. දුලීකා.\nදුලීකා. දුලීකා.\n\nචංචල සිතුවිල්ලේ මංගල ඕවිල්ලේ\nනැළ වී යන්නේ ඈ මෙසේ\nපෙම් මල් උයනට දෝ\nකඳුලැලි මුහුදට දෝ\n\nආදර මල් පවනේ ඈ යන මේ ගමනේ\nකොහෙදෝ යන්නේ කව්දෝ දන්නේ\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...\nදුලීකා... දුලීකා...",
    "Songs": "Aasha Ronin Pirunu, Ada Amuthuma Rayaki, Ada Eli Weela, Ada Wessanthara Raja Putha, Adanne Ai Sudu Manike, Adara Madura Athithe, ආදර මල් පවනේ, Adaraneeya Sina Obe, Adaraya Mage Sanasewa, Adaraye Baduna Dine",
    "email": ""
  },
  {
    "Name": "හෙන්රි කල්දේරා",
    "Birth Date": "19-Aug-37",
    "City": "මරදාන",
    "Biography": "හෙන්රි කල්දේරා was a Sri Lankan singer, songwriter, and musician. Caldera was born on 19 August 1937. Completely blind at the age of 14, he attended the Seeduwa Deaf and Blind School. There, Caldera studied under maestro Sunil Shantha, who conducted classes for blind students. After leaving school, Caldera continued to learn from Shantha at his house in Dehiyagatha, Ja-Ela. Caldera became a radio artist in 1968 and recorded his first hit song Thara Petia in 1972. He subsequently released a four song album in 1977. During his lifetime he released three audio cassettes and two compact discs. Most his songs were solos, and children's songs; it is said that Caldera often sang for his own children and grandchildren. In 1979, the Prime Minister of Sri Lanka, Ranasinghe Premadasa, donated a house for Caldera to live. In 1993, Caldera received a Kala Bhushana award (the second highest award granted by the state to performing artists). Student bodies at several universities and non-governmental organizations honored him in appreciation of his service to folk music.",
    "Lyrics of a song": "ඊයේ උදයේ ඔබ පොරුව මත දුටුවා හිතවතෙකු මගේ ඔබගේ ඔය සුරත දරා සිටියා....\n\nපුරුදු ලෙස මා ඔබ දකින්නට පැමින මංගල සිරියකි දුටුවේ.... සබේ කිසිවෙකු ඉබේ වත් නැත ඇසක් මා දෙස යොමා බැලූවේ කිමද මේ අරුමේ මට නොහැගේ ප්‍රිය සොන්දුරේ\n\nසොඳුර හෙට අප අළුත් ලොවකට පා නගන්නට සැරසෙන අතරේ එසේ මා දුටු එවන් සිහිනය මෙසේ අද මා හිතට වද දේ කිමද මේ අරුමේ මට නොහැඟේ ප්‍රිය සොන්දුරේ",
    "Songs": "Thara Patiya, Penuna Suwa Dasun, Midule Sudu Weli Thalaye, Eeye Udaye, Lanka Mage Lanka, Mokada Nago, Pemin Bandennai, Oba Pewa Hasarella, Sisila Sendaewe, Kana Widina Wele, Mal Natu Weni, ඊයේ උදයේ ඔබ පොරුව මත",
    "email": ""
  },
  {
    "Name": "ඉන්ද්‍රානි පෙරේරා",
    "Birth Date": "15-Feb",
    "City": "බොරැල්ල",
    "Biography": "ඉන්ද්‍රානි පෙරේරා, is a Sri Lankan singer and playback singer. Indrani along with Clarence Wijewardena and Annesley Malewana are known as \"The Original Sinhala Pop Trio\". She was born on 15 February in Borella, and is the second of three girls in the family. Her father, Abeypala Perera was a Buddhist and mother, Muriel Perera was a Christian. She has one elder sister, Mallika and one younger sister, Iranganie. Indrani studied at Presbyterian Girls School in Regent Street. She studied Kandyan Dancing in the school. Her sister Mallika has been singing since 1965 where she was the playback singer for the film Sama. She is married to James Sri Nivasan in 1979. She met him during the production of his song Ha Ha Hore Danuna, where he was the Lotus Disc producer. The couple has one daughter, Anjalie Charukeshi and one son, Pastor Nimendra Dhananjaya. Nimendra is married to Roshani. He went to St. Thomas' College. After that he studied A/L at the Royal Institute. Later in 2009, Nimendra obtained a degree in Business Studies.",
    "Lyrics of a song": "සුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසිහිනෙන් වගේ මැවිලා පෙනේ\nමාගේ හදේ මිහිරක් දැනේ\nසිහිනෙන් වගේ මැවිලා පෙනේ\nමාගේ හදේ මිහිරක් දැනේ\nආලේ ඔබේ මටනේ ප්රියේ\nආලේ ඔබේ මටනේ ප්රියේ\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nමධු මල් පිපෙන්නේ අපි දෙන්න හින්දයි\nබඹරුන් හඬන්නේ මල් හී විදින්නයි\nදෙනෙතේ රැඳෙන්නේ ඔබගේම රුවමයි\nමන මත් කරන්නේ මල් හී සරාමයි\nහිතවත් කියන්නේ ඔබ මාගේ හින්දයි\nහිතවත් කියන්නේ ඔබ මාගේ හින්දයි\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nසුදු අසු පිට නැගලා\nමංගල රථේ තියා\nබැන්දා රන් තොරණේ\nකැන්දා මා යන්නේ\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\n\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා\nඋන්මාද සිහිනෙන් ඔයා\nමල්සර දෝණි මෙමා",
    "Songs": "Adara Nangi, Adare Kiyanna Danne Na, Ahasata Sanda Lesa, Anduru Ahase, Anna Sudo Ara Paata, Ara Atha Epita Ahase, Aradana Neth Dale, Athagili Badune Ai Me Wilasin, Ha Ha Hore Danuna Danuna, සුදු අසු පිට නැගලා",
    "email": "indrani.perera@srilankasingers.com"
  },
  {
    "Name": "ඉශාක් බෙග්",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Isaq Beg is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "කෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකැදැල්ලෙ උන් කිරිල්ලී\nඅන්න ගියා ඉගිල්ලී\nකැදැල්ලෙ උන් කිරිල්ලී\nඅන්න ගියා ඉගිල්ලී\nළමෝ ලපටි උදම් වී\nඅර ගයා නටති මගුල් ගී\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\n\nකුරුළු කෙළි බලන්නේ\nකිචි බිචි ගා අඬන්නේ\nකුරුළු කෙළි බලන්නේ\nකිචි බිචි ගා අඬන්නේ\nසද්දෙට පොඩි ළමුන්නේ\nඅනේ පුංචි එකා බයයි නේ\n\nකෝටුකෑලි සොයාලා\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nකෝටුකෑලි සොයාලා\n\nපරඬැල් කොළ ගෙනල්ලා\nතාලයකට තියාලා\nපොඩි කුරුළු ගෙයක් සදාලා\nපොඩි කුරුළු ගෙයක් සදාලා",
    "Songs": "Aale Sepatha, Adariye Ruchirananeye, Ai Bambaro Pem Mala Athaharala, Anna Sudo Ara, Athithe Kathawen, Budunge Ama Darme, Dalula Prema Gase, Dan Paddei Peralei, කෝටුකෑලි සොයාලා",
    "email": "isaq.beg@srilankasingers.com"
  },
  {
    "Name": "ඉන්ද්‍රචාපා ලියනගේ",
    "Birth Date": "13-Jan-82",
    "City": "කොළඹ",
    "Biography": "ඉන්ද්‍රචාපා ලියනගේ is a Sri Lankan singer. He has completed his debut album Abinishkramanaya (renunciation), but it has not been officially released yet. Indrachapa Liyanage was born in Colombo, Sri Lanka, on January 13, 1982 and studied at Royal College, Horana up to O/L's then Ananda College Colombo. His music career started in the year 2000, with his school mate Kasun Kalhara in their own project. They released an album called Haritha Nimnaye, and it was a very successful release, and the album introduced them to a huge fan base. But in the years of 2004 and 2005, they closed down their project and went on to each make their own music, though they continued to work together on occasion.",
    "Lyrics of a song": "හේමන්ත නිද්රාවේ\nගිලෙන හැන්දෑවක\nනිසලතාවයේ මතු වෙන්නේ\nඔබෙ දෑස පත්ලේ ඇවිලෙනා\nප්රේමා ධ්යාශයයි\n\nසිහිනේ උමතු නිම්නේ\nමා හුදකලාවේ නොහෙලා\nආදරේ දෙවඟන හැම රාත්රියකම\nහැම හිමිදිරියක හැම දහවලකම\nවෙලී ගයන්න එනු මැන සුප්රානො හඬින්\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් නාද සංරචනයේ\nහැම ස්වරයකින්ම වෑහෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\n\nසඳ දිය දහරාවේ\nපෙඟෙන ලැම බෙයද\nනග්න තලාවේ මතු වෙන්නේ\nඔබේ සියුමැලි සිරුරේ උමතු ආලිංගනයයි\n\nසිහිනේ උමතු නිම්නේ\nමා හුදකලාවේ නොහෙලා\nආදරේ දෙවඟන සදහටම එකට\nඑක ආදරයක එක මිහිරියාවක\nගිලී රඟන්න එනු මැන පිලුම් මතින්\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් රංග වින්යාසයේ\nහැම රැඟුමකින්ම මැවෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\n\nරෝමාන්තික ඔපෙරාවේ\nඉසියුම් නාද සංරචනයේ\nහැම ස්වරයකින්ම වෑහෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි\nහැම රැඟුමකින්ම මැවෙන්නේ\nඔබෙ මගේ නොහිම් ප්රේමයයි",
    "Songs": "Abinishkramanaya, Adaraya Anshumathrayak, Dasin, Ginidal, Irunu Aththatu, Piyawuna Deneth Nidimathin, Sinhayo, Ulkapathayak, රෝමාන්තික ඔපෙරාවේ",
    "email": ""
  },
  {
    "Name": "ජනක වික්‍රමසිංහ",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Janaka Wickramasinghe is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "දෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nදෙතනේ ලෙලෙනා\nරන් මිනි තෝඩු දවටන්ො\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා\nදෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nසමනල මලුවෙරන් වැලි වෙහෙරේ මුදුනත සේම මට දැනෙනා\nසොබනිගෙ සෙනෙහේj\nගෙපැලට වඩනා සුබ හෝරාව ලං වෙනවා\nයමු රජුනෙ පමා වෙනවා\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා\nගොම මැටි ඇති රැැ\nතනිකඩ ගෙපැලේ\nසිරිලිය සේම ඇැ හිදුවා\nගමිමානෙ පුරා\nකල එලි කරවා\nමම හද්දා මගුල් කනවා\nමෙි පිං උබට පිහිටනවා\nදෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා\nදෙතනේ ලෙලෙනා\nරන් මිනි තෝඩු දවටන්ො\nහදයො හැමදා නුබ පන වාගෙ රැක ගන්නා",
    "Songs": "Api Katha Nokara Imu Sina Novi Imu Tika Dawasak, Balikaviyan Taksala Doren Issilila Horen Balavi, Kohe Ho Oba Hindinam Sathutin, Ranchu Gasena Kolu Rane Sindu Kiyana, Saumya Wanthiye Sitha Sanasana, දෙවිරේ දිලෙනා සොද මුතු මාල පලදන්නා",
    "email": "Janaka.Wickramasinghe@srilankasingers.com"
  },
  {
    "Name": "ජයතිස්ස හෙට්ටිආරච්චි",
    "Birth Date": "",
    "City": "හෝමාගම",
    "Biography": "",
    "Lyrics of a song": "මහමෙව්නා උයනේ සිරි මා බෝ සෙවණේ\nසල් මල් පෙත්තක් දුටුවා හේවිසි හඬ මැද්දේ\nඒ ඔබදෝ මෑණියනේ //\n\nඔබ මා අත හැර ලොවින් නික්ම ගිය\nදවස තාම මතකයි//\nපියාණනේ ඔබ හෙළ විරුවන්\nගැන කියූ අයුරු මතකයි.\n\nලෝවාමහාපායේ පෙරළුණු ගල් අතරේ\nනිදිකුම්බා මල් පොකුරක් \nහිනැහේ මා දකිමින්\nඒ ඔබදෝ පියාණනේ //\n\nදින දින මා සෙවණේ පණ ගන්වා\nඋණුසුම මට ගෙනදී//\nකුසගිනි නොතකා\nමා කුස පුරවා හැදූ නිබඳ පණ දී\n\nඒ මල් පෙති අතරේ සුවඳ දැනෙන අරුමේ\nතවමත් මිනිසුන් අතරේ රැඳුනා මා ඔබ මෙන් \nජීවිතේ රැඳී ඉමි \n\nඒ ඔබදෝ මෑණියනේ \nඒ ඔබදෝ පියාණනේ//",
    "Songs": "Sawan sangala, sada ha kumudui, mini muthu ran, Deneth thula, Mul pita perala, Neela ahase, Gajamuth mathukota, Sadanathimata, මහමෙව්නා උයනේ",
    "email": "Jayathissa .Hettiarachi@srilankasingers.com"
  },
  {
    "Name": "මිල්ටන් පෙරේරා",
    "Birth Date": "5-May-38",
    "City": "කොළඹ",
    "Biography": "Jayasinghe Arachchige මිල්ටන් පෙරේරා, popularly known as Milton Perera, was a singer, composer and playback singer of Sri Lankan cinema. One of the most respected artists in Sri Lanka, Milton Perera rendered his voice to diverse array of artists as a playback singer for many films in a career spanned for more than three decades. He was the leading playback singer of Sri Lankan cinema during the 1960s and 1970s. Milton was born on May 5, 1938 the son of J. A. Edwin Perera, also known as Tabla Podi Appuhamy, an accomplished tabla player. His mother was Prema Wickramarachchi. Inspired by his father, Milton became proficient on the Tabla at a young age. Perera was a skinny, innocent young man of Podi Appuhamy. They lived in Sangamitta Mawata, Kotahena, known as Green Street. His father was a proud owner of series of small houses in a land along the street. Father and Milton lived in one of those houses. All other houses were rented. The first house of Podi Appuhamay was rented and that man had a beautiful daughter, named Hemalatha. She was so beautiful, sexy looking, and studied at the nearby school at the Green Street, known as Kotahena Madhya Maha Vidyalaya. Milton has been trying to express his love to Mala Hemalatha. She was popularly known as Mala. He sent sent love letters to Mala through other students at the Schools and they were in love in no time. So Milton sang, 'Aranna Adare Mala', dedicated to his girl friend. They married and had Priyankara as only child. Later Mala left Milton and lived with a Muslim man. Milton was later married to Kalyani Perera, who had been an actress. Their wedding was celebrated on 26 September 1969. They had three sons: Chalaka Chamupathi, Arosha Asanga and Pamoda Piyushan. Milton died on October 24, 1991. In memory of Milton, Priyankara Perera and Chalaka Chamupathi Perera continue to perform J.A Milton Perera's songs. Eldest son Priyankara Perera is married to renowned actress Dilhani Ekanayake and they have one son Dilmin Perera. His second son Chalaka Chamupathi Perera is married to Padmi Ranasinghe, and they have one daughter Anjana Dasuni Perera and one son Chamath Chamupathi Perera",
    "Lyrics of a song": "මගෙ දෑසෙ කඳුළු තව දෑසක\nසතුටු කඳුළු වෙයි\nඅද ඇත ඇය මට හිමි නැති\nමගුල් පෝරුවේ //\nමට ඇය දුන් වේදනා\nඇගෙ දෑසින් තේරුණා //\nමිලින කළේ ඇයි මැණිකේ\nපරම චේතනා\nපරම චේතනා\nමගෙ දෑසෙ කඳුළු තව දෑසක...\nනොඉඳුල් පෙම මා පැතූ\nඔබ කළ හැටි අන් සතූ //\nමට දුන් දුක නොදෙනු මැනවි\nඔහුට මින් මතූ\nඔහුට මින් මතූ\nමගෙ දෑසෙ කඳුළු තව දෑසක... //",
    "Songs": "Adaraye Saman Wale, Adare Ran Dewole, Agada Sagaraye, Ahanna Mage Hoda Punchi Puthe, Ahasa Gelawee, Ai Handanne Daruwo Wenuwen, Alehi Bande, Amapaniye Jeewithaloke, Api Santhosen Inne, Aradanawak Ewami, Aruna Udaye, Asa Randuna Randuna Thanwala, මගෙ දෑසෙ කඳුළු තව දෑසක",
    "email": ""
  },
  {
    "Name": "ජගත් වික්‍රමසිංහ",
    "Birth Date": "10-Apr-66",
    "City": "කොළඹ",
    "Biography": "ජගත් වික්‍රමසිංහ is a Sri Lankan musician. He is the current Chairman of Sri Lanka Broadcasting Corporation. Wickramasinghe pursued a career as an engineer, but later decided to become a musician like his parents. His career took off after his songs were played on stations owned by the Sri Lanka Broadcasting Corporation. He is one of the first three judges on Sirasa Superstar for season 1 to 3. He was born on 10 April 1966 in Kolonnawa. His father L.K Jinadasa Wickramasinghe and mother Aryawathi Chandralatha both were music teachers. His parents were largely involved with many of musical programs in Sri Lanka. Therefore, he used to practice sing and play whatever his parents did during their rehearsals. It is during those days his potential of singing and playing instruments were discovered by his parents. In 1972, he was studying at Ashoka Kanishta Vidyalaya, Maradana and after passing the grade 5 scholarship, he attended Ananda College and studied there up to grade 10. Then he had to study at Anuradhapura Central College as his parents had got an unexpected transfer to Anuradapura. In the school, he was engineering oriented and studied mathematics for G.C.E A/Ls. Later on he followed a civil engineering course and specialized in building construction. Wickramasinghe fulfilled his music knowledge following Sangeeth Visharada Part 2 and Diploma in music (vocal), Bathkande institute of music, Lucknow, India. As well, he did Prathama Examination Music (Instrumental) Thabla, at Bathkande institute of music. He was student of western music Trinity College of London. In the year 2000, he got married with Gayani Kohona and is the father of one son and two daughters: Thidas, Sirini Suhansa and Asini Ashcharya.",
    "Lyrics of a song": "ඔබත් මමත් හිඳිනා මේ ලොව තුළ\nකඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nඅවිගැටෙනා බිම් තලය පුරා\nයුධයේ ගිණිදැල් පැතිරෙන්නේ\nදුක් විළාපයයි මිනිසුන්නේ යුධ වැදී කුමට මේ එකම පොළොව මත\nඑකම ලෙයින් අප සැඳුනේ\nඑකම සුසුම් ළය රැඳුනේ\nඔබත් මමත් හිඳිනා මේ ලොව තුළ\nකඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nරකිමු මිනිස්කම් භේද නොවී\nකුළගොත් උස් මිටි කම් දුරලා\nසතුරු සිතුම් අත් හැරලා\nකුසගින්න අවිදරා දැවේ ළපටි සිත්\nකඳුළු පිසිමු දරුවන්නේ\nසතුට බෙදමු මිහිමඩලේ\nඔබත් මමත් හිඳිනා මේ ලොව\nතුළ කඳුල සුසුම කුමකටදෝ\nඔබත් මමත් අප දෙදෙනෙකු ලෙස නොව එකකු ලෙසින් සිතමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු\nහෙටින් උදාවන ලෝකය සැමටම\nසුවදායක කරමු",
    "Songs": "Aadaraye Sandun Wane, Adara Pudasuna, Adaraya Wapuranna, Adare Obagen - Yan Yan Pavi Pavi-Laila Laila Lai, Ahasata Wada Pem Kala Nisa, Amawaka Sithuwlla, Amma, Andra Bawane, Andure Marukathare, Andure Minigedi, Apith Ekka Tharaha Na, Asata Asa Hamuwana Da, Asiniya Mal Matha Sitha Rendu, ඔබත් මමත් හිඳිනා",
    "email": ""
  },
  {
    "Name": "කමල් අද්දරආරච්චි",
    "Birth Date": "5-Feb-62",
    "City": "කොළඹ",
    "Biography": "කමල් අද්දරආරච්චි (born on 5 February 1962) is a Sri Lankan film and teledrama actor, singer and presenter. He made his debut as an actor in Gamini Fonseka's 1981 film Sagarayak Meda, whilst he was a still a student at school. Since the late 1970s, he has appeared in a variety of roles in many films and teledramas. Addararachchi, has acted in over 40 films, 20 teledramas and 6 stage plays, and won the Sarasaviya Best Actor Award for his role of Sobana in Agnidahaya in 2002. He also made a mark as a singer in 1993 with \"Unmadawoo,\" a duet with Damayanthi Jayasooriya, which featured in the film Saptha Kanya. He was also the host of the first three seasons of Sirasa Superstar, a reality show, and first season of Hiru Mega Stars. He also had a great fall at the BMICH while singing “Mal Pibidena Eka Wasantha Samayaka” by H. R Jothipala. He completed education from Wesley College, Colombo. He showed an initial interest in artistic work, and this prompted him to do music, sinhala literature, Kandyan Dancing and debating, all at the same time. He even worked as the secretary of the 'Sinhala Literary Society' whilst at school. He is married to Anurani Addararachchi and has two sons. He was an English teacher as well.",
    "Lyrics of a song": "උන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\n\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nරල පෙල කැලඹේ හසගන විලසේ\nලවනත සුදු මුදු පහස ලැබේදෝ\nඔබ හදවත මා හඳුනාගත් සේ\nමා හදවත ඔබ හැඳින ගනීදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nකිඳුරු කොදෙව්වේ කසුන් කුමාරිකාවී\nසයුරු තෙරෙන් සැඟවී ආවාදෝ\nචන්ඩ මාරුතේ ඉන්ද්රකීලයක් වගේ\nනොසැලී ඉන්නට වරම් ලැබේදෝ\n\nසංසාරයේ සුභ ප්රාර්ථනා\nඉඳුනිල් දෙනයන සටහන් වේ\nඋන්මාද වූ ප්රේමාදරේ\nසමනල වසන්ත යෞවනයේ\n\nඉඳුනිල් දෙනයන සටහන් වේ\nසමනල වසන්ත යෞවනයේ\nඉඳුනිල් දෙනයන සටහන් වේ\nහා-හා-හහා-හා-හහා-හා\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්\nහ්ම්-හ්ම්-හ්ම්ම්ම්-හ්ම්-හ්ම්",
    "Songs": "Bindena Reyandura, Dewu Landun Dahasak, Eka Ladki, Gasal Gee, Mal Yahanata, Minisune - X Mas, Neela Dasa Pura, Roja-Tamil, Thun Sitha Dahan Gatha Wena, Unmaada Wu Premadare-Saptha Kanya, Wessa Wage Aayeth",
    "email": ""
  },
  {
    "Name": "කරුණාරත්න දිවුල්ගනේ",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Karunarathna Divulgane is a singer and a classical musician in Sri Lanka. He served as the Governor of the North Central Province of Sri Lanka between 13 November 2006 and 27 January 2015. Divulgane attended the reopening of a broadcast tower with many other dignitaries in 2011.",
    "Lyrics of a song": "මා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nතොරතුරු විමසනවා ආගිය තැන් පවසනවා\nතොරතුරු විමසනවා ආගිය තැන් පවසනවා\nසංසාරේ හුරු පුරුදුයි කියලා කියනවා\nකියලා කියනවා\nමා ඔබත් එක්ක දිගට කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nරස රහස් කියනවා විටකදී ඉඟිත් කරනවා\nරස රහස් කියනවා විටකදී ඉඟිත් කරනවා\nඇවිදින්නට තනිවෙන්නට යමුද අහනවා\nයමුද අහනවා\nසඳ හිරුත් එක්ක හොරෙන් කතාවක්\nතරු මාත් එක්ක ප්රේම කතාවක්\nවරදක් නැහැ කියනා\nකවුරුත් නොම එයි සිතෙනා\nවරදක් නැහැ කියනා\nකවුරුත් නොම එයි සිතෙනා\nසිපගන්නට ලංවෙන්නට එන්න අහනවා\nඑන්න අහනවා\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්\nමා ඔබත් එක්ක සුහද කතාවක්\nඔබේ ඇසුත් එක්ක ප්රේම කතාවක්",
    "Songs": "Adara Dedunna Payala, Adaraya Sundara Waradaki, Ai Kandulu Bindu Manamalige, Ajaneeya Scootara, Andara Yaye Waw Thawalle, Anjanam Deviye, Ara Modu Wela, As Deka Diha Balana, Asata Asuwana Maime, Atheethaya Sihinayak Pamanai, මා ඔබත් එක්ක සුහද කතාවක්",
    "email": "Karunarathna_Divulgane@srilankasingers.com"
  },
  {
    "Name": "කසුන් කල්හාර ජයවර්ධන",
    "Birth Date": "3-Nov-81",
    "City": "රාජගිරිය",
    "Biography": "කසුන් කල්හාර ජයවර්ධන, known professionally as Kasun Kalhara, is a Sri Lankan singer, musician, vocal coach and record producer. During his musical career, Kasun has released three albums, Haritha Nimnaye, Radical Premaya and Romantic Opera. He is one of the biggest and best-selling music artists in Sri Lanka. Kasun was born in Rajagiriya, Sri Lanka on 3 November 1981. His mother, Malani Bulathsinhala, was a veteran vocalist and his father H. M. Jayawardena was a renowned composer. He had a younger sister, Nirmani Chaya who died in 1991 at the age of three. Kalhara's music career started along with Indrachapa Liyanage and his schoolmates from Ananda College in the year 2000. His mother was highly supportive of his musical career. Once a newspaper interviewer asked her \"what is the most memorable day in your life?\" and she answered \"the day Maestro Premasiri Khemadasa hugged and wished my son Kasun Kalhara, following his first musical concert (Waves of Introspection). That warm hug from Maestro Kemadasa guaranteed that Kasun had a genuine talent and a clear future\". Kasun has held a number of solo concerts, collaborating with other artists such as \"Kasun Kalhara: Live in Concert\", \"Kasun Kalhara Unforgettable Live in Concert\", \"The Black Red White Concert\", \"Kasun Kalhara in Culture Shock\", \"4U: Live in Concert\" and \"Love U: Live in Concert\". Kasun Kalhara performed in Culture Shock (2013) and Kasun Kalhara in LoveU (2016/2017) Those three concerts became one of the most attended musical shows in history of Sri Lanka with over 5,000 fans gathering around at the Nelum Pokuna Mahinda Rajapaksa Theatre for all the three events.",
    "Lyrics of a song": "ආදර මල් වල පාට කියන්නද\nඒ වගෙ ලස්සන තව නෑ\nඒ වගෙ ලස්සන තව නෑ\nමීදුම් පිණි පොද දෑස වසන් කළ\nසමනල් සිහිනය පිපුනා\nසමනල් සිහිනය පිපුනා\nදේදුණු රේඛා දෑසම තවරා\nතවමත් මල් සිට බලා සිටිනවා\nමීදුම තවරා සුළඟට\nඈතක සගවා තුන් සිත\nදෑස හොරෙන් ඈත සොයනව\nඅඳුර මැදින් එන්න සදලියේ\nදේදුණු සායම දෑසම බොද කර\nමාලති යායක හැගිලා\nමාලති යායක හැගිලා\nසීතල හිම කඳු යායක පියමැන\nදෙව්ලිය සිහිනෙක වැඩියා\nදෙව්ලිය සිහිනෙක වැඩියා",
    "Songs": "Achariya Rawata, ආදර මල් වල, Adare Sithum, Adarema Geethayak, Ahasin Eha, Alaye Gatha, Ananthayata Yana Para Dige, Andure Madiyame, Appachchi, Arabumama Kandulak Wela",
    "email": ""
  },
  {
    "Name": "කීර්ති පැස්කුවල්",
    "Birth Date": "29-Jan-56",
    "City": "මහනුවර",
    "Biography": "Pasquel Wasam Ananda Keerthirathna (born on January 29, 1956), known professionally as Keerthi Pasquel is a veteran pop musician and composer from Kandy, Sri Lanka. He has been performing for more than three decades and has won a number of awards. Keerthi is a judge on the National reality show ‘Derana Dream Star’ and sets the record as the only judge in Sri Lanka to sit for 10 consecutive seasons in a reality show beginning from 2008 until today. He has been active in music education and in social welfare. Keerthi married Muditha Fernando in 1978 and had a daughter and son. His eldest daughter, Dinesha Pasquel is now married domiciled in the UK with her husband and son. His son, Kasun Pasquel works for Expolanka Group. Kasun is married to Chethana Ranasinghe who is also blooming in the music industry. In 1994 his first marriage ended and he married Chandana Mudalige in 1995. He has two daughters from Chandana – Charuni Pasquel who is a law graduate and Natalia Pasquel -  a business management graduate. Keerthi feels he is the luckiest father on earth because of the unity and caring attitudes of his four children. In 1996 he received an international award from the World Science Council in Japan, where he competed with musicians from 13 countries.",
    "Lyrics of a song": "සඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nමන්දිරේ කවුළුවෙන් මං මේ උදේ\nනෙත් පුරා බලා ඉඳින්නේ රූ ඔබේ\nමන්දිරේ කවුළුවෙන් මං මේ උදේ\nනෙත් පුරා බලා ඉඳින්නේ රූ ඔබේ\nඔබට රහසේ ප්රේමාදරෙන්\nපුරවන්කෝ රත්තරං\nඔබට රහසේ ප්රේමාදරෙන්\nපුරවන්කෝ රත්තරං\nසඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nවෑහෙනා මුත් ඒ මනෝ ලෝ චේතනා\nපෙම් කරන්නත් නෑ ප්රියේ පිං වාසනා\nවෑහෙනා මුත් ඒ මනෝ ලෝ චේතනා\nපෙම් කරන්නත් නෑ ප්රියේ පිං වාසනා\nපාළු රාත්රියේ සඳ රේණුවෙන්\nපුරවන්කෝ රත්තරං\nපාළු රාත්රියේ සඳ රේණුවෙන්\nපුරවන්කෝ රත්තරං\nසඳලතා පායලා\nමල් වැට ගාව ඉරිමා උදේ\nසුදු මල් තාරුකා\nඇගෙ පරිවාර තරුවැල් වගේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nසඳුට උපමා ඔබයි ළඳුනේ\nමටයි හැඟුනේ ආදරේ\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා ලා\nලා ල ලා",
    "Songs": "Adare Sitha Sanasana, Andura Geta Eai, Aradhana, Aya Dompe Aya, Bolanda Katha, Bolanda Katha Kiyala, Dangapana Samanallu, Dasa Masa Oba Ma - Amma, Dase Aradana, Dayawa Pa, සඳලතා පායලා",
    "email": "Keerthi_Pasquel@srilankasingers.com"
  },
  {
    "Name": "කිත්සිරි ජයසේකර",
    "Birth Date": "",
    "City": "බත්තරමුල්ල",
    "Biography": "",
    "Lyrics of a song": "ඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nමහා දුකකී පෙමින් පතනා පැතුම් ගංඟා\nමහා දුකකී පෙමින් පතනා පැතුම් ගංඟා\nසමාවක් නෑ ලොවේ වරදක් නැතත් හන්ඟා\nසැපේ උල්පත් ඇරේ ප්රේමේ නමින්\nඅවසානේ ආවසානේ\nසැපේ උල්පත් ඇරේ ප්රේමේ නමින්\nඅවසානේ ආවසානේ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nදැනේ පිටුපෑ ලෙසින් පරසුන් හැන්ඟුම් සන්කා\nදැනේ පිටුපෑ ලෙසින් පරසුන් හැන්ඟුම් සන්කා\nපිරේ ලතැවුල් ලයේ පුරනා පෙරුම් රන්ඳා\nපිරේ රස හසුන ඔබගෙන් මා ලැබූ\nඅවසානේ අවසානේ\nපිරේ රස හසුන ඔබගෙන් මා ලැබූ\nඅවසානේ අවසානේ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ\nභවේ ආලෝකේ මට පෑව නෙත් කැලුම්\nපායා ඒ පායා ඒ\nඔබේ කොපුලේ අනාතවු සෝ සුසුම්\nපාවී ඒ පාවී ඒ",
    "Songs": "Ameesha, Amma, Delwena Pahan, Gini Malak, Ketima Keti Kathawak, Mage Mandree Nam Bisoge, ඔබේ කොපුලේ අනාතවු, Oya Es Piyana ",
    "email": "kithsiri.jayasekera@srilankasingers.com"
  },
  {
    "Name": "ක්‍රිශාන්ත එරන්දක",
    "Birth Date": "",
    "City": "අනුරාධපුර",
    "Biography": "Krishantha Erandaka is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "වී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ දෙතොලේ මොලකැටි බව\nනාඳුනන ලෙසින්\nනා දළු වැඩි සුමුදු වෙතැයි\nකියමි ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ සොඳුරු මුව මඩලේ\nකැළුම් මම දුටිම්\nපුර පස හඳ ඔබ පරදයි\nකියමි ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nඔබේ ආදර නිමල දියේ\nසිහිලස ලද මං\nතිබහට බොර වු වතුරක්\nබොන්න ද කෙලෙසින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්\nවී පැදුරෙන් ඉගිලී යන කුරුල්ලෙකු ලෙසින්\nඉගිල යන්න බෑ මට මියුලැසිය ඔබ ලඟින්",
    "Songs": "Ahankara Stree, Ahaseth Netha, Api Wenama Handamu, Awuwe Muthu Eta, Bohoma Hanika, Ege Namin, Hadawathak, වී පැදුරෙන් ඉගිලී යන",
    "email": "krishantha.erandaka@srilankasingers.com"
  },
  {
    "Name": "කුමාරසිරි පතිරණ",
    "Birth Date": "",
    "City": "නුගේගොඩ",
    "Biography": "Kumarasiri Pathirana is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "එදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබට මෙන් ආදරෙයි\nනිසලවි නෙත්පියා\nගියත් සැගවී ඔයා\nනෙතේ කදුලැල් තියා\nඅදත් මතකයි ඔයා\nනොයෙනා ගමන් ගියේ නම්\nඔබ දුන්නු දුක් සුසුම්\nමේ හිතට ආයේ නම්\nවිදින්න බැහැ රත්තරං\nපණ සේ රකින්නම්\nපියුමක් ලෙසින් මං\nකුලුදුල් සෙනෙහේ තරම්\nදෙයක් තව නෑ උතුම්\nඑදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබ නොමැති ලෝකයේ\nහිටියේ මම පාළුවේ\nඇවිත් සිත සැනසුවේ\nඇය තමයි ඔබ වගේ\nපැතුම් බිදිලා ගිහින්\nවින්ද දුක් මා සිතින්\nනිමා කර ඒ සුසුම්\nලන්වූ ඇයයි උතුම්\nඑදා පෙම් බැන්ද ඔබමයි\nතව ඉන්නේ මා ලයේ\nමෙදා පෙම් බැන්ද ඇයටත්\nඔබට මෙන් ආදරෙයි\nනිසලවි නෙත්පියා\nගියත් සැගවී ඔයා\nනෙතේ කදුලැල් තියා\nඅදත් මතකයි ඔයා",
    "Songs": "Hade gini, hada maage ridum denawa, guru paare, desithaka senehasa, amme kiyannam, එදා පෙම් බැන්ද ඔබමයි",
    "email": "kumarasiri.pathirana@srilankasingers.com"
  },
  {
    "Name": "කුමාරි මුණසිංහ",
    "Birth Date": "",
    "City": "කඩවත",
    "Biography": "",
    "Lyrics of a song": "අහස පොලොව උහුලනවලු\n\nඉරත් හඳත් මුහු වෙනවලු පටන් ගත්තු දාට ආදරේ... සිනහ පඳුරෙ කඳුළු සුසුම් පොකුර ආදරේ නෙතට පිරිත් පැන් ඉහිනා සුතුර ආදරේ කඳුළු වදුලෙ සිනහ පොට්ටු නටන ආදරේ සිතට තට්ටු කරන සිහින කෙවිට ආදරේ...\n\nආදරේ.... ආදරේ...\n\nආදරේ.... ආදරේ...\n\nඅවේලාවේ හීන මවන හීන මානෙ දෙපළු කරන මුරණ්ඩුකම දුන්නු ආදරේ...\n\nරෑ තුන් යම\n\nරෑ තුන් යම පාළු මකන නිවම හිනැහෙන මුමුණන තුරුණු සිරිත සොඳුරු ආදරේත්‍ව\n\nසාගරේට කඳුළු හදන මහ සුළඟට සුසුම් බෙදන විනයක් නැති දැහැන ආද.....\n\nහිතෙන් හිතට...\n\nහිතෙන් හිතට ඉව අල්ලන නෙතින් නෙතට මාරු කෙරෙන දාර්ශනික දහම ආදරේ..\n\nඅහස පොලොව උහුලනවලු...\n\nආදරේ... ආදරේ..////",
    "Songs": "අහස පොලොව උහුලනවලු",
    "email": "kumari.munasinghe@srilankasingers.com"
  },
  {
    "Name": "ලහිරු පෙරේරා",
    "Birth Date": "18-Apr-84",
    "City": "උඩුගම්පොළ",
    "Biography": "ලහිරු පෙරේරා born 18 April 1984 also known by his stage name La Signore is a Sri Lankan singer, musician and music producer who came to limelight with his 2008 breakthrough Hit single \"Rambari\". He was born and raised in Kehelbaddara, Udugampola. His latest ventures include a perfume line named La Signore The Fragrance perfumes and colognes.",
    "Lyrics of a song": "සුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nගං දෑල නං නපුරුයි වගේ\nනාඩන් නගේ මං දැන් ළඟින් ඉන්නේ\nඅයියා මගේ කවදත් හොඳයි\nසැමදා ළඟින් ඉන්නේ මගේ පණ සේ\nපුන් පෝදා සෑ මළුවේ\nමට පිටුපා ඔබ උන්නේ\nසිටියා බලා ඔබ හිනැහෙයි කියා\nදුටුවේ නෑ පියමං කලා\nසඳ එළියේම නොපෙනී ගියා\nසුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nඅප්පච්චි ළඟ උන්නා\nනැද්දෝ අයියා දුටුවේ\nහිනැහෙමි කියා මා සිතුවත් හොරෙන්\nදුක ඉවසාන පිටුපා ගියා\nඒ දුක් ගින්න හදෙහී දරා\nසුදු ගවුමෙ ඇයි මඩ ගෑවුනේ\nදැන්නම් ඉතින් ගෙදරින් බනී නංගෝ\nබොර ගං දියේ මල් යයි ඇදී\nඅයියේ මගේ ගන්නයි ගියේ මා\nගං දෑල නං නපුරුයි වගේ\nනාඩන් නගේ මං දැන් ළඟින් ඉන්නේ\nඅයියා මගේ කවදත් හොඳයි\nසැමදා ළඟින් ඉන්නේ මගේ පණ සේ",
    "Songs": "Manbandu Hadarandu, Rambari, සුදු ගවුමෙ ඇයි, Labandiye, Paaren, Rathu Ratakaju, Desin Pe, Mottu",
    "email": ""
  },
  {
    "Name": "ලක්ෂ්මන් හේවාවිතාරණ",
    "Birth Date": "",
    "City": "හෝමාගම",
    "Biography": "",
    "Lyrics of a song": "මං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nහිස තියාන මා ළය මඩළ පුරා\nඋණු කඳුළුවලින් නම් තෙමන්න එපා\nමගෙ ලයේ කඳුළු ඇහැරෙන හින්දා\nදැන් හිනාවෙන්න මා දිහා බලා\nදැන් හිනාවෙන්න මා දිහා බලා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ\nඑක කඳුළක සීතල වුණත් එදා\nඅපි දෙකට බෙදාගෙන විඳ ගත්තා\nඒ සීතල යළි නුඹ ළඟ තියලා\nරත්තරනේ මං යන්නෑ කිසිදා\nරත්තරනේ මං යන්නෑ කිසිදා\nමං අහන්නෙනම් නෑ රත්තරනේ\nදුක දරාගත්තේ කොහොමද කියලා\nමට දුරින් උන්නු කාලෙදි දැනුණා\nමං මට විතරක් අයිති නෑ කියා\nමං අහන්නෙනම් නෑ රත්තරනේ",
    "Songs": "Akeekaru Hitha, Api Ape We, Bithu Sithuwam, Gam Dorakada, Dakinna Amme, මං අහන්නෙනම් නෑ රත්තරනේ",
    "email": "lakshman.hewawitharana@srilankasingers.com"
  },
  {
    "Name": "ලක්ෂ්මන් විජේසේකර",
    "Birth Date": "",
    "City": "ගල්කිස්ස",
    "Biography": "Lakshman Wijesekarais one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "ඇති දේ ඇති සැටියෙන් ලොව දකින මිනිස්සූ ලද දේ සිත සතුටින් විඳ වෙසෙන මිනිස්සූ පොළවේ මිහි සයනේ ගොඩ නැගූ මිනිස්සූ කරුමේ කිම වද වෙන හිරු සදිසි මිනිස්සූ\n\nපොළවේ බිම අහසේ ඉම බෙදන ලෝකයේ දහමේ ගුණ පඉරු තුල නිදන යාමයේ ඉඳ හිටි සපැමිණ සිත් සතන් සැහැස්සූ කරුමේ කිම වඳවෙන මල් සදිසි මිනිස්සු\n\nඉතිරී ගිය ඉසුරින් නෙතු වැසුනු කාලයේ දිවියේ දුක විඳිනා දන නොදුටු ලෝකයේ සෙත් කවි සේ ලඟ සිට සිත් සතන් සැනැස්සූ කරුමේ කිම වඳවෙන සඳු සදිසි මිනිස්සූ.. කරුමේ කිම වඳවෙන හිරු සදිසි මිනිස්සූ.. කරුමේ කිම වඳවෙන මල් සදිසි මිනිස්සු..",
    "Songs": "Ai Tharahin, ඇති දේ ඇති සැටියෙන් ලොව දකින මිනිස්සූ, Bala Lamawarune, Balanna Ara, Dalwu Pahan, Dalwu Pahan - Reka Tele, Daranna Beri, Datha Depa Lana Gigiri Sarin",
    "email": "lakshman.wijesekara@srilankasingers.com"
  },
  {
    "Name": "ලලනි සෝමසිරි",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Statting her career from Lama Pitiya Since 1967 todate SLBC artist in'Sarala Gee' ,'Viridu' and 'Noorthi Gee'",
    "Lyrics of a song": "මේ අපේ මාතෘ භූමියයි\n\nනිදහසේ ස්වර්ග රාජ්‍යයයි.\n\nසම්බුදු සරණින් බැබළන ලංකා ලංකා සදහම් සරණින් සුපතල ලංකා - ලංකා මඟ සඟ රුවණින් රැක දුන් ලංකා - ලංකා ඉපදුන පින් කෙත සිරි ලංකා - ලංකා\n\nදෙදහස් වසරක උරුමය ලංකා - ලංකා නිදහස් මත යළි මතු කල ලංකා රන් කෙත සිරියෙන් දුදුළන ලංකා ලංකා යසෝ උදානය වේ සිරි ලංකා - ලංකා\n\nපිත් සුවඳින් ලොව මත් කල ලංකා - ලංකා පිතු සුවඳේ සුළඟත් සිරි ලංකා මා දිවියේ අරමුණ ඔබ ලංකා රත්න දීපයයි උදාර ලංකා - ලංකා",
    "Songs": "Obe Ruu Siri, Makaa Kaluwara, Sasara Magaka, Monara Kikiliye, මේ අපේ මාතෘ භූමියයි",
    "email": "lalan.somasri @srilankasingers.com"
  },
  {
    "Name": "ලලිත් පොන්නම්පෙරුම",
    "Birth Date": "15th September",
    "City": "බොරලැස්ගමුව",
    "Biography": "Lalith Ponnaumperuma is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "අහිමි කලත් ලොව\nමට පෙම් බැදි ඔබ\nනොනිමි සෙනෙහසය\nබැමි තනවා\nඅහිංසකයි ඔබ කුමක් කරන්නද\nතනිවෙන්නම් කදුලැලි සගවා\nතනිවෙන්නම් කදුලැලි සගවා\nශෝකතැවුල් සන්තාප නොවෙන්නයි\nකුළුදුල් සෙනෙහස විවර කලේ\nදහසක් පැතුමන් හද පුරවාගෙන\nමෙයටද අප ආදරය කලේ\nහුදකලාව මා සිටි බව දැනගෙන\nඅනියත යැයි ලොව පවසාවී\nමා මල දවසේ මගේ සොහොන් කොත\nපිවිතුරු සෙනෙහස පවසාවී",
    "Songs": "අහිමි කලත් ලොව, Aisuna Githika, Dinaka api hamu una, Kadulin Nima una, Kadulu Aranaka, Naige Soduru gee",
    "email": "Lalith_ponnamperuma@srilankasingers.com"
  },
  {
    "Name": "ලතා වල්පොල",
    "Birth Date": "11-Nov-34",
    "City": "ගල්කිස්ස",
    "Biography": "Walpola was born on 11 November 1934 in Mt Lavinia Colombo, to Joseph Fernando and Elizabeth Muriel. She was one of five children. Her mother, who was a teacher encouraged her daughter to become a vocal artist. Walpola received her primary education at St.,Anthony College in Dehiwala-Mount Lavinia, wherein she led the church choir. She married Dharmadasa Walpola in 1959, later becoming known as Latha Walpola. A ceremonial wedding was held at Siri Kotha, Kollupitiya with a large gathering of guests and artists. The local police had to deploy extra men to control the massive crowd gathered outside Siri Kotha. The couple have three sons and a daughter. In the 1960s and early part of the 1970s, the couple became very popular. Latha Walpola just was 12 years old when she was introduced to the country by Radio Ceylon as a member of Radio Ceylon's Choir in 1946. C.A. Fonseka, a family friend and radio, dramatist, brought her to Radio Ceylon to perform in his Sarala Gee programme with his son C.D. Fonseka. In 1947 Walpola sang her first solo song, \"Kandulu Denethe Vehena\", with lyrics by Sarath Wimalaweera and music composed by Vincent de Alwis, the resident violinist at Radio Ceylon. She then began to sing under the direction of Mohammed Gauss, P.L.A.Somapala and B.S.Perera, with these famous musicians incorporating her high-pitched tone into their musical creations. By 1950 she was a well known female singer in the country, covering the songs \"Sukomala Banda Lelawa\", \"Dunhinda Helena\" and \"Diyaluma Helena\", originally sung by Chitra Somapala. Walpola has recorded for both the Columbia and HMV record labels. The song \"Malbara Himidiriye Pipune Esala Araliya Mala\", sung with C.T. Fernando, is one of her most popular songs.Her most popular songs were composed by Dr. Premasiri Khemadasa and he appreciated her voice and singing capabilities many times.",
    "Lyrics of a song": "නමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී\n•••\nදේව පුත්රයා අතීත සාන්තු වරමිනා\nදේව පුත්රයා අතීත සාන්තු වරමිනා\nපිළිසිඳීය දෙව් බෙලෙන් ශ්රී ඔබේ කුසේ\nපිළිසිඳීය දෙව් බෙලෙන් ශ්රී ඔබේ කුසේ\nනමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී\n•••\nකීරිති පෑ ශ්රියා සාමදානයේ පියා\nකීරිති පෑ ශ්රියා සාමදානයේ පියා\nසාරසේ දිලී සිරින් ශ්රී ඔබේ කුසේ\nසාරසේ දිලී සිරින් ශ්රී ඔබේ කුසේ\nනමෝ මරියනී\nනමෝ මරියනී\nනමෝ මරියනී ප්රසාද පූර්ණවන්තිනී",
    "Songs": "Aadaraye Ran Wiman, Aaloke Deela, Adara Kithiyen Hada Saluna, Adaraye Ran Vimane, Adare Mal Pawane-Duleeka, Aido Me Mayawo, Aloke Labu Kisiwak Na, Amma Mata Mal Suwadak Wewa, නමෝ මරියනී",
    "email": "LathaWalpola@srilankasingers.com"
  },
  {
    "Name": "ලයනල් රන්වල",
    "Birth Date": "27-Nov-39",
    "City": "තලවතුගොඩ",
    "Biography": "ලයනල් රන්වල (27 November 1939 – 13 November 2002) was a musician and a singer in Sri Lanka and a legend in Sri Lankan folk music. His birth city was Kalubowila and he studied in Kalubowila Budhdhagosha College, Kumara College Wellawatta and Lumbini College, Colombo. Ranwala's main interest was Sinhala folk music of Sri Lankan. He successfully brought Sinhala folk tunes and melodies to popular Sri Lankan music, preserving their originality. He studied music at the Panjab University, Chandigarh, India and has a sour knowledge of the field. Ranwala, who created a revolution in the local folk music scene along with his mentor W.B. Makuloluwa, started his teaching career at Arawwala MMV in 1959. He taught music at several leading schools including Ananda College, and Royal College, Colombo during a 38-year career. He popularised local music in schools and formed the first 'Hevisi' band in a school – at Pannipitiya Dharmapala Vidyalaya in 1964. Ranwala was also a versatile actor and dramatist. One of his most memorable roles was in the first Sinhala opera 'Depano' directed by Makuloluwa. He also wrote and directed several children's dramas. He acted in several teledramas. His last teledrama was \"Rangamadala Samugani\" which was telecasted in Swarnawahini. He travelled all over the island collecting folk songs for posterity. A staunch defender of indigenous music, he released several cassettes containing experimental folk music, notably 'Ahase Innavalu' in 1999. He formed the 'Thaalama Foundation' for preserving folk music. \"Gama Ahulaggang\", \"May Awurudu kale\" and \"Wannam Sawudam\" are some of his most famous songs. He has two sons, Chirantha and Sahan. The elder, Chirantha is a presenter and producer at Swarnavahini. Sahan is also working at the Swarnawahini, but after his father's sudden death, has now taken the initiative to preserve and make people aware of Sinhala Folk Music, in the same way his father did. His son, Sahan Ranwala doing very well in preserving the legacy of his father.",
    "Lyrics of a song": "මේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ තෙල් ඉහිරුණු කැවුම් ගෙඩිය වාගේ...//\n\nදොං තරිකිට කැත්ත දොදොං පිළ වටකර කැත්ත දොදො දමා තැල්ල ඩිඟිසි ඩිගොයි දමා තැල්ල තක තෙය්යත් තාං කැවුම් කොකිස් තෙලේ බැදෙයි කැවිළි සුවඳ සිතට දැනෙයි\n\nබා බා බා කිකිළී\n\nඊයෙ උදේ ගිය කිකිළී තාම ආවෙ නැ කිකිළි\n\nබා.. බා.. බා..\n\nගත්තිංඥා තිංඥා.. ගති ගත ගෝ ගති ගත ගෝ ඔන්චිලි චිලි වාරම් ගම දෙවනත් වෙන්නා මැංගිරි ඩිණිකෝ.. අවුරුදු ආවෝ..\n\nමේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ...//\n\nදොං තරිකිට කැත්ත දොදොං...\n\nබා බා බා කිකිළි...\n\nගත්තිංඥා තිංඥා.. ගති ගත ගෝ ගති ගත ගෝ...\n\nමේ අවුරුදු කාලේ සිනහ වෙයන් රාළේ..../",
    "Songs": "Ahase Innawalu, Ahuwama Kan Pirena, Akulagena Sonda, Kelipodda Baledi, මේ අවුරුදු කාලේ, Mithuru Sarouhura, Pankiriththi, Pasunu Karal, Sanda Saawee Ma, Sawanath Kinihara, Soya, Wannam Sawudam, Yuddetath Awith",
    "email": ""
  },
  {
    "Name": "මධුමාධව අරවින්ද සිරිවර්ධන",
    "Birth Date": "6-Mar-73",
    "City": "මහනුවර",
    "Biography": "Gajanayake Arachchige මධුමාධව අරවින්ද සිරිවර්ධන, better known as Madhumadhawa Aravinda, is a Sri Lankan singer, actor, journalist and a politician. He is also a past president of the Sri Lankan Singers Association. Coming from a family of artists, Aravinda's father Sunil Siriwardana is a musician in Sri Lanka. His mother Susiri Siriwardena also a lyricist. His younger brother Dananjaya Siriwardana is also a popular actor in television and cinema. He was married to popular actress Nilmini Tennakoon, and they have one daughter Shvetha Mandakini Siriwardana. He met Nilmini during the teledrama Pini Bindu in 1992. They got married on 5 May 1996. They divorced in the early 2000s. Aravinda's grandfather, Peter Siriwardena was an accomplished musician and an actor. He worked as a lecturer in music at the Government Women's Training College, Polgolla. Aravinda's grandmother Srimathi Karuna Devi was a music teacher as well as an actress. Aravinda's aunt Chandrika Siriwardena is also a popular songstress and playback singer. She was married to Anton Alwis, who was a journalist as well as a lyricist. Aravinda commenced his singing career in 1990 along with his friend, Namal Udugama. He sang his first song in 1990 and the producer of that program was his father Sunil Siriwardana. Although he only recorded few handful of songs, when compared with his fellow musicians, songs such as Lamba Sawan and Sith Sith gain enormous popularity.",
    "Lyrics of a song": "ළඹ සවන් රන් පටින්\n\nදන නෙතින් තදින් බඳිමින්\n\nමිණි මෙවුල හඬවිමින් පිපි සමන් කුසුම් දරමින්\n\nතුනු විලෙහි සිරිය මවමින්\n\nරණ හසුන් පිහිනමින් උන් රගති වයති ගී ගය ගයා මියුරු අරුතින් දැහැමින් බැඳි සිත් මඩින්ට මාර සෙන් වටින්\n\nඋන් පරදා අප මහසත් පාරමී බෙලෙන් සෙවණින් බෝ පත් අතරේ ගැලූ අම ගඟින් පවසින් දහමේ නිවුනේ දම් අමා රසින්\n\nකැණිමඬල පළාලා\n\nසුනු විසුනු කළා මැදුරක්\n\nයලි මැදුර සදාලා වෙහෙසුමක් තොපට නැත්තේ නද දුන්නු රාජ මිගික්ෂෙක්\n\nමම ගයමි උදම් ගී\n\nදැහැමින් බවුන් වඩයි නේරංජන නදී තීරේ\n\nළඹ සවන් රන් පටින්\n\nදන නෙතින් තදින් බඳිමින්...\n\nදස දහසක් සක්වා තළ එකම්පිත වෙවී\n\nදස දහසක් ලෝ ධාතුව ගුගුරුවා හැලී දෙව් බඹ සුර නා සේනා සාදුකාර දී\n\nපරසතු මල් ගඳ විලවුන් දෙපාමුල පිදී\n\nකැණි මඬල පළාලා\n\nසුණු විසුණු කරා මැදුරක්...",
    "Songs": "Amma Sudui Appa Sudui, Badu Patawagena (Saroja), Benthara Hamine Mage, Darani Thala Kampa Wuna, Dewa Dara Wruksha Chandra, Eaka Kode Chuniyam, Gaha Kola Kandu Mudune, Gee Gayana, ළඹ සවන් රන් පටින්",
    "email": "madumadawa@srilankasingers.com"
  },
  {
    "Name": "මල්කාන්ති නන්දසිරි",
    "Birth Date": "",
    "City": "නුගේගොඩ",
    "Biography": "Malkanthi Nandasiri is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "සහසක් පැතුමන් ඉපදී මියගොස් ඉතිරිව ගිය එක පැතුම දරාගෙන ඇහැල මහක අඩ හඳ පෑයූ දා\n(මතකද සිරි දළදා වැන්දා )//\n\n(අතීතයක් වෙන්වන රේඛාවෙන් අනාගතය හිස් කරවනු ලැබුවා )// \nඔබෙ අත අන් ලඳකට හිමි කරදී \n( මතකද මා ඉකිබිඳ හැඬුවා //\n\nසහසක් ...\n\n(අහිමිව ගිය සම්පතට වඩා හිමිවූ දුක මිහිරියි සලකන්නම් )//\nඔබ වැනි කෙනෙකුට නෑනා වීමත් පෙර පිනැකැයි මා සැනසෙන්නම්\n\nසහසක් ...",
    "Songs": "Aadare Pethum Pura, Aba Mal Renuwaka, Dothata Gath, Duwe Methun Sinhalaye-Deshanuragi, Gaya Pem Geyum, Jeewitha Gangawe, Maha Sayure Diya Gambare, Samiduni Obage, සහසක් පැතුමන්",
    "email": "malkanthinandasiri@srilankasingers.com"
  },
  {
    "Name": "මරියසෙල් ගුණතිලක",
    "Birth Date": "11-Jun",
    "City": "නුගේගොඩ",
    "Biography": "මරියසෙල් ගුණතිලක is a Sri Lankan singer and musician. She has performed not only in Sri Lanka but also as far as the United Kingdom, the United States, the United Arab Emirates, Singapore and Australia. Mariazelle Goonetilleke was born in Nugegoda located in Colombo, Sri Lanka. She began her music career at the age of seven. At the age of ten Mariazelle won the junior section of the Ceylon Observer All Island Talent Competition. This allowed her to join a pre-teen group of young musicians called the \"Junior Rhythmiers\", a popular Sri Lankan music group. The group became well known in the 1960s when they were featured on Radio Ceylon, the oldest radio station in South Asia. It \"ruled the airwaves\" during the 1950s and 1960s, so any exposure on Radio Ceylon was a huge boost to young artists on the island.",
    "Lyrics of a song": "බණ්ඩි වළලු මිණි කිංකිණි සිනහ සළාලා\nලන්ද දිගේ මුතු පින්නේ දෙපා නගාලා\nනිල්ල මැදින් ඇඹුල අරන් ඔබව සොයාලා\nඑන්න දිනක් ලං වනතුරු ඉඳිමි බලාලා\n\nගං ඉවුරේ වැලි තලයේ දුටුවා මතකයි\nපුන් පෝදා බෝ මළුවේ සිටියා මතකයි\nසඳ වතුරේ පෙම් ඔරුවේ පෙඟුවා මතකයි\nමල් උයනේ තුරු වදුලේ දෙඩුවා මතකයි\nබණ්ඩි වළලු මිණි කිංකිණි සිනහ සළාලා\nලන්ද දිගේ මුතු පින්නේ දෙපා නගාලා\n\nදුකට සැපට ඔබ අසලින් සදා රැඳෙන්නම්\nඅපට උරුම සොඳුරු ලොවක් තනා වෙසෙන්නම්\nමගේ ලොවට ඔබ රජෙකැයි කියා සිතන්නම්\nසසර පුරා වසන තුරා ඔබම පතන්නම්\nබණ්ඩි වළලු ................",
    "Songs": "Kandy Lamissi, Abilin, Ada Api Inne Winoden, Adare Namin Kisidu Hangeemak, Adareta As Nathi Hinda, Ai Aiyo Mage Ammo, Aiwan Lushan, Akuru Pahaki, Allapu Gei - Misis Perera, බණ්ඩි වළලු",
    "email": "mariazelle.goonetilleke@srilankasingers.com"
  },
  {
    "Name": "මර්සිලින් පතිරණ",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "",
    "Lyrics of a song": "අතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\n\nජීවිතයේ එක ලස්සන දවසක\nහඩා... වැටී... ලා යොවුන් සිතින්\nජීවිතයේ එක ලස්සන දවසක\nහඩා... වැටී... ලා යොවුන් සිතින්\nතවත් මෙ මා හද ඔබ රිදවනවා\nසේපාලිකා මල් සුවද මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\n\nසොදුරු මගේ ආදර පැතුමන්\nකඩා වැටීලා ඔබේ හදින්\nසොදුරු මගේ ආදර පැතුමන්\nකඩා වැටීලා ඔබේ හදින්\nබලා... නොබලා... නොයන් ලදුනේ\nඅසරණ වූ. දා සෙනේ... හයෙන්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්\nඅතීතයේ එක ලස්සන දවසක\nසොදුරු සැමරුම් මතක මැදින්\nසේපාලිකා මල් ඉහිරුනු පාරින්\nමා තනි වෙන්නම් කඳුලු මැදින්",
    "Songs": "Mathakaya Awadiwa, Obe Eth wela, Bendunu Senehe, Anepindu Situ, අතීතයේ එක ලස්සන දවසක",
    "email": "Marselin.Pathirana@srilankasingers.com"
  },
  {
    "Name": "මායා දමයන්ති",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "",
    "Lyrics of a song": "පුරහඳ ලෙස ඔබ සම කළ මගෙ මුහුනේ නළලත මා සිත්තම් කළ කුංකුම තිලකේ ඔබ දුටු ලස්සන ඇයි බොඳවී මැකුනේ පෙර ලෙස පැහැබර නැතිවද නළලේ තිලකේ.\n\nඇසුරින් මිදීලා ඔබ සමුගෙන යාදෝ\n\nමහිරෙන් පිරි ලොව අහිරි වේදෝ\n\nඔබ සිටු කුමරියකට බහ දුන්නාදෝ මට පිටුපා ඇගෙ අතිනත ගනේන්දෝ\n\nඔබගෙන් වියෝවි ලොව මා තනිවේදෝ සිත මා විකල් වී අසරණ වේදෝ මගෙ සිත තුල තෙරපෙන දුක දන්නේදෝ එය මා කෙලෙසක ඉවසා ගන්නේන්දෝ",
    "Songs": "Dasa Wasa Sitiya, පුරහඳ ලෙස, Sudu Seethala Hima Warusawe",
    "email": "Maya.Damayanthi@srilankasingers.com"
  },
  {
    "Name": "මර්සි එදිරිසිංහ",
    "Birth Date": "18-Dec-45",
    "City": "අඹේපුස්ස",
    "Biography": "Donna Mercy Nalini Edirisinghe (18 December 1945 – 17 March 2014) was an actress in Sri Lankan, cinema, theater and television as well as a singer. She is also well known for her role in numerous comedic television shows and radio dramas, the most famous of which is a radio program titled 'Vinoda Samaya', in which she acts alongside Annesly Dias, Berty Gunattileke and Samuel Rodrigo. She began her singing career in 1964 from the 'Nawaka Madala' song contest and became a stage actress in 1966. Her most famous play was a musical by Lucien Bulathsinhala, titled Tharavo Igilethi. Composed by Gunadasa Kapuge, \"Made Lagina Tharawan\" from the soundtrack of the play became her most successful single.",
    "Lyrics of a song": "මඩේ ලඟින තාරාවන් නාවන්නද මං\n\nඌරු දළෙන් මොන ගජ මුතු අරගන්නද මං චපල හිමිට සිරි යහනේ රැවටෙන්නද මං එහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං //\n\nමදන ඇතුන් නෙලුම් හුයෙන් මදන ඇතුන් නෙලුම් හුයෙන්\n\nබැඳගන්නද මං\n\nදුවන මුවන් දැක ලන්නද\n\nනෙලූ පලා මං\n\nඑහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං\n\nමඩේ ලඟින තාරාවන් නාවන්නද මං...\n\nහමන සුළන් මකුලු දැළෙන්\n\nහමන සුළන් මකුලු දැළෙන්\n\nවළකන්නද මං කොහොඹ ගහෙන් කොහොම සඳුන්\n\nමල් නෙළන්නෙ මං එහෙම කලොත් ඔබ කියාවි මෝඩ ගෑණි මං මෝඩ ගෑණි මං\n\nමඩේ ලඟින තාරාවන් නාවන්නද මං...",
    "Songs": "මඩේ ලඟින තාරාවන් නාවන්නද මං",
    "email": ""
  },
  {
    "Name": "මයිකල් පීරිස්",
    "Birth Date": "",
    "City": "උස්වැටකෙයියාව",
    "Biography": "Micheal Peiris is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//\n\n(ආවේ හෝ හෝ ගාලා වර්සාව වේගෙන්)// (ඒ වෙලේ මුච්චලින්ද නාග රාජයානන් ඉන්නාවු හිමි දැක තෙමි තෙමි සීතලෙන් නොතෙමා වසාවෙන් බේරා දරනින් ද වූවා)//\n\n(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//\n\n(පෑයූ වෙලේ දැක - නා රජිඳුන්)// (පිරුණා වු හදවත මෛත්‍රීය පාමින් ඕ හට අමා මහ දැමේ දෙසූවා)//\n\n(උතුම් බුදුන් තෛලෝ නා වී බුද්ධාලෝකේ පෑවා පෙරුම් පිරූ මහිමේ පාලා සුරින් නිම වූවා)//",
    "Songs": "Bodhi Satha Purane, Me Gammaneta, Wada Suwanda, Bawe Duka, උතුම් බුදුන්",
    "email": "micheal.peiris@srilankasingers.com"
  },
  {
    "Name": "එම්. එස්. ප්‍රනාන්දු",
    "Birth Date": "4-Mar-36",
    "City": "කොළඹ",
    "Biography": "Mahagamage Samson Fernando, (4 March 1936 - 9 April 1994), popularly as එම්. එස්. ප්‍රනාන්දු, was a Sri Lankan singer and musician. He is a major player in the development of Baila music and was widely popular among Sri Lankan audiences commonly referred to as the \"Baila Chakkrawarthi\" (Baila emperor). Fernando was born on 4 March 1936 in Moratuwa to Laron Fernando and Lilee Gomes as the eldest child of the family. He attended St. Anthony's College, Wattala and Christ Church College, Dehiwela. He had three younger sisters and one younger brother: Walter. Walter Fernando is also a musician and singer, who continues to sing his songs. Fernando was married to Tulin Fernando and has 7 Children: Susil, Telina, Shantha, Sarath, Sujitha and Sunimal. Both Susil Fernando and Sarath Fernando continue his father's legacy as musicians. He died on 9 April 1994 at the age of 58.",
    "Lyrics of a song": "ලස්සණ රෝස මලක් මට ලස්සණ නෑ\nලස්සණ සමනලය මට ලස්සණ නෑ\nලස්සණ කිසිම දෙයක් මට ලස්සණ නෑ\nලස්සණ නෑ ලස්සණ නෑ ආදරවන්තිය ඔබ වාගෙ නෑ\nලස්සණ රෝස මලක්................\n\nනිල්මිණි තිබේ මිණි පුරේ මුතු තිබේ හරි අගේ රන්වලින් දම්වැල් සදා\nනැතේ නැතේ මට අගේ පිනවන්න හිත මගේ ඇතේ ඇතේ ආදරි ඇතේ\nමාව සනසන්න පිනවන්න මිණි මුතු රන්වලින් බෑ\nඇලේ දොලේ ගංගාවේ දිය ඇල්ලෙ මගේ හිත නෑ\nනැතේ නැතේ මට අගේ පිනවන්න සිත මගේ ඇතේ ඇතේ ආදරි ඇතේ\nලස්සණ රෝස මලක්................\n\nකෝකිලයගේ සුමිහිරි ගීතය මිහිරි වේ සුන්දරයි දෙසවන් පිනයි\nනැතේ මට අගේ නැත පිනවන්න මගේ හිත ඇතේ ප්‍රිය ආදරී ඇතේ\nඈගේ සුදු මූන දුක්වීල ඇඬුවාට කැත වෙන්නෙ නෑ\nමම ඔබේ ඔබ මාගේ මගේ හිත වෙන් වෙන්නෙ නෑ\nනැතේ මට අගේ නැත පිනවන්න මගේ හිත ඇතේ ප්‍රිය ආදරී ඇතේ\nලස්සණ රෝස මලක්................\nආදරවන්තිය ඔබ වාගෙ නෑ///",
    "Songs": "Adaraneeya Babo, Adarawanthi Lassanawanthi, Adarawanthiye, Aladin Aladin, Ali Baba - Punchi Panchi, Amma Thaththawa, Ammada Birindada - Obage Ammada, Asanam Ennako Tharunayan, Asu Pita Awidin, Athuru Mithuru, ලස්සණ රෝස මලක්",
    "email": ""
  },
  {
    "Name": "මිල්ටන් මල්ලවාරච්චි",
    "Birth Date": "7-Apr-44",
    "City": "කොළඹ",
    "Biography": "Sumanasiri Mallawarachchi Don (7 April 1944–10 March 1998), popularly known as මිල්ටන් මල්ලවාරච්චි, was a Sri Lankan singer and musician. One of the most respected singers in Sri Lankan music history, Mallawarachchi was a trending act in Sri Lanka for more than a decade, performing nearly a total of 850 songs with over 35 albums. He is also known to be a music composer for most of his songs, a film play-back singer for the silver screen, a talent tabla and sitar player. He died on 10 March 1998, at the age of 53, and is buried in the Borella cemetery.",
    "Lyrics of a song": "මන වසඟ කරන මුදු සිනා වතින්\nසිත පහන් කරන බඳ සලා සිහින්\nකරළිය පසුපස මඳ අඳුරු කොනක වී\nහඬා වැටෙනු කිම ඔයා\nහඬා වැටෙනු කිම ඔයා\n\nපෙම් පත් දහසක් ඔබට ලැබෙන මුත් රස හදවත් ලියනා\nකරුණු කියනු මැන තනිවම ඉකි බිඳ මේ ලෙස ඔබ හඬනා\n\nසළලෙකු වදනින් සසල වීද සිත සුරා මතින් සිටිනා\nවරදක් වීදැයි කම්පා වන්නෙද විට දී ඔබ රඟනා\nමන වසඟ කරන ................",
    "Songs": "Ada Heta Oba Ma, Adaren Mese Katha Wewi, Aga Rejiniya, Ahithak Nosithami, Ama Ran Hangum Piri, Ananga Ran Hee, Ananthaye Piyasala, Andura Watunu Veediye, Angana, මන වසඟ කරන මුදු සිනා වතින්",
    "email": ""
  },
  {
    "Name": "මොහිදින් බෙග්",
    "Birth Date": "5-Dec-19",
    "City": "කොළඹ",
    "Biography": "Kala Suri Alhaj Kareem Mohideen Baig (5 December 1919 – 4 November 1991), popularly as මොහිදින් බෙග්, was a Sri Lankan musician. One of the most influential singers in Sinhala music, Baig is known particularly for his Buddhist devotional music. He is a Muslim who moved to Sri Lanka from Salem in Tamil Nadu, but of a Hyderabadi Muslim origin. He was considered a highly influential multicultural figure in the country's arts history. Baig is the first award winning citizen of Sri Lanka.",
    "Lyrics of a song": "බුද්ධං සරණං ගච්ඡාමි\nධම්මං සරණං ගච්ඡාමි\nසංඝං සරණං ගච්ඡාමි\nඔබෙ රාගී මන කැලඹේදෝ ක්ලේෂ ඕගයේ නෑවේදෝ\nඔබෙ රාගී මන කැලඹේදෝ පිවිතුරු හදවත පෑරේදෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nමෛත්‍රී කරුණා දූෂිත වී ක්‍රෝධය ඊර්ෂ්‍යා පෝෂිත වී\nහිංසා පීඩා දේවි දෝ මිනිසා තිරිසන් වේවි දෝ\nඝෝර විසැති නයි පොලොඟුන් වන් මිනිසුන් මිතුරු වෙසින් එයි නම්\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nදුක් බරිනී මිරිකී යා දෝ සත්‍යය ලෝකෙ වැනසී යා දෝ\nනිර්මල පිවිතුරු චරිතෙ ඔබේ පවිටෙන් බොරුවෙන් කෙලෙසා දෝ\nඅගතිය යුක්තී මාරුතයේ ප්‍රාණෙ ඔබේ දෙදරා යා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nකාට කියමී මගේ ශෝක අඳෝනා ලෝකේ තනිවුණා මේ ලොවේ මිනිසා\nහදේහී නිර්දායා සංදා\nනිර්දය භාවය ලොව රජ වී දයා ගුණේ වී අන්තර්දාන්\nමෝහෙන් මත්වීලා මිනිසා ආගම හා ධර්මේ කෙළෙසා\nසත්‍යය බලේ බිඳ වලලා දෝ ශ්‍රද්ධා භක්තිය දෙදරා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි\n\nබුද්ධං සරණං ගච්ඡාමි \nප්‍රේමය ලෝකේ යාද නැසී\nප්‍රේමය ලෝකේ යාද නැසී වෛර ගිනී ඇවිලේද දැවී\nමාතා ස්නේහේ පාය ඇතී තම පුතු අසිපත පාවි දෝ\nධරණී තල කම්පා වේ දෝ ගගනෝදර ගුගුරා යා දෝ\n(එම විට පවසනු මුවින් ඔබේ බුද්ධං සරණං ගච්ඡාමි) //\n\nලෝක පියා සින්දේ ලොව ජනගේ ව්‍යාකූල සිත්හී අන්ධකාරේ\nවිසිරී සෞම්‍ය කිරණ ලෝනාගේ ඒකාලෝකේ විය ලෝකේ\nඅමා ශාන්තියේ සෙවනැල්ලේ ජන මන නැහැවූ ප්‍රේම ජලේ\nමර සටනින් අපරාජිත වූ සුර නර පුද ලැබ පූජිතයේ\nලෝක සිවංකර මා හිමිගේ ධර්මේ දස දෙස පැතිරේවා\n(සැම දන තුඩ තුඩ රැව් දේවා බුද්ධං සරණං ගච්ඡාමි) //\nබුද්ධං සරණං ගච්ඡාමි - ධම්මං සරණං ගච්ඡාමි - සංඝං සරණං ගච්ඡාමි ///",
    "Songs": "Aawa Ithin Malsara, Adara Nadiya Gala, Adariye Ruchirananiye, Ai Bambaro Pem Mala Atha Harala, Alokaya Ko, Amathaka Karalamu Parani Katha, Aneka Jathi Sansare, Arumayaki Pudumayaki, Brunda Wanaye, ඔබෙ රාගී මන කැලඹේදෝ - බුද්ධං සරණං ගච්ඡාමි",
    "email": ""
  },
  {
    "Name": "නාමල් උඩුගම",
    "Birth Date": "21-Oct-67",
    "City": "මහනුවර",
    "Biography": "Prasanna Namal Udugama (born October 21, 1967) is a Sri Lankan singer, composer and songwriter. One of the most popular artists in Sri Lanka, before the era of reality shows, he is regarded as a symbolic icon in modern Sri Lankan music industry. The health issues in 2014 made him to slow his singing career. Udugama recovered well from a successful liver transplant in mid-2015. Udugama's father is a businessman and his mother is a housewife. He has two brothers and two sisters. He is the youngest in the family. Namal was educated at Hewahata Central college in Kandy. At school, he played guitar and performed at school events, before joining a band in Kandy. Udugama moved to Colombo, where he began to release albums. He composed and performed the song \"Samuganne Na Wenwanne Na\"; the song established his career in the Sri Lankan music industry. Udugama is married to actress Ruwanthi Mangala, and they have one daughter, Dehemi and one son, Nomitha.",
    "Lyrics of a song": "හීන් සැරේ හිතට මගේ සෙනෙහස පාලා\nඔයත්මගේ මමත්ඔබේ මතකද කීවා\nසැරින් සැරේ පැයෙන් පැයේ ඇමතුම් ආවා\nහදිස්සියේ වෙනස් උනේ කොහොමද ඒවා\nහිත මගෙ පාර පාර යනවද ඈත ඈත\nමේ හිත තනිකරදාලා\nඅවංක හින්දා ආයෙ වැරදුනා\nහිතන්න දේවල් නෑ හීන බොඳ උනා //\nජීවිතේට මේ තරමට බැඳිලා\nකාටවත්ම නෑ ආදරේ දීලා\nසංසාරෙම ඔබේ වෙන්න හිතලා\nමගෙ හිතටම ඇයි මේ පිටුපාලා\nවෙන්වී යන්න ගියා කඳුලක් ඉතිරි කළා\nඔබහට නෑසේද මේ වේදනා\nහදවතින්ම පිදුව මාගේ සෙනෙහේ\nඅඩුවක් කවදා කෙලෙසද වූයේ\nහිතාගන්න බැරි මේ දුක දුන්නේ\nහැමදේටම ලඟින් සිටි ඔයානේ\nවෙන්වී යන්න ගියා කඳුලක් ඉතිරි කළා\nඔබහට නෑසේද මේ වේදනා",
    "Songs": "Adare Bindi Hadawatha Wedana, Adare Lan Lan Wewa, Adaren Hadawatha Dennam Kiyu, Alu Kobei Kirilli, Amma - Nube Senehe Wila, Andurak Andurin Me Lowa, Apa Hamuweema Wenweema Do Adare, Apa Samugth Da, ඔබේ ලොවේ අද මා",
    "email": "Namal. Udugama@srilankasingers.com"
  },
  {
    "Name": "නදීක ගුරුගේ",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "නදීක ගුරුගේ is one of the most influential composers in Sri Lankan music. \"I grew up with the guitar and the guitar speaks at this concert\" says Nadeeka on his concerts titled Nostal Guitar Electrica 2015 and 'Echo in the Mountains'. Guruge started as a young musician researching in 1999. His first serious musical work was \"Sanyugma\" a folk and applied music production with Marcello Titto Li, a Bolivian folk musician, in 1999. Since then he has been working in movies, tele dramas, stage dramas, songs and advertising.",
    "Lyrics of a song": "රෑ අහසින් වැටෙනා\nබිංදු බිංදු පිනි බිංදු\nනොපිපි මල සොයනවා\nමුවා වී ඉන්න එපා\nහරි සීතලයි\nසීතලයි පින්න\nසිපගන්න බයෙන් මහ පොළොව\nපිනි බිංදු හඬනවා\nනිම් නාද දී\nදෙතොලතර ඉඩ දෙන්න\nනවාතැන්පල වෙන්න\nහරි සීතලයි පින්න\nඅනෝරා පිනි යටින්\nතෙමි තෙමී ඇවිදින්න\nගිනි නැගෙනා ආත්මය\nපිනි දියෙන් දෝවන්න\nසිරුරතර ඉඩදෙන්න\nනවාතැන්පල වෙන්න\nහරි සීතලයි පින්න",
    "Songs": "Neela Nethu Yuga, Waren Heen Sare Ridee Walawe-Cover, Wedikawe-Romiyo, රෑ අහසින් වැටෙනා",
    "email": ""
  },
  {
    "Name": "නන්දා මාලනී",
    "Birth Date": "23-Aug-43",
    "City": "අලුත්ගම",
    "Biography": "Mirihana Arachchige Nanda Malini Perera (born 23 August 1943), popularly as නන්දා මාලනී, is a Sri Lankan songstress and playback singer. One of the best known and most honored singers of Sri Lanka, Malini's choice of singing themes are based on real life and social-cultural situations. Her songs intricate notional ideas of relationships, life-circumstances, and emotions that stem out of human realities. Nanda was born on 23 August 1943 as the fourth child to a rural family of nine in Lewwanduwa in Aluthgama, Sri Lanka. Her father, Vincent Perera was a skillful tailor and ready-made coat maker. Her mother, Liyanage Emily Perera was a housewife. She has four sisters and four brothers. She moved to Kotahena in Colombo as an adolescent and was admitted to Sri Gunananda Vidyalaya where she came under the tutelage of T. N. Margaret Perera. She was married to Suneth Gokula and the couple has two daughters – Varuni Saroja, Ama Sarada. Elder daughter Varuni is married to Chaminda, son of popular lyricist Dharmasiri Gamage. Younger daughter Ama is married to Sanjeewa.",
    "Lyrics of a song": "මා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්\nනොඉඳුල් තොල්පෙති අතරින්\nඋදුරා ගෙන සිනාව\nහදවත නැති මිනිසා ඔබ\nනෙත කඳුළැලි ගෙනාව\nමා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්\nඑක්ටැම්ගෙයි සිරගත කර\nසමනළියක අනාථ\nජීවිතයම ඔබ අරගෙන\nඇති දුන් වේදනාව\nමා සඳට කැමති බව දැනගෙන\nඔබ සඳ අයින් කළා අහසින්\nමා මලට කැමති බව දැනගෙන\nඔබ මල අයින් කළා නටුවෙන්",
    "Songs": "රුක් අත්තන මල මුදුනේ, සුරංගීට දුක හිතුනා, වාසනාව ඇගේ නෙතයි, මිරිවැඩි සඟලක්, සාරි පොඩිත්තක්, සකුරා මල් පිපිලා, සුදු හාමිනේ, රන් ගිරි ගිරි ගිගිරි, චන්ද්‍ර මඬුලු යට, මල් කියන්නෙ කාට කාට, මිහි මඬලේ අඳුරු කුසේ, දීග නොගිය පුංචි නැන්දා, මගේ සිනා ඔබ අරගන්න, මල් මල් හීනය, වැස්ස වළාහක, බුද්ධානුභාවේන, මා සඳට කැමති බව දැනගෙන",
    "email": "Nanda_Malani@srilankasingers.com"
  },
  {
    "Name": "නාරද දිසාසේකර",
    "Birth Date": "7-Jun-33",
    "City": "නුගේගොඩ",
    "Biography": "නාරද දිසාසේකර (7 June 1933 – 19 May 2010) was a Sri Lankan classical singer. He was the first singer to win the Sarasaviya Award when he was awarded for Best Male Playback Singing in 1964 for his duet Galana Gangaki Jeevithe with a young Nanda Malini for Ranmuthu Duwa. He completed education from Kalutara Maha Vidyalaya. Narada's sister's son is Nalendra Amarasinghe and his wife is Girlie. Narada was good at sports like cricket during school times. He also studied music and played violin under the school teacher Seemon Lokuliyana. Disasekara was first married to radio host and actress Tileka Ranasinghe in 1979. The couple has one son, Saranga. Saranga Disasekara became a popular actor since his debut in Nil Diya Yahana in 2009. He then acted in many films and television serials and won most popular actor award in multiple times. After separating from Tileka, he was married to Nilangani Disasekara. Disasekara died on 19 May 2010 at the age of 76. The remains were kept at his residence at 26A, Wetakehiyawala Road, Udahamulla, Nugegoda for public on 20 May 2010. His remains were later buried in Borella Cemetery.",
    "Lyrics of a song": "චන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nඅන්ද මන්ද දැඩි චන්ඩ සිතුම් ඇති\nපුඟුලන් මැද දෙරණේ.\nඉන්ද්රඛීලයක් සේ මම ඉන්නෙමි\nනිරතුරු ඔබ සෙවනේ...\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nඅදත් සිනාසී හමුවූනු අයුරින්\nභින්න රුචික මෙලොවේ...\nහෙටත් උදෑසන පිබිදෙන දෑසින්\nඅප හමුවිය යුතු වේ...\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.\nචන්ද්ර බිම්බයුරු\nඔබෙ වත පවසයි\nමුදු හදවතක තතු.\nඉන්ද්රනීල මිණි සේම දෙනෙත් යුග\nනොකරමි දිනක රතු.",
    "Songs": "Adara Nil Dase, Athin Paya, Binara Malee Ekka Enna, Chandana Anga Gala, චන්ද්ර බිම්බයුරු, Eatha Gawu Ganan Durin - Arichchi Borichchi, Gamana Nonimei, Katu Akule Pipi",
    "email": ""
  },
  {
    "Name": "නීලා වික්‍රමසිංහ",
    "Birth Date": "30-Mar-50",
    "City": "කොළඹ",
    "Biography": "Visharada නීලා වික්‍රමසිංහ is a veteran female singer and a musician in Sri Lanka, who mainly sings in Sinhalese. Wickramasinghe was the youngest daughter of Don Francis Wickramasinghe and Withanaratchige Done Yasawathie Gunasekera in Wattala. She became a victim of Polio at the age of six months. The first school she attended was Kirimatiyagara Vidyalaya. In 1954 she was admitted to Kesbewa Government private school where she first started to be involved in music. Later she went to Mampe Sri Sobhita Maha Vidyalaya. Wickramasinghe learned music under maestro Vincent Somapala and Ananda Jayasinghe. She sang her first song for the then Radio Ceylon in 1959 for a programme 'Amateur voice.' In 1967 she got the privilege to record her first song with Radio Ceylon. The song was composed by Dalton Alwis and the music was provided by Lionel Algama, \"Sende ambare nisha mal yata\". In 1973, she was selected as an A-grade artiste on the merit of the songs sung of the research section of the SLBC. After studying North Indian Classical Music, she graduated in 1974 with a Sangeeth Visharada Degree. Wickramasinghe had a number of popular hits including duets with T. M. Jayaratne. Later, Wickramasinghe opted to become a teacher in music. After teaching in several schools she decided to retire prematurely in 1998 after a period of 23 years having had a long stint of eight years at Visakha Vidyalaya, Colombo. Wickramasinghe was diagnosed with abdominal cancer in a very serious manner and survived.",
    "Lyrics of a song": "පනම් අටෙන් මට වැඩිකර දුන්නා\nහැකි වුනත් බත් මිටක් දරුවට කවන්න\nමාස්ටර් සර් මගෙ හිමි තැන දෙනවාදෝ\nඅනේ සර් අනුකම්පා නොසිතේදෝ\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ\nමට මතක් වෙනවා සුද්දා තැලූ පෙලූ හැටි\nඅපි කතා කලේ පන ගැහි ගැහි දනින් වැටී\nමාස්ටර් සර් මගෙ හිමි තැන මට දෙන්න\nඅනේ සර් කරුණාවෙන් සලකන්න\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේ\nනිම වෙන්නට කල් ගත වෙයි දෝ\nඅනේ සර් අපි මිතුරන් වෙයිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ\nඑදා දවස උදා වේවිදෝ",
    "Songs": "Ahasata Hiru Mal, Aluth Sahal Mangallaya, Ammai Mamai, Apa Hamu Nowana Hemanthe, Arunallai Sanda Rallai-Man Asai Adareta, Ashoka Wanayama, Aththatama Yanawada Numba, Dethata Walalu, මාස්ටර් සර්",
    "email": "Neela.Wickramasinghe@srilankasingers.com"
  },
  {
    "Name": "නිමල් ගුණසේකර",
    "Birth Date": "",
    "City": "වරකාපොල",
    "Biography": "Nimal Gunasekara is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "මට නොවේ ඔබ ආදරේ කළේ\n\nමගෙන් ලද ආදරයට පමණයි ඔබ ආදරේ කළේ...\n\nපෙර හැන්දෑවක ඔබ හමු වන්නට මා නොපැමිණි දවසේ පසුදා තරගින් නොදොඩා හිටියේ\n\nකිමද කියන් ළඳුනේ ආදරේ නම්...\n\nමට නොවේ...\n\nපුංචි පුතා අපෙ ලොවට එකතු වී මවු පදවිය ලද දා මා අමතක කොට සුරතල් බැලුවේ කිමද කියක් ළඳුනේ ආදරේ නම්.…\n\nමට නොවේ...",
    "Songs": "Ira Handa Wage, Irane Wenaswela, Made Pipuna Hand, මට නොවේ , Me Seetha Reyame, Milana Dese, Kasi Gewa Gannath Bari, Samuganna Onanam",
    "email": "Nimal.Gunasekara@srilankasingers.com"
  },
  {
    "Name": "නිහාල් නෙල්සන්",
    "Birth Date": "9-Jan-46",
    "City": "මොරටුව",
    "Biography": "නිහාල් නෙල්සන් (born 9 January 1946), is a Sri Lankan vocalist, songwriter and composer. One of the most influential singers in Sri Lanka considered the ‘undefeated on the concert stage’, Nelson holds the record for the most albums recorded by a Sri Lankan artist with 113 albums. His father was a businessman and mother was an English teacher. He started primary education from Innocent Maria Mixed School which is currently known as Rawathawaththa Methodist College. After passing grade 8, he entered Moratu Maha Vidyalaya where he completed A/L in 1960. That's where he got a lot of attention towards music. Nelson is married to Malini Sriyalatha, where the wedding was celebrated on 16 May 1974. Nelson was very popular in school stage as well as in Moratuwa as a singer. However, he had to polish his music ability to enter the music world. During this period, he met Sarath Munasinghe (currently a monk, Meegahawela Sumanashantha Thero) who wrote many songs in early days. In 1962, he met popular musician A.J.Kareem during a wedding. Kareem introduced Nelson to popular composer R. A. Chandrasena. Nelson's first recording Lassanata Pipunu Wanamal wrote by Munasinghe was released on EP on March 31, 1963 under the guidance of Chandrasena. Later he joined with Kandy lake club with Chandrasena.",
    "Lyrics of a song": "ජපන් බැලුම වගේ හිටපු කාලෙ මං \nලියුම් ලියල එව්වෙ කොපිං පැන්සලෙන්\nබ්‍රෝකර්ලා දමලා චොකලට් මට කවලා \nදාපු චාටු මතක නැද්ද දැන්\n\nපුළුන් කොට්ටෙ වගේ හිටපු කොළුව මං \nලියුම් ලිව්වෙ බ්‍රෝකර්ලගෙ බොරු අහන්\nමගෙ චොකලට් කාලා නිතරම දඩ දාලා\nමාව කෑව මතක නැද්ද දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nදුසිම් ගණන් මගේ පොටෝ ඉල්ලලා\nමගෙ හැඩ රුව එක එකාට පෙන්නලා\nමා ගැන නිතර කතා කිය කිය රහට ගොතා\nලොක්ක වුණා මතක නැද්ද දැන්\n\nපොටෝ ගත්තෙ සත්තු වත්තෙ ගිහිල්ලා\nමතක නැද්ද බැබුන් ලඟින් තියාලා\nහැඩ රුව ගැනම සිතා දෙඩුවට බොළඳ කතා\nජපන් බැලුමෙ හුළං ගිහින් දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nඅනුන්ගෙ වතුපිටි දේපළ පෙන්නලා\nවලව්වකින් පැවතෙන බව හඟවලා\nරටටම ණය වීලා ගම රට හැර දාලා\nහැංගි හැංගි ඉන්නෙ මොකද දැන්\n\nකොල්ලො එක්ක රවුම් ගහපු රට වටේ\nතමුසෙ බැඳපු දවසෙ ඉඳල පස් කටේ\nහෝටල් බුක් කරලා මඟුලට වැය කරලා\nබැන්ද එකයි කරුමෙ වුණේ දැන්\n\nආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ\n\nකට්ට වෙට්ට පිත්තල වැඩ පෙන්නලා\nමොට්ට වෙච්ච ඔහෙගෙ තට්ටෙ පෑදිලා\nකට ගොන්නක් බීලා එන කොට වෙරි වීලා\nදීග කඩන් යන්න හිතයි දැන්\n\nපිට රට සිට ආ ලට පට උලාපු\nහුට පටයක් අරන් ඇද්ද වලිප්පු\nඋණු උණු අන්නාසී ලුණු වැඩි වුණු දෝසී\nකාපු කාලෙ ඉවර වගෙයි දැන්\n\n(ආයියෝ බලන්නකො ආයියෝ බැන්දාම තියෙන කරදරේ\nඅනේ අපොයියෝ නැතිවද දෙයියෝ බලන්න මෙතන ජරමරේ) //",
    "Songs": "Adara Kirilli, Ahinsakai, Amma Nathi Kala, Anda Andura, Anduma Hirai, Ape Mallila, Ape Tharuna Wayasa, Athara Pithara, Baila Wendesiya, Banda Banda Aadare, Bar Bar Bar, Basthiyan, ජපන් බැලුම වගේ",
    "email": ""
  },
  {
    "Name": "නිර්මලා රණතුංග",
    "Birth Date": "",
    "City": "කොළඹ",
    "Biography": "Nirmala Ranathunga is one of the Popular Sri Lankan musician and singer.",
    "Lyrics of a song": "මේ උයන්තෙරේ මේ තුරු සෙවණේ ඔබේ කතා මට තවීම ඇසේ මේ නදී තෙරේ මේ අඩිපාරේ ඔබේ සිනා මට තවම පෙනේ..\n\nඔබ එදා කියූ වදන් ලියා ඇති සිතේ නෑ ඉඩක් යලිත් සදා අන් සිතක් කෙරේ..\n\nඅතරමගක මා දමා තනිව ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ..\n\nඅප එදා පෙමින් වෙළී දෙපා නැගු මගේ\n\nනෑ තවත් මැකීගියේ මුදුවදන් ඔබේ..\n\nයලිදු ඔබ එතැයි පතා හිඳිමි ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ..",
    "Songs": "Daru Senehasa, Me Prema, Sina Mal Godak, Ree Seethe Handapane, Thorombol, Wasanthaye Oba, amme oba, dinak dedinak nowe, මේ උයන්තෙරේ",
    "email": ""
  },
  {
    "Name": "නිරෝෂා විරාජිනී",
    "Birth Date": "13-Jan-73",
    "City": "මහනුවර",
    "Biography": "Virajini Lalithya de Silva, also known as නිරෝෂා විරාජිනී is a Sri Lankan award-winning singer, musician and music director with a career spanning over 23 years. Nirosha was born on 13 January 1973.She is native of Kandy, Sri Lanka She was married to Nalinda Sampath in 2000, but the couple got divorced in 2005. She married Yasantha Nimalatheja in 2009.she is beautiful women. Nirosha has sung songs in Sinhalese, Tamil, Hindi, and Malayalam. In 2000, 2002 and 2016 she was awarded as Best Female Vocalist at President's Award and Sarasaviya Awards for her contribution as a playback singer of the films \"Rajya Sevaya Pinisai\" and \"Kinihiriya Mal\" respectively.",
    "Lyrics of a song": "රන් ගිර මා - ඔබ එගිර සිඹින හිරුට සමානා\nපන්හිඳ මා - ඔබ එයින් ගෙතෙන ගීය සමානා\nරන් ගිර මා ................\n\nරන් ගිර හිස හිරු හිනැහෙත - එලියෙන් මුලු ලොව දිදුලත\nනමුදු හිරුට ලං වන්නට වරම් නොමැතියේ\nඉරෙන් ලොවක් එලිවනු දැක මසිත බැබලියේ\nරන් ගිර මා ................\n\nපන්හිඳ ගෙතු ගී ගැයවෙත - මිහිරෙන් තුන් හිත නැහැවෙත\nනමුදු ගීය දුන් මිහිරට උවම් නොමැතියේ\nඑයින් ලොවක් සැනසෙනු දැක මසිත නැලවියේ\nරන් ගිර මා ................//",
    "Songs": "A Ra Sulando, Ada Sitina Me Sama, Adare Mandire, Adare Mihire, Adare Sundara Adare, Adare Tharama Theri, Aganthuka Adaraye, Aiya Kalu Dodol, Alaya Himi Mage, රන් ගිර මා",
    "email": ""
  },
  {
    "Name": "නලින් ජයවර්ධන",
    "Birth Date": "18-Apr-57",
    "City": "පර්ත්, ඕස්ට්‍රේලියාව",
    "Biography": "නලින් ජයවර්ධන (born 18 April 1957) is a popular Sri Lankan singer and vocalist. He was the first Sri Lankan singer to release an internet based audio album in Sinhala allowing his fans from around the world to download the album free of charge.This album titled Kanda Paamule was released in 2004. Nalin Jayawardena lives in Perth, Australia. He has released more than 21 CDs including several tribute CDs for the legendary singer HR Jothipala . Nalin Jayawardena has sung over 350 original songs and over 20 videos of his songs are available online. These songs were composed in collaboration with talented sinhala lyric writers such as Dr Vicumpriya Perera who wrote most of Nalin's songs, Sunil Govinnage, Sriya Kumarasingha and Chrishanthi de fonseka . Musical composition for Nalin's songs were done by popular Sri Lankan musicians including Nimal Mendis , Jayanga Dedigama, Dhammika Edusooriya, Multi award winner Visharada Dharashana Wickramathunga, Visharada Sarath Ovitigala, Rohan Jayawardena, Sangeeth Wickramasingha, Ananda Widyasekara and Rukshan Karunanayaka . Nalin is one of the early Sri Lankan artists to release his songs in Google Play, iTunes, and Amazon. In 2016, a lyrics book, \"Gee Tharu Mal,\" containing over 300 songs sung by Nalin Jayawardena was released. Nalin Jayawardena was the recipient of the Multicultural Deshabhimani Award in 2016 of Serendib Publications, Australia. He has also collaborated in the making of the first-ever Dhammapada Stanzas CD packs with Ven Beruwela Siri Sobitha and Dr Gill Fronsdal. He also collaborated in making the charity CD/DVD in the aid of the tsunami victims in Sri Lanka. He also collaborated with Vicumpriya Perera and Bhadraji Mahinda Jayatilaka to produce the first-ever sinhala audio fiction book Kulageyin Kulageyata spanning into five compact discs. This audio book is a production of Lanka Heritage and Sarasavi Publishers, Sri Lanka.",
    "Lyrics of a song": "(ඔබේ වීදියේ පහන් කනුව යට මා නැවැතී ඉන්නම් අඳුර වැටුනු විට පහනේ එළියට මා දිස් නොවුනාදෙන්)//\n\n(වාරාංගනා ...වාරාංගනා ... වාරාංගනා පිරිවරිනා)//\n\nසිතේ තනිය මිස ගතේ තනිය නැත වාරාංගනා පිරිවරිනා\n\n(විරූප අඳුරේ පැහැදිලි නැති විට ගත ඉන් සවිවේ නම් අඳුර වැටුනු විට සිත දැඩි වන්නට ලොව දිස් නොවුනාදෙන්)//\n\n(වාරාංගනා ...වාරාංගනා ...\n\nවාරාංගනා පිරිවරිනා)// (සිතේ තනිය මිස ගතේ තනිය නැත\n\nවාරාංගනා පිරිවරිනා)//\n\nවාරාංගනා පිරිවරිනා\n\n(වාරාංගනා ...වාරාංගනා ... වාරාංගනා පිරිවරිනා)//",
    "Songs": "Sansara Suwanda, Duru Ratawala Api, Maalavika – Nalin Jayawardena, Music and Melody, Paata Paata Samanaliyan, Tsunami, Midula Puraa, Ven Sobitha himi song Niwan Maga Wediyaa, Wewulai Deetha, Bosathuni Wessanthre, Visakaweni, Oba Menehi karana vita, Ali Kalabalaya, Sangappuliya mama Henayaa, ඔබේ වීදියේ පහන් කනුව යට",
    "email": ""
  },
  {
    "Name": "නුවන් ගුණවර්ධන",
    "Birth Date": "",
    "City": "මහරගම",
    "Biography": "",
    "Lyrics of a song": "ආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ පවන් රැල්ල ඕවිල්ලේ නැගී එන්න අපි යමුදෝ එවන් සුපෙම් යහනේ දෙන්නා\n\nළැඟුම් ගන්න සුවසේ දෙන්නා\n\nආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ\n\nමල් පොකුරේ මුදු රේණුවේ දිය පොකුරේ මුතු බිංදුවේ කවුරුද ඉන්නේ ඇයි නොකියන්නේ ඔබ පමනයි මන මංගලා මොහොතක් නෑරම ජීවිතේ මා හද රිද්මය ගීතයේ කවුරුද ඉන්නේ ඇයි නොකියන්නේ ඔබම විනා අන් අවුරුදෝ නයනේ රඟනා අනුරා නුරා වසන් වී නොයේවා දෑසින් වසන් වී නොයේවා දෑසින්\n\nආකාශ ගංගා නීල ඉවුරේ දෙවුලියෝ යහනාව සරසා ඈත උන් සැඟවී ගියෝ\n\nපියකරු සිහිනෙක රාත්‍රියේ උන්නා ඔබ ලංවී ප්‍රියේ මා කුමරාසේ ඔබ කුමරියසේ ඔව් ඒ සිහිනය මේ තමා මොනරෝ මොනරෝ පිල්වනා මන්දෝ මෙතරම් රංගනා පෙම් බැඳිලාදෝ මොනරිය කොහිදෝ ප්‍රේම වසන්තය ළං උනා සැලෙනා ළෙළෙනා හැඟුමේ මගේ පහන් තරුව ඔබ වේ මිහිරේ පහන් තරුව ඔබ වේ මිහිරේ\n\nආකාශ ගංගා...",
    "Songs": "Chaandani, Kandulinma Gayu, Pavee Giyawe, Lunui Bathui, Sithuwam Kalath, Kiri Muhudu Werale, ආකාශ ගංගා නීල ඉවුරේ ",
    "email": "nuwan_gunawardana@srilankasingers.com"
  },
  {
    "Name": "නුවන්ධිකා සේනාරත්න",
    "Birth Date": "23-Jun-93",
    "City": "නාරම්මල",
    "Biography": "නුවන්ධිකා සෙනාරත්න(born 23 June 1993, is a Sri Lankan singer, performer and television presenter. She came second in the Sri Lankan TV reality show Derana Dream Star Season IX 2020. Nuwandhika Senarathne was born on 23 June 1993 in Narammala, Sri Lanka, as the only child in the family. She grew up in Narammala, a small town near Kurunegala. She attended Mayurapada Primary school, Narammala for her primary education and then she attended Mayurapada Central College, Narammala. She completed her Visharad Diploma in 2011 before entering the university for higher education. She completed her university degree in 2019 with a Second Class Upper division from the University of the Visual and Performing Arts. She is a Radio Ceylon A Grade singer. In 2019, she took part in the Derana Dream Star reality show. Her incredible magical talents were revealed to thousands of local and overseas music lovers during this reality show. Fuelled by this success, her passion for singing reached a new height leading her to the entry into the music industry under the name Nuwandiusic (2021).",
    "Lyrics of a song": "ඔබට ලංවී ලඟින් ඉන්නට හීන දැක්කට මං හිතින් වෙන්වී දුරට යන්නට කාරණා ඇත දැන් මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් කොහොමද බලබල ඉන්නේ කොහොමද මං\n\nආදරේ මල් පියලි අතුරා හදවතේ මළුවේ මගේ මේ හිත ඇවිලිලා යන බැල්මකින් බැලුවේ කාත් කවුරුත් නෑ වගේ මං හංගගෙන පපුවේ ඇයි ඉතින් මගේ හිතට දුක් දෙන සුසුම් වැල් හැඬුවේ මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් දෙන්නේ කොහොමද මේවා බල බල ඉන්නේ කොහොමද මං\n\nකවමදාවත් නෙතට කඳුලක් දුන්නේ නැති හිතක ඔහේ වැටිලා මමත් උන්නා එපමණයි මතක යන්න යන්නම් දරාගෙන දුක තාරකා නෙතක කඳුළු වැටුණට හිතන්නෑ මං අඬන්නෑ මැණික මටම වෙන්කල හදවතේ ඉඩ තව කෙනෙක් වෙනුවෙන් දෙන්නේ කොහොමද මේවා බල බල ඉන්නේ කොහොමද මං",
    "Songs": "Heeneka Paya, Sihinayak Mawna, Malen Upan Samanali, Asanwara Wessak, Adareida Manda, ඔබට ලංවී",
    "email": ""
  },
  {
    "Name": "පෝල් ප්‍රනාන්දු",
    "Birth Date": "24-Nov-51",
    "City": "මොරටුව",
    "Biography": "Madawela Hewage පෝල් ප්‍රනාන්දු (24 November 1951 – 16 November 2020), popularly as Paul Fernando, was a Sri Lankan musician and a Baila singer. Often referred to as the \"Prince of Baila\", Fernando became one of the most popular singers in Sri Lankan western music industry. Also, he is one of the leading artists dedicated to popularizing the art of Baila in Sri Lanka. Paul Fernando was born on 24 November 1951 in Moratuwa, Colombo, Sri Lanka as the youngest of the family. He completed education at Prince of Wales' College, Moratuwa. His father was Madawala Hewage Leon Fernando and mother was Kusumawathi Fernando. He had four elder brothers. He died on 16 November 2020 at the age of 68 at Kalubowila Hospital after undergoing treatment for an illness for a long period. An amateur singing competition was held at the Buddhist House in Moratuwa in 1969. It was a time when he was looking for opportunities to sing songs. With that focus, he applied for the Talent Sixty Nine Singing Competition where he later won the competition.",
    "Lyrics of a song": "ගොලු හදවත විවර කරන්න කොයිද හිතේ තදකරන් මට කියන්න කදුලු සලන්න ඉඩනොතබන්න\n\nමුවගින් සිනා සලනවා නෙතගින් බැලුමි බලනවා\n\nඉන් රහසක් පවසනවා වාගේ මටවැටහෙනවා දැඩි සෙනෙහසක් තියනවා එය හිතතුල තෙරපෙනවා\n\nඔබ තනියම දුක්වෙනවා වාගේ මට වැටහෙනවා\n\nගීයෙන් ඔබ අමතනවා මගෙ අදහස පවසනවා ඔබ නිහඩවම සිටිනවා මා හදවත වැලපෙනවා",
    "Songs": "Ahanna Me Kaparingna, Aida Pane Yanne Damala, Anun Ganama Soyala, Awe Wana Bambarek Wage, Demawupiyan Kiyana Nisa, Dona Kathirina Issara, Egoda Gode Mal Nelana Mal Ethano, Fernando Fernando, Gewal Gane, ගොලු හදවත විවර කරන්න",
    "email": ""
  },
  {
    "Name": "පියල් පෙරේරා",
    "Birth Date": "",
    "City": "රත්මලාන",
    "Biography": "",
    "Lyrics of a song": "ඔබ කැමති නම් මට කියන්න මගෙ දුක ටිකක් හරි නිවෙන්න ඔබ ඇයි ගියේ කියලා හදවත මගේ බිඳලා //\n\nඔබම තමයි පෙරදා මා වෙත ආවේ\n\nඔබම තමයි ආදරේ ගැන මට කීවේ ඔබම තමයි මගෙ ජීවිතේ එළිය කලේ\n\nඔබම තමයි අද මගෙ ලොව අඳුරු කලේ\n\nඔබ කැමති නම්....\n\nළඟ ඉන්නම් සැමදා ඔබමයි කීවේ පෙම් ගී වැල් ගොතලා ඔබමයි ගැයුවේ මගෙ තුරුලේ උණුසුම ඔබමයි පැතුවේ අද යන්න ගියේ මට නොකියම ඇයි කෙල්ලේ\n\nඔබ කැමති නම්.... //\n\nඔබ ඇයි ගියේ කියලා හදවත මගේ බිඳලා",
    "Songs": "Birthday Song, Lassana Hasarel, Manel Mal, Sal Mal wel, Sitha sanasuma denna sada, Pem Lowe Rema, SWENWELA GIYATH, ඔබ කැමති නම් මට කියන්න",
    "email": "piyal.perera @srilankasingers.com"
  },
  {
    "Name": "ප්‍රේමසිරි කේමදාස",
    "Birth Date": "25-Jan-37",
    "City": "වාද්දුව",
    "Biography": "Deshamanya Kala Keerthi ආචාර්ය ප්‍රේමසිරි කේමදාස (25 January 1937 – 24 October 2008) also known as \"Khemadasa Master\" was a Sri Lankan music composer. Exploring the various styles of music around the world Khemadasa endeavoured to develop a unique style of music. He combined Sinhala folk tunes, Hindustani music, Western music and many other streams of music in his compositions while adapting them to fit contemporary music. Khemadasa grew up in Talpitiya, Wadduwa and attended St. John's College Panadura and then Sri Sumangala College Panadura. Born the thirteenth child into a poor rural family on the west coast of Sri Lanka, Khemadasa started with nothing. There was no musical heritage in his family. He was self-taught, learning how to play on cheap bamboo flutes when he was only 6 years old. In all his life, Khemadasa would never receive formal training in music. As a teenager, he became a gifted flautist. Khemadasa was asked to come to the Radio Ceylon for an interview on the day he was scheduled to take his Senior School Certificate examination. He finished the examination much ahead of time and travelled to the audition. He passed the audition and became a member of Radio Ceylon. His two daughters Anupa and Gayathri now moved into father's stream.",
    "Lyrics of a song": "ලඳුනේ ලඳුනේ\n\nකවුරුවත් නැහැ කවුරුවත් නැහැ - එගොඩට යන්නට - එගොඩට යන්නට \nඉරගල වැටිලා - ඉවුර දෙපැත්තේ \nඅඳුර ගලනවා - පාරුව ඇතුලට\nලංතෑරුම කෝ ඔහෙ තිබුනාවේ කවුරුවත් නැ කවුරුවත් නැ \n\nදවසින් දවසම පාලම හැදුනා පාලම් මොලෙන් හෙන හඩ ඇසුනා කිරන කැලෑවේ කුරුළු කොබෙයියන් ගම හැරදා යන්න ගිහින්\n\nදෑතේ අතැගිලි හබලට ගෙවුනා ගෙනියන්නට බැරි මහ බර තිබුනා මෙතුවක් නොම ගිය බර අද දවසේ මට හිනැහීගෙන යනවා රහසේ \n\nකවුරුවත් නැ කවුරුවත් නැ//",
    "Songs": "Golu Hadawatha, Hemin Sare Piya Wida, Udumbara Hinahenawa, Udam Sark, Sulanga Wage Awidin (Ridee Nimnaya), Ammawarune, Nidhanaya, ලඳුනේ ලඳුනේ",
    "email": ""
  },
  {
    "Name": "ප්‍රින්ස් උදය ප්‍රියන්ත",
    "Birth Date": "13-Jun-70",
    "City": "ගාල්ල",
    "Biography": "ප්‍රින්ස් උදය ප්‍රියන්ත (13 June 1970 – 8 June 2017) was a Sri Lankan singer, composer and songwriter. Born in the rural village of Siripura, Nawadagala in Galle, Prince started his music career as a keyboard player in the early 1990s, with his inborn abilities. His father Eaton Fernando, was a former violinist in Sri Lanka Broadcasting Corporation, and also a former principal and a music teacher. His mother Rosalyn Palliyaguruge was also principal, who died in 2014 in a Dubai Hospital. Prince has one sister, Shiromi Priyangika, who cared for Prince until his death. He stated that, though he has not married, he had a relationship with fellow female singer Nirosha Virajini, which did not extend up to the marriage, however. Prince completed his education from Elpitiya Ananda Maha Vidyalaya and showcased his musical abilities at the time of school. His first music teacher was Nihal Gamhewa, but the classes were interrupted due to 1987–89 JVP insurrections. In 1990, Prince attended the Belwood Music Academy of National Youth Services Council and worked as a violinist, under Gamhewa. He completed Bellwood Diploma after three years along with fellow musicians such as Chandana Liyanaarachchi, and Jayasiri Amarasekara. With the completion, he asked his music teacher to write some songs for him. With that, Gamhewa wrote four songs for him, which included Pemwathun Sinase, Werala Konaka Hida, Adare Nam Ai, Sanda Kumariyak. These four songs were highlighted due to the usage of musical instrument Octapad for the first time in Sri Lankan music industry.",
    "Lyrics of a song": "සංගීත සාගරේ පෙම් සිහින මාරුතේ\nසන්සුන් හදක් නැවක් සේ ගිලේ මායාවකින්\nසංගීත සාගරේ ...................\nසංගීත සාගරේ\n\nකැකුළු මල සේ නැවුම් වී සිතක් මෝදුවේ\nසළෙල බඹරුන් ඇදී ඒ මලට ලොල් සිතේ\nරඟන තාලේ බලා ගයන ගීතේ අසා\nමත් වේවිදෝ\nසංගීත සාගරේ ...................\nසංගීත සාගරේ\n\nසිතට වහලෙක් නොවේ නම් කිරුළු පළඳයි ලොවේ\nඉක්මන් සුවේ සොයා යයි ගැඹුරු අවපාතයේ\nඈත දුර ගැන සිතා සිත් පහන් වේවි නම්\nජය මාවතයි\nසංගීත සාගරේ ...................\nසංගීත සාගරේ",
    "Songs": "Adai Amawaka, Adareta Kodukara, Ahinsakama Pujawak, Ahinsakawa Sanda Avidin, Amma Dilena, Anjalika Anjalika, As Deken Kandulu, Athamaru Kalath, Athugal Wiharaye, Dalu Pahane Sila, සංගීත සාගරේ",
    "email": ""
  },
  {
    "Name": "ප්‍රියා සූරියසේන",
    "Birth Date": "27-Oct-52",
    "City": "නාත්තන්ඩිය",
    "Biography": "M. L. D. Priyadharsha Suriyasena Liyanage (born 27 October 1952), popularly as ප්‍රියා සූරියසේන, is a Sri Lankan singer. Having emerged from the youth choir as a group singer, Suriyasena has been able to show his talents and sang several popular songs such as Atha Ranviman, Mata Wasana, Adaraneeya Neranjana, Ada Davase and Sudu Paravi Rena. He was born on 27 October 1952 to an up-country middle-class family, in Nattandiya, Puttalam district, Sri Lanka. His father was M. L. D Jemis Liyanage was a poet, from whom he got his musical talent. His mother was A. M. Podi Manike. He was the only son in a family of three. He had his primary education at Nattandiya Primary School and completed his GCE O/L and A/L at Madampe Central College in Puttalam district. In 1978 he married Thamara Kumari Weerasinghe who was also a music teacher. The couple has one son and three daughters. Lakshitha studied at Ananda College and learned music from Lionel Ranwala. Eldest daughter Minoshi is a doctor. The next daughter, Iroshi, is a manager at a private bank. The youngest daughter Gayashi is a management degree holder. Lakshitha is married to Miyuru Piyathilaka.",
    "Lyrics of a song": "සුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nපොත් පත් අහුරා\nමුදු ළැමට තුරුලු කරවා\nපොත් පත් අහුරා\nමුදු ළැමට තුරුලු කරවා\nපිරුණු සදක් සේ මහද දිලේ\nපිරුණු සදක් සේ මහද දිලේ\nයහලු යෙහෙළියන් අතරේ\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nමල් හිනා පිපී මුව මඩල පුරා රදවා\nමල් හිනා පිපී මුව මඩල පුරා රදවා\nමුතු අහුරක් සේ දසන් සලා\nමුතු අහුරක් සේ දසන් සලා\nඉර හද දහසක් පරදා\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ\nසුදු පරවි රෑන සේ පියාසලා\nපාසල නිම වී යොවුන් කුමරියන්\nපෙළින් පෙළට එයි\nඈ තාම නෑ . ඈ තාම නෑ",
    "Songs": "Adaraneeya Neranjana, Adare Kiyu Kisiweku, Al Hena Dige Suwanda Obe, Andura Andura Mage, Andura Andura Mage, Apasu Enawa, Api Eka Pedesaka, Aradana Pem Chaya, Asurin Mideela, Atha Dinayakadi-Renukage, සුදු පරවි රෑන සේ පියාසලා",
    "email": ""
  },
  {
    "Name": "ප්‍රියානි ජයසිංහ",
    "Birth Date": "10-Jun-67",
    "City": "පානදුර",
    "Biography": "ප්‍රියානි ජයසිංහ (10 June 1967 – 8 July 2018) was a Sri Lankan songstress and composer. One of the most popular artists in Sri Lanka, Jayasinghe has sung several popular songs of the Sinhala music industry including: Kandula Niwannam, Sundara Hadakata Dee and Aluth Sanda Awith. She was born on 10 June 1967 in Panadura, Sri Lanka. She completed education from Walana Mahanama Maha Vidyalaya, Panadura. Her uncle Rohana Weerasinghe is a musician and composer in Sri Lanka. She was married to Prabath Rasika Eaton, who later had a dispute with her. The couple had two sons. During her demise, she lived with her younger son Lochana Nimun, his wife Rashini Thakshila Fonseka and their baby, whereas her older son Loshitha Hasarel studied in Japan. Her husband worked as a cushion workshop assistant for many years. Although she has made a name for herself in the field as a popular singer, she is said to have received no support from her husband for her talent or for those activities. As a result, she was involved in music concerts and other art activities, nurtured her two children and fulfilled their responsibilities alone.",
    "Lyrics of a song": "කඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\n\nමල් පූදින්නේ දෑඟිලි අතරේ\nතැලී පෙලී මියැදෙන්න නොවේ\nමල් පූදින්නේ දෑඟිලි අතරේ\nතැලී පෙලී මියැදෙන්න නොවේ\nසෙනෙහෙ පුදන්නේ සෙනෙහෙ ලබන්නයි\nහිත රිදවා හඬවන්න නොවේ\nකඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\n\nසඳ පායන්නේ හිරු නැති ලෝකේ\nඝනඳුර දුරු කරවා ලන්නයි\nසඳ පායන්නේ හිරු නැති ලෝකේ\nඝනඳුර දුරු කරවා ලන්නයි\nසෙනෙහෙ පුදන්නේ අඳුරේ තනිවූ\nහිතකට එලියක් ලැබ දෙන්නයි\nකඳුල නිවන්නම් නෙත නොතෙමෙනවා නම්\nතනියට ඉන්නම් තනි නොකරනවා නම්\nමතකයෙ ඉන්නම් අමතක නොමවේ නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්\nසෙනෙහෙ පුදන්නම් හිත නොරිදනවා නම්",
    "Songs": "Aluth Sanda Awith Ahasata, Aththana Mal, Deepankare Koi Desen Awada, කඳුල නිවන්නම්, Mata Hithaganna Ba, Me Premaye Horawa, Numba Gena Thorathuru, Oba Werala Se",
    "email": ""
  },
  {
    "Name": "ප්‍රියන්කර පෙරේරා",
    "Birth Date": "",
    "City": "පන්නිපිටිය",
    "Biography": "",
    "Lyrics of a song": "කොමල ලියා, බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nගත සීතල පහස ලබා\nලැම රන්වන් සුවඳ සොබා\nමුව මියිරුන් ලැබුව මෙමා\nසිකුරුලියා...\nමාව දමා යන්න ගියා සිකුරුලියා...\nකොමල ලියා බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nනෙත ඇඳි රුව ඔබය සුදු\nඅද ඒ නෙත කඳුළු බිඳූ\nආදරයෙන් ඔබව හැදූ\nසිකුරුලියා...\nමාව දමා යන්න ගියා සිකුරුලියා\nකොමල ලියා බොලඳ ලියා\nමාව දමා යන්න ගියා\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...\nසියුමැලියා... සිකුරුලියා...",
    "Songs": "Ada Deviyan Apage, Adaraye Saman Wale, Adare Gana Ma Sthe, Adare Ran Dewole, Agada Sagaraye, Api Santhosen Inne, Aruna Udaye Pipen Mala, Asa Randuna Randuna Thanwala, Athithe Unna Hati, Dethun Wathawak Oba, සියුමැලියා සිකුරුලියා",
    "email": "priyankara.perera@srilankasingers.com"
  },
  {
    "Name": "පුන්සිරි සොයිසා",
    "Birth Date": "5-Mar",
    "City": "මොරටුව",
    "Biography": "Kala Bhushana පුන්සිරි සොයිසා, (born 5 March), is a Sri Lankan singer. Often known as \"The Tear of Breakup\", Punsiri has sung several popular hits since 1970s. He was born on 5 March as the second of the family with one elder brother, two younger brothers and one younger sister. He first studied at the village Buddhist mixed school up to the third class. Then he entered the Prince of Wales' College, Moratuwa for further education. At school he sang a song in every literary society. He is married to longtime partner Kumudika Perera. His wife lived in Egoda Uyana, Moratuwa whereas Punsiri also lived in Moratuwa for some time. Despite obstacles, we were married in 1978. They have three daughters. The eldest daughter Akna Pavani works in the Engineering Corporation. The second daughter Sathmini Buddhimala has graduated from the University of Jayewardenepura and is currently working in a private company. She passed the Visharada examination and studied music under Amarasiri Munasinghe at the Sanhinda Kalayatana in Rawathawatte as well as graduated from Bhatkhande Music University, India. The third daughter Vishodha Uvini works in the Electricity Board. In 2019, he held a concert at the Horana Shriapali under the name 'Nohandan Ladune'",
    "Lyrics of a song": "මා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\nමා තනියෙන් පෙම් කෙරුවේ ඔබ නෑ මට පෙම් කෙරුවේ\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\n\nහරි ලස්සණ අකුරුවලින් මුතු කැට වැනි මියුරු වදන්\nලියලා මට ආදරයෙන් දුන් සෙනෙහස සිහිනෙකි දැන්\nමුළු ජීවිතයම දුකකී කඳුළුයි දැන් මට අයිතී\nමා කඳුළින් ලියමි මෙසේ ................\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ\n\nමගෙ ඇස්වල කඳුළු කැට දන්නව දුක් වෙන තරම\nමට පෙම් කළ ආදරය ඇයි නපුරු වෙලා මෙහෙම\nමම වැඳ වැඳ යලි කියමී ඔබ විතරයි මට අයිතී\nමා කඳුළින් ලියමි මෙසේ ................\nමා කඳුළින් ලියමි මෙසේ එය අවසන් කරනු කෙසේ",
    "Songs": "Aadarei Kiyamin, Abindakata, Adara Hada Pathulen, Adarayen Apa, Adareka Wedana, Ae Giya Ae Giya Ma Dama Ae Giya, Agada Sagaraye, Ahenawanam Sitha Handana Tharam, Andakarayen Wasuna Atheethen, Apage Gathe Athi Tharuna Wise, මා කඳුළින් ලියමි මෙසේ",
    "email": ""
  },
  {
    "Name": "පුන්‍යා කත්‍රිආරච්චි",
    "Birth Date": "",
    "City": "පිලියන්දල",
    "Biography": "",
    "Lyrics of a song": "බකිනි ගහේ බකිනි මලින් පාර අසන්නේ\nකුරුන්ද ළග දෙල් ගහ යට නිවස තිබෙන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nකැකිරි වැලේ මල් පිපිලා ගේ පිළිකන්නේ\nඒ මල් පෙති වලින් ඔබට පවන් සලන්නේ\nකැකිරි වැලේ මල් පිපිලා ගේ පිළිකන්නේ\nඒ මල් පෙති වලින් ඔබට පවන් සලන්නේ\nදෙමාපියන්නේ වරද නොවෙන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nසේල වළලු රන් පවලම් නැතුවයි එන්නේ\nහදේ සුවද ආදරයයි අරගෙන එන්නේ\nසේල වළලු රන් පවලම් නැතුවයි එන්නේ\nහදේ සුවද ආදරයයි අරගෙන එන්නේ\nහනිකට එන්නේ\nහනිකට එන්නේ\nබකිනි ගහේ බකිනි මලින් පාර අසන්නේ\nකුරුන්ද ළග දෙල් ගහ යට නිවස තිබෙන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nකවදාවත් නාව නිසා හිත පැටලෙන්නේ\nමම ආවොත් දෙමාපියන් නැතිද බනින්නේ\nතනියමැ එන්නේ\nතනියමැ එන්නේ\nකවදද එන්නේ\nකවදද එන්නේ\nහනිකට එන්නේ\nහනිකට එන්නේ\nකවදද එන්නේ\nකවදද එන්නේ",
    "Songs": "Daasa wasagam oba nopenennata, Mata Mathakai Oba, Galuwa Deaye, Mata Nokiya, Kauru Kohe Sita, බකිනි ගහේ",
    "email": "Punya.Kathriarachchi @srilankasingers.com"
  },
  {
    "Name": "ආර්. මුත්තුසාමි",
    "Birth Date": "5-Jan-26",
    "City": "තමිල්නාඩු, ඉන්දියාව",
    "Biography": "Ramaya Muttusamy (5 January 1926 – 27 June 1988) was a prolific Sri Lankan music director and singer. He handled the music for most of K. Gunaratnam's productions. Muttusamy was born on 5 January 1926, in Nagercoil, Tamil Nadu, India, the only son of virtuoso musician Ramaya Baghwather. At a young age, Muttusamy was introduced to the violin and mastered the instrument by the age of ten. Muttusamy worked as the Assistant Music Director on the first Sinhalese film Kadawunu Poronduwa in 1941 under the tutelage of R. Narayana Iyer. He subsequently travelled to Sri Lanka and found work there as a member of the state-run Radio Ceylon's Tamil Orchestra (20 October 1952) and then with the Sundera Murugan Studio in Kandana built by producer Nayagam (1953). Enlisted by successful producer K. Gunaratnam, Muttusamy handled his first lead music direction for the 1953 Sinhalese film Prema Tharangaya. In the film he directed the Sinhalese playback singers Dharmadasa and Latha Walpola on what would be their debut as well. Subsequently he oversaw the direction for over 225 films including Ahankara Sthree (1953), Mathalang (1955), Sandesaya (1961), Allapu Gedera and Chandiya (1965) working with playback singers like the Walpolas, Mohideen Baig, J. A. Milton Perera, H. R. Jothipala, Angeline Gunathilake, Sujatha Aththanayaka, G. S. B. Rani and Narada Disasekara. He rejoined Radio Ceylon in 1958 and served with the organization until 1981.",
    "Lyrics of a song": "අමතක කරලමු පැරණි කතා එක්වෙමු ජාතික දියුණ පතා දැන දැන කිම බැක්‍ෂෙනුයේ වරදේ ලොව කළ කළ දේ පල පල දේ අමතක කරලමු පැරණි කතා එක්වෙමු ජාතික දියුණ පතා\n\nඑක දරු කැළ මෙන් සිටිමු මතු අමුණමු සමගියේ අනගි මුතූ යොදවා දුරදිග ඔබගේ මොළේ පෙන්වමු මිනිසෙකු සතු වූ\n\nඅමතක කරලමු පැර\n\nනව නිපැයුම් අපේ රටෙහි සදා නව යුගයක් අපි කරමු උදා සිරිලක් මවගේ අනාගතේ රැඳී තිබෙන්නේ ඔබේ අතේ\n\nසිරිලක් මවගේ අනාගතේ රැඳී තිබෙන්නේ ඔබේ අතේ\n\nඅමතක කරලමු පැරණි කතා..... එක්වෙමු ජාතික දියුණ පතා......//",
    "Songs": "අමතක කරලමු පැරණි කතා, Chandra Me Ra Paya Awa, Gamana Nonimei Lokaye Me, Ganga Yanne Koheda Gala, Honda Hondama Weya Lowa, Jeewithe Tharuna Kale Eka Se Norade, Mada Seetha Nala Rella, Madura Yame Suwadesa Me, Maga Bala Bala",
    "email": ""
  },
  {
    "Name": "රනිල් මල්ලවආරච්චි",
    "Birth Date": "12-Apr-82",
    "City": "කැලණිය",
    "Biography": "Ranil Mallawarachchi is a popular, well-known, singer from Sri Lanka. He is the son of musician Milton Mallawarachchi. Following his fathers foot steps he shot in to fame among the young music fans. In 1996 he did a song with his father, May Lowa Gemburui, for his maiden album. He started his pre-schooling when he was at the age of four. He later enrolled at Nalanda College in Colombo. In 1998 his father died; after that Mallawarachchi's music carrier was changed, because producers invited him to sing his fathers famous songs under their trade marks. He has released about 17 albums to date. In 2010, he moved to Australia with his family. He has 2 sons. Pavan Mallawarachchi steps of Music",
    "Lyrics of a song": "තනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ\nමගෙ පාළු ලෝකයේ තනිවූ මෙමා\nසක්විති රජුන් හමුවේ නැත හිස නමා\nසිතුවිලි මගේ හසුරා ගත හැක නමා\nමට දුක සිතෙන්නේ ඔබ ගැන තමා\nතනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ\nඔබෙ චේතනා අගනා මා සිත දනී\nඅවට ලෝකයේ බැලුම් විස කටු වැනී\nඒ කටු අපේ දෙහදේ ගැඹුරේ ඇනී\nගලන දුක් වේදනා රුධිරය වැනී\nතනිවී සිටින්නයි මා අදහස් කලේ\nඔබමයි සොයා ඇවිදින් එය වෙනස් කලේ\nපහදා කියූවත් නෑ සවන් යොමු කලේ\nවේදනා පිරී ලොවක් ඔබයි බිහි කලේ",
    "Songs": "Ada Heta Oba Ma, Ae Nowe Ma Soya, Ahimi Daruwo, Amba Yaluwo, Dothata Mal Gena, Eda Re Guwan Thotupaledee Ma, Kese Kiyannada Oba Ma Athahara, Madu Mala Lesa, තනිවී සිටින්නයි මා",
    "email": "ranil.mallawarachchi@srilankasingers.com"
  },
  {
    "Name": "රන්ජනී පෙරේරා",
    "Birth Date": "",
    "City": "කැලණිය",
    "Biography": "",
    "Lyrics of a song": "ශ්‍රි සම්බුද්ධ රාජා වඳිම්\n\nමා සෑසි තිලෝනා වඳිම්\n\nහද පුදසුන් සදා\n\nශ්‍රි බැතිමල් පුදා මා සෑසි තිලෝනා වදිම්\n\nඅංගුලීමාල නාලාගිරී\n\nලෝසතුන් රාග පාපෙන් පිරී අදමි පවීන් දැවූ දම් අමාවෙන් තෙමූ දම් රජාණන් වඳිම්\n\nසිව් සැකි සත් කෙලක් දුක දරා සිව් සුවේ පස් මරුන් මන් මරා පාරමී දම් පුරා බුදුවූ ලොව් තුරා දම් රජාණන් වඳිම් සිත් පුරා\n\nමුල් සෙවු වේදනා සාදනා ඉන් මිදූ සේක මේ ලෝ දනා අන්ධකාරේ නැසූ මිහිරි සදහම් දෙසු ලෝ පියාණන් වඳිමි සෑමද",
    "Songs": "ශ්‍රි සම්බුද්ධ රාජා වඳිම්",
    "email": "ranjani.perera@srilankasingers.com"
  },
  {
    "Name": "රෝහන බෝගඩ",
    "Birth Date": "15th September",
    "City": "පන්නිපිටිය",
    "Biography": "මාතර තෙලිජ්ජවිල ගම්මාන්යෙ සහොදර සහොදරියන් 09 දෙනක් සිටින පවුලක 08 වෙනියා වන රෝහන බෝගොඩ දකුණු පළාතෙන් බෝගොඩ පරපුරෙ සoගිත කේෂත්‍රයට පැමිණියෙ 70 දශකයේ මුල්බගයේදීය . පියා දේශීය ආදයම් පාලක දෙපාර්තමේන්තුවේ ප්‍රධාන ලිපිකරුවෙකු වස්යෙන් සේවය කර සිට දැනට අවුරුරුදු 15 කට ඉහත දී ජීවිතයෙන් සමුගත්තේය. පවුලේ බොහො දෙනෙක් අධ්‍යපන අමාත්‍යශයෙ ගුරු උපදේශකවරුන් (සoගිත ) පිළිබද උපාධිධාරියන් වෙති 1974 වර්ෂයේ ශ්‍රී ලoකා ගුවන් විදුලි සoස්ථාව මෙහෙයවු පිබිදෙන ගයක පරපුර වැඩසටහනේ ප්‍රථම ස්ථනය ලබා මේ සoගිත කේෂත්‍රරයට මුලින්ම පිවිසුන අතර 1975 වර්ෂයේ ශ්‍රී ලoකා පොලිස් දෙපාර්තමේන්තුවේ පොලිස් තුර්ය වඩක මන්ඩල්යෙ නිත්‍ය නිළධාරීයෙකු  වශයෙන් සේවයට බැදුන අතර අවුරුදු 03 ක සේවා කාලයෙන් පසු 1978 වර්ෂයේ එම රැකියවෙන් සමුගෙන 1978 මර්තු 01 වන දින සිට ශ්‍රී ලoකා ගුවන් විදුලි සoස්ථාවෙ වාදකයෙකු ලෙසත් සoගීත මෙහෙයවිමෙ කර්යත් සoගීත අoශයෙ පාලකවරයා ලෙසත් කටයුතු කර 2009 වර්ෂයේ ව්ශ්‍රම ලබා ඇත. එතන් සිට මෙම කේෂත්‍රයේ විවිධ අoශවල එනම් චිත්‍රපට කැසට්පට සහ ඒක පුද්ගල සoගීත ප්‍රශoග ගණනවක තබ්ලා වාදකයෙකු වශයෙන් 70 දශකයෙ අගභාගයෙ දී \"නෙතින් නෙත බලාලා\" ගීතයෙන් ජනතා ප්‍රසාදය දිනගෙන මෙතෙක් දිගු ගමනක් පමිණ් සිටි. \"නෙතින් නෙත බලාලා\",'ගoගා',මලක සුවද, \"නව රිද්ම\",'රෑ සද\" වැනි කැසට් පට හා සoයුක්තතැටි නිකුත් කර ඇති අතර චිත්‍රපට කිහිපයකද පසුබිම් ගායකයෙකු ලෙස කටයුතු කර ඇත.එනම් \"මා ඔබේ හිතවතා\",'ලදුනි ඔබ දෙවගනකී\",\"අනේ මාස්ටර්\",\"බොඩිගාඩ්\",\"ගුරුගෙදර\",\"මල්සර දොනි\",\"යුක්තියද ශක්තියද\",\"ඉන්ස්පෙක්ටර් ගීතා\", වැනි චිත්‍රපට වලය. ටෙලි නට්‍ය කිහිපයක ගීත ගයනා කර ඇති අතර සoගීත අධ්‍යක්ෂණයෙන්ද සහභාගි වී ඇත. එනම් \"පියඹන සල්ලි\",\"අම්මාවරුන්ගෙ දරුවො\",\"දෙවැනි අම්මා\" වැනි නට්‍ය ස්0ගීත අධ්‍යක්ෂණයෙන්ද කර ඇත. දැනට අයි ට්,ඇන් සුපිරි හපන ,දෙරන ඩ්‍රිම් ස්ටර්, අධ්‍යපන අමාත්‍යශයෙ සoගීත විනිසුරුවරයෙකු හැටියටද ජතික තරුණ සේවා සභාවෙ යොවුන්සම්මන විනිසුරුවරයෙකු ලෙසද දැනට කටයුතු කර්න්නෙමි",
    "Lyrics of a song": "ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා //\n\nහිරු සඳු ඇති තුරා සසර වසනා තුරා ඉන්නට බැහැ තරහා වෙලා ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා\n\nපෑව සෙනේ අමනාපෙ නිසා මෝදු වෙලා තිබුණාට වඩා // සිත සැනසුන් සාදනා ඔබේ හසරැල් මට වාසනා //\n\nඔබටයි මේ ආරාධනා\n\nඔබටයි මේ ආයාචනා\n\nතරහා උනත් දෙදෙනා ඊයේ තරහ නොවෙමු කිසිදා ආයේ // යළි නොම ඒ වේදනා ඔබේ හසරැල් මට වාසනා //\n\nහිරු සඳු ඇති තුරා සසර වසනා තුරා ඉන්නට බැහැ තරහා\n\nඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා // ඔබටයි මේ ආරාධනා ඔබටයි මේ ආයාචනා",
    "Songs": "දිවි කතරට, කන්දුලක් වෑටෙනම්, නෙතින් නෙත බලාල, පෙල රවටල, ඔබටයි මේ ආරාධනා",
    "email": ""
  },
  {
    "Name": "රූකාන්ත ගුණතිලක",
    "Birth Date": "5-Sep-59",
    "City": "කෑගල්ල",
    "Biography": "Mario Glory රූකාන්ත ගුණතිලක (born 5 September 1959), is a Sri Lankan singer, musician and songwriter. One of the most influential musical artists in Sri Lanka, Rookantha started his career as a solo singer in late 1980s after few stints as a keyboard player. He frequently performs duets with his wife, Chandralekha Perera. His daughters Raini Charuka and Windy are both singers. Rookantha is one of the most successful musicians in Sri Lankan pop and sentimental industry. He is known as the King of Pop amongst Sri Lankans. His albums have sold around 15,000 copies in Sri Lanka. He is known as the person who changed the Sri Lankan music industry in the 1980s with his songs. Rookantha was born on 5 September 1959 in Kegalle, Sri Lanka to a middle-class family. He loved music from a very young age. As a result, his parents sent him to a music teacher nearby to teach him to play the piano. He attended St. Mary's College, Kegalle for primary education. He learned music at his school, St. Anthony's College, Kandy from great musicians such as Stanley Peiris and Cyril Brown. He also did G.C.E. A/Ls after coming to the music field. Rookantha is married to singer and former actress Chandralekha Perera. ",
    "Lyrics of a song": "ආදර මගෙ ජේසුනී\nකලකින් ඔබ අමතමී\nකොහොමද ඔබගේ තතූ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබෙ දහමේ ගුණ නසා\nඅද ඔබ ළඟ වැඳ වැටී හඬමී\nමා හසුවී මාරුතේ\nමඟ වැරදී මාවතේ\nමේ ලියමන ලියමි මා සමිඳේ\nමහ කරුණා සාගරේ\nඔබ පමණයි ආදරේ\nසැනසුම මට දෙන්නකෝ සමිඳේ\nආදර මගෙ ජේසුනී\nකලකින් ඔබ අමතමී\nකොහොමද ඔබගේ තතූ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබෙ දහමේ ගුණ නසා\nඅද ඔබ ළඟ වැඳ වැටී හඬමී\nජේසුනි මම ආදරෙයි\nඔබෙ පෙම ඊටත් වැඩියි\nසැමදා මම ණයගැතියි ඔබට\nඔබ දුන් හැම දේටමත්\nමට දුන් නැති දේ හටත්\nතුති පුදනෙමි ආදරෙන් සමිඳේ\nආදර මගෙ ජේසුනී\nහමුවෙමු යළි මතු දිනේ\nදින දින වැජඹේ ලොවේ සමිඳේ\nසිතු සිතු දේ මම කළා\nඔබ අනුකම්පා කළා\nමම ඔබ ළඟ වැඳ වැටී හඬමී",
    "Songs": "ආදර මගෙ ජේසුනී, Adara Mal Pawane, Adu Kule Kiyala, Amara Pem Lathawe, Amba Damba Sewanali, Amma Kiya, Ananthayak Wee Obe Adare-Me Suramya Paradeese, Anatha Maruthe Kunatu Sagare",
    "email": "rookantha.gunathilake@srilankasingers.com"
  },
  {
    "Name": "රොෂාන් ශාන්ත බුලේගොඩ",
    "Birth Date": "",
    "City": "මහරගම",
    "Biography": "RoshanShantha Bulegoda is a popular, well-known, singer from Sri Lanka. He was educated at Nalanda College Colombo.",
    "Lyrics of a song": "එක් පෙති මලක් විය නුඹ මගේ අත් දෙකට\nනෙලා නොගත්තේ මගෙ බෝසත් කමට\nහැරගිය දිනේ නාවත් මා ගම් දොරට\nආවේ ඇයිද විරහී සිත අද්දරට\nවිශ්මිත ගමට අදහන්නට බෑ තවම\nමා හැර දමා නුඹ ගිය මග ගැන අරුම\nසතු කරගන්න මුල් පෙම නොපිදූ බැවින\nදුක්බර හිතට කීවෙමි නොහඬන ලෙසින\nඑක් පෙති මලක් විය නුඹ මගේ අත් දෙකට...\nසිටිනා කොදෙව්වක නුඹ සැප විඳී නම්\nම වෙතින් ලැබුණු ආදරයත් ලැබේ නම්\nමතකය නුඹට හිරිහැරයක් නොවේ නම්\nතව කුමකටද දුක් ගී කල්පනාවන්\nතව කුමකටද දුක් ගී කල්පනාවන්///",
    "Songs": "Daha Athe Duwana, එක් පෙති මලක්, Nihanda Arana, Oba malak, Sandak Nam, Deepika Thama Tharunai",
    "email": "Shantha.Bulegoda@srilankasingers.com"
  },
  {
    "Name": "රුක්මණී දේවී",
    "Birth Date": "15-Jan-23",
    "City": "නුවරඑළිය",
    "Biography": "Daisy Rasammah Daniels, known popularly as රුක්මණී දේවී (15 January 1923 – 28 October 1978) was a Sri Lankan film actress and singer, who was often acclaimed as \"The Nightingale of Sri Lanka\". She made it to the silver screen via the stage and had acted in close to 100 films, at the time of her death. Having an equal passion for singing as well as a melodious voice, she was Sri Lanka's foremost female singer in the gramophone era. After her death, she was awarded the Sarasaviya 'Rana Thisara'- Life Time Achievement Award at the 1979 Sarasaviya Awards Festival.",
    "Lyrics of a song": "මා ඔබ හමුවූ දා මේ හද නැළවූදා\nගැයු ගීතේ සිහිනේ රස වෑහේ\nරැව්දේ දෙසවන්හි දිවා රෑ සදා\n\nසන්තෝසේ ආසාවේ මහිමේ කියා\nමගෙ දෑසයි ඔබෙ දෑසයි පාවී ගියා\nපැතුවා සේ සිතුවා සේ හමුවී සොයා\nඅද ආයේ දුටුවා ඔයා\nමා ඔබ හමුවූ දා ................\n\nසැනසිල්ල නැළවිල්ල පිරිලා සිතේ\nඔබෙ බැල්ම මගෙ බැල්මෙ රැඳිලා ඇතේ\nසිත මාගෙ මල වාගෙ පුබුදා තියා\nඅද ආයෙ දුටුවා ඔයා\nමා ඔබ හමුවූ දා ................",
    "Songs": "Ada Handanawa Himiyani, Adara Nadiya Gala, Adara Paana Suda, Adaraya Nisa, Adarayai Karunawai, Alokaya Hama Thana Pathire, Anna Sudo Ara Pata Wala, Api Ekama Lowe, මා ඔබ හමුවූ දා",
    "email": ""
  },
  {
    "Name": "රූපා ඉන්දුමතී",
    "Birth Date": "",
    "City": "පිලියන්දල",
    "Biography": "Rupa Indumathi is a Sri Lankan musician and singer ",
    "Lyrics of a song": "කුරුල්ලනේ පැණි කුරුල්ලනේ\n\n- පාට පාට පැණි කුරුල්ලනේ මටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට ආසයි කුරුල්ලනේ\n\nකුරුල්ලනේ පැණි කුරුල්ලනේ\n\n(රුවන් තාරකා මැදින් පියාඹා සඳුන් සමීරේ පාවිලා)//\n\nසුරංගනාවන් දකින්න යන්නම් සඳෙන් එහා දිලෙනා ලෝක්කේ කුරුල්ලනේ පැණි කුරුල්ලනේ - පාට පාට පැණි කුරුල්ලනේ\n\nමටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට කුරුල්ලනේ පැණි කුරුල්ලනේ\n\n(නැවුම් පැතුම් පිරි හැගුම් මවාලා කොහෙන්ද ආරාධනා ගලයි)// \nසිතුම් සඳැල්ලේ බිගුන් කියන්නේ ඒ\n\nආසයි කුරුල්ලනේ)//\n\nරහසද\n\nමාගේ සුහදේ\n\nකුරුල්ලනේ පැණි කුරුල්ලනේ - පාට පාට පැණි කුරුල්ලනේ මටත් ඔබ වගේ ඉගිල්ලිලා - (යන්නට ආසයි කුරුල්ලනේ}// \n(කුරුල්ලනේ පැණි කුරුල්ලනේ)////",
    "Songs": "Deshayen Dese Bala, Eka Dawasak, Eka Gangaka Iwuru Deka, Eka Kude Yatin, Jeewithe Pura, Kurullane Peni Kurullane, Lowak Balannata, කුරුල්ලනේ පැණි කුරුල්ලනේ",
    "email": "rupa.indumathi@srilankasingers.com"
  },
  {
    "Name": "රෝහණ වීරසිංහ",
    "Birth Date": "18-Feb-49",
    "City": "මාතර",
    "Biography": "DR. Rohana Weerasinghe is a Sri Lankan musician, composer and singer. Weerasinghe was born on 18 February 1949 in Algiriya, Matara in southern Sri Lanka. He was the youngest child to his parents Henry Weerasinghe and Sepalin Weerasinghe. In 1954, Weerasinghe started schooling from Good Shepard Family Convent in Nuwara Eliya, and later moved to Vidyachakra Buddhist School Ruwan Eliya, Welimada Maha Vidyalaya, Pannipitya Dharmapala Vidyalaya and Gamini Maha Vidyalaya Nuwara Eliya. In 1977, Weerasinghe married to Leela Beatrice De Silva, a dancing teacher in profession. They had two sons, Kalindu Gajaba and Chirath Kanishka. His cousin daughter Priyani Jayasinghe was also a popular actress in Sri Lanka, who sang the popular hits Kandula Niwannam and Sundara Hadakata. She was killed at the age of 51 by her husband using a pair of scissors on 18 July 2018.",
    "Lyrics of a song": "තනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nසිව් වසරක පෙම් ගීතය ගොළු වෙලා ගියාදෝ\nසිව් වසරක පෙම් ගීතය ගොළු වෙලා ගියාදෝ\nඅළුත් ලොවක ඔබ සතුටින් කිරුළු පැළඳුවාදෝ\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්\nමායාවකි ප්රේමය මා හදවත රිදවූයේ\nමායාවකි ප්රේමය මා හදවත රිදවූයේ\nසෝ ගීයකි දුක් බර වූ සැනසුම කොහි වේදෝ\nතනි වෙන්නට මගේ ලොවේ පුරුදු පාළුවෙන්\nරැගෙන යන්න සොඳුරියෙ ඔබෙ සුවඳ මා ලඟින්",
    "Songs": "Aluyama Arunalu, Asiriwan - Upan Dina - Birthday Song, Atha Sansare, Bari Bara Usula, Bindunu Pemata, Degurunta Awanathawa, Gaman Magak Thibunada Me, Handa Kare Amba Mal Wata, තනි වෙන්නට මගේ ලොවේ",
    "email": ""
  },
  {
    "Name": "රනිදු ලංකාගේ",
    "Birth Date": "1982",
    "City": "කොළඹ",
    "Biography": "රනිදු ලංකාගේ is a Sinhalese R&B and hip hop artist who raised the international profile of Sinhalese RnB/pop. Lankage is the first Sinhalese artist to be played on BBC Radio 1 and the creator of the first Sinhalese single to be played on MTV and channel V and Z music India. He is a graduate in Economics from Yale University. Ranidu was educated at the Royal College, Colombo, where he was ranked, Third in Colombo district in the competitive General Certificate of Education Advanced Level exam in 2000 and went on to study economics at Yale University. He had represented Sri Lanka in squash at the Asian junior championships and played cricket for Royal College.",
    "Lyrics of a song": "හිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nකිසිදා අඳුරේ හඬවන්නෙ නෑ\nහෑඬුවත් සොඳුරේ රිදවන්නෙ නෑ\nදිවියේ මතු දා තනිවෙන්නෙ නෑ\nජිවිතේ හසරැල් ආදරේ අභිමණ්\nසිහිනේ සැතපී අපි ඉන්නෙ නෑ\nපවනේ සැඟවී අපි යන්නෙ නෑ\nමෙලොවේ කිසිදා වෙන්වෙන්නෙ නෑ\nප්රේමයෙ අරැමේ\nඑ ඔබේ මහිමේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nකිසිදා අඳුරේ හඬවන්නෙ නෑ\nහෑඬුවත් සොඳුරේ රිදවන්නෙ නෑ\nදිවියේ මතු දා තනිවෙන්නෙ නෑ\nජිවිතේ හසරැල් ආදරේ අභිමණ්\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ\nහිනැහෙන්නේ මං\nමේ විල් තීරේ පියමෙන්නේ\nඔබ එක්ක මං\nමේ ගංගාවේ පැද යන්නේ\nඔබ හින්දා මං\nමේ සංසාරේ සැනසෙන්නේ\nඅත ගන්න රැක ගන්න\nමට ඉන්න නිල් නයනීයේ",
    "Songs": "Adarei Kiyala, Ahankara Nagare, Amme Mathakainam, Athamita Kasi, Back To The Roots-Ins Mix, Club Eka Athule, Diviya Pura - Re Akaseta Aithi Kara, Gala Halen Nil Nadiya - Oba Magemai, Hachchiyak Wenna, Harde Keniththuwa Haduwen, හිනැහෙන්නේ මං",
    "email": ""
  },
  {
    "Name": "සහේලි රෝචනා ගමගේ",
    "Birth Date": "8-Mar-88",
    "City": "කොළඹ",
    "Biography": "Saheli Rochana Gamage (born March 8, 1988) is a Sri Lankan singer and a doctor. She holds the title \"Visharada\". She is noted for her popular song titled 'Ayubowewa, Maharajanani' (Great King long life to you) which is devoted to the Sri Lankan President Mahinda Rajapaksa and the three Armed Forces and police who fought in the Sri Lankan Civil War.",
    "Lyrics of a song": "සිව් මහ ඔඹුන් දුන් විවරනින් අපටත් රජෙක් හළව ඇතේ ඒ මහා රජුන් නෑ පෙළහරින් මේ දෙරණ එයත් කළේ ආයුබෝවේවා..... මහරනණෙනි....\n\nයන පටුන උතුරින් දකුණින් දෙවුන්දර තුඩුවෙන්\n\nනැගුණු දුක් හෝ සුසුම් නිවමන් සමඟ ඔල මහිමෙන් දෙස් විදෙස් අභියෝග වූ ගල මහරජාණෙනි ආයුබෝවේවා... මරණයෙනි....\n\nනැගෙනහිර අභිමන්\n\nසුපහන් උදානය ගෙන දුන් උතුරුකරයට වහන්නය දෙරණ දිනු දෙවිඳුන් දෙස් විදෙක් ඇස් මවිත කරවිය\n\nආයුබෝවේවා.... මහරජාණෙනි....",
    "Songs": "Abhimanawath Wu Sri Lanka (Deshayai Ran), Adai Awasan Dawasa Kumariya, Ahasa Sanda Tharu, Ahase Wathura Iwara Wela, Asarani Ma, ආයුබෝවේවා (සිව් මහ ඔඹුන්) , Bhawani Dayani (Gadaba Kula), Budu Eliya Vihiduwa",
    "email": ""
  },
  {
    "Name": "සනත් නන්දසිරි",
    "Birth Date": "15-Feb-42",
    "City": "ගොතටුව",
    "Biography": "Prof. Sangeeth Nipun Herath Mudiyanselage සනත් නන්දසිරි (born 15 February 1942) is a Sri Lankan singer, musician, music director, composer and playback singer. He is the current Chancellor of the University of the Visual and Performing Arts in Sri Lanka. One of the iconic singers in Sri Lankan music, Nandasiri has received several awards for his compositions in a career spanning more than six decades. He also composed the music to Sandamalige Kathawa, the first TV serial on Rupavahini. Nandasiri was born on 15 February 1942 in Gothatuwa, Sri Lanka as the third child to businessman and building contractor, H. M. William Perera and Dona Amalin Katugampola, a housewife. He completed his primary education from Gothatuwa Maha Vidyalaya and St. Matthew's College, Dematagoda for O/Ls. Then he attended Mahabodhi Maha Vidyalaya for Advanced Level and finally Stafford College to study English. During school times, he excelled as an athlete as well as a Elle player. He was a good short distance runner and won trophies in the 100 meters. Nandasiri has one elder sister, one elder brother, one younger sister and one younger brother, Nimal Chandrasiri. Nandasiri married singer Malkanthi Nandasiri née Peiris on 18 December 1971. He met Malkanthi during a vesak drama called 'Mara Parajaya' in 1967. They collaborated on songs before and after their marriage. When their son was born in 1971, he was a normal overweight child and put the name, Sanjaya Madhava. But the son died after three days. Their second child was a daughter, Nishamani Anuradha who was born February 14, 1974. Anuradha, also a musician, is currently back in Sri Lanka with her husband Nihal Wickramaedirisooriya. Born as the eldest daughter, Malkanthi has three sisters: Nirmala, Niranjala, Sakunthala and two brothers: Kumar, and Manoj. Nirmala Ranatunga is also a singer who was married to a prominent tabla player Wijeratne Ranatunga. Nirmala's daughter Sewwandi Ranathunga is also a singer. Nirajala Sarojani is also a singer who was married to late musician Abeywardena Balasuriya who died on 26 March 2010 at the age of 63. With the demise of Abeywardena, Niranjala has also retired from singing. Sakunthala worked at Veritas Radio in Manila. Manoj Peiris is a renowned tabla player and musician of Sri Lanka.",
    "Lyrics of a song": "දේදුන්නේ පාට පාටින් ආදරේ බැන්දු \nසංසාරේ වන්දනාවේ ප්‍රේමයේ ළන්දු \nසන්ධ්‍යාවේ නිම් වළල්ලේ මායාවී දෑස දැල්වේ \nකවුරුන්දෝ ඈ නොවේදෝ ඈ මගේ නේදෝ // \nදේදුන්නේ පාට පාටින් ...................\n\nගංගාවේ ගීතයක් වී ගිම්හානේ මේඝයක් වී \nසන්තාපේ අංගනාවී ඈ මාගේ නේදෝ \nතුන්කල් දකිනා ඇල්මෙන් රඳනා \nතන්හාවකින් ළං ළං වෙනා \nදේදුන්නේ පාට පාටින් ...................\n\nරන් මෙවුලේ නෙත් රැඳේවි පා යුග්මේ සිත් ඇලේවී \nමල් යහනේ දේවතාවී ඈ මාගේ නේදෝ \nදෑතේ පැටලී කාමී අඳුරේ \nකැන්දා ගනී මෝහනය වී \nදේදුන්නේ පාට පාටින්................//",
    "Songs": "Mulu Lowa Magen, Nube Suwanda Pirunu, Seetha Ra Wasanthe, Waradak Kalath, An Sithak Ithin Mata, Awulunu Gini Del, Bambaru Nodutu, Bo Maluwe Mal Suwandata Petali, දේදුන්නේ පාට පාටින්",
    "email": "sanath.nandasiri@srilankasingers.com"
  },
  {
    "Name": "සන්තුෂ් වීරමන්",
    "Birth Date": "5-Sep-77",
    "City": "කොළඹ",
    "Biography": "Santhush Weeraman was born on the 5th of September, 1977 to Nalaka Weeraman, a retired marketing director at Richard Pieris. He is the elder brother of the singer Dushyanth Weeraman. Santhush studied at Royal College, Colombo where he excelled at both music, art, & sports as well as academics. He completed his Bachelors degree, with a double major in Marketing and Management. Santhush Weeraman's mother hails from a musical family which influenced his entry to music from a young age. Santhush Weeraman and Bathiya Jayakody collaborated on a few projects, which led to the formation of BnS. They have been one of the most commercially successful music acts in Sri Lanka in the last two decades.",
    "Lyrics of a song": "චාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ\n\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\nපෙම් හැඟුම් මතකයේ රංචු ගැහුනා\nයටි හිතේ පොපියමින් හීන මැවුනා\n\nසන්සුන් සුසුම් ද කැළඹි\nඇයිද මොකදැයි ඇහුවා\nරාගයේ චන්ද්ර හැඟුමන්\nරණ්ඩු කෙරුවා\n\nමං කෙසේ කොයි ලෙසේ මුමුණ\nමේ ශෝක ගීතේ\nකවුරුවත් දන්නෙ නෑ දැන් මේ\nමං ඉන්නෙ හිරගේ\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\nයන්තමින් නුවනඟින් කඳුළු එබිලා\nදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවා\n\nදිවි ගිම් නිවෙන්න පැතුවේ\nමදුර ස්වරයයි ඔබගේ\nආදරේ හීනයක් නම්\nහැබෑ නොවෙනා\n\nමං කෙසේ දැවි දැවී ඉන්නෙ\nමේ වේදනාවෙන්\nඇස් අගින් ඔබ ලියූ කවි ගී\nමුමුණන්න මුවඟින්\n\nඔය මන්දහාසයෙන්\nසැනහේවි ජීවිතේ\nසෝතාප සඟවන්න\nඔබ එන්න ආදරෙන්\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ අවපසයි\nමං තවම සීතල කළුවරේ\n\nමේ කුළු මතින් ඇදී\nඔබ එන්න මා කෙරේ\nඔබ වේද මතුදාක\nමා ලබන රම්බරී\n\nචාන්දනී පායලා\nසීත සැලුවා මේ රාත්රියේ\nජීවිතේ හිස්කමින්\nතුන් යාමයේ\n\nහිත් පෑරුනේ සත්තකින් ඔබය\nහද රැන්දු සුරඹුන්\nඒ හැඟුම් කොයි ලෙසින් සිත්සේ\nපවසම්ද සොඳුරේ",
    "Songs": "Unmadini Hanguna, Ai Kale Adare, Anande Wahi Walawa-Hiri Poda Wassa, Apatai Me Mihithale, Ape Gam Gode, Baila Gamuda Remix Karala, චාන්දනී පායලා, Dedunna Sedi, Denna Dena, Gassana Danga Malla, Gum Nade Ranen Rane, Hiri Poda Wessa, Hitha Nabara Thaleta",
    "email": ""
  },
  {
    "Name": "ශිහාන් මිහිරංග",
    "Birth Date": "18-Mar-85",
    "City": "කොළඹ",
    "Biography": "ශිහාන් මිහිරංග Bennett (born 18 March 1985), is a Sri Lankan musician, composer and songwriter. Considered one of the best products of reality shows, Mihiranga often known as the \"Dream Boy\" of the youth in Sri Lanka. He became the youth sensation in 2000s after Namal Udugama in 1990s. Shihan was born on 18 March 1985 in Weliweriya as the eldest of the family. His father, Tyronne Bennet was a Sound Engineer, previously worked at Bahrain and mother Nilu Mallika is a housewife. He has a sister, Shanika Mihiravi. He studied at De Mazenod College, Kandana. Shihan married Gishni Clementa Silva on 25 February 2012. He applied to the first season of singing reality show Sirasa Superstar. It is the first reality show in Sri Lanka, where 12 male finalists were selected. Mihiranga came fifth place in the competition despite being the most popular star throughout the show. He sang mostly Rookantha Gunathilake's songs including, Dawasakda Hendewaka, Nihanda Maruthe and As Deka Piyana.",
    "Lyrics of a song": "අද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nපාළුව වී\nඅද මගේ\nහඬවන්නෑ ජීවිතේ\nපාළුව වී\nඅද මගේ\nහඬවන්නෑ ජීවිතේ\nඔබ දන්නෑ\nඅද මා\nඔබේ නමින්\nතනිවෙන්නෑ\nඅද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nසිත හැඟුමන් වේදනා\nමට නොකියා පාවුනා\nසිත හැඟුමන් වේදනා\nමට නොකියා පාවුනා\nඔබ නැති දා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nඅද තනියෙන් මා\nහඬන්නෙ නෑ මා\nමා දමා\nඈ ගියා කියා\nමා දමා\nසිත දුක් දෙන්නෑ\nඅද මට තනි නෑ\nඔබ නෑ කියා\nමා ළඟින්\nමා සිතින්\nඔබ ගියා කියා\nතරු නෙතු කී\nඒ කතා\nඅද රහසේ සැඟවිලා\nතරු නෙතු කී\nඒ කතා\nඅද රහසේ සැඟවිලා\nඔබ ගිය දා\nමා හඬවා\nමට නොකියා\nමා දමා",
    "Songs": "අද තනියෙන් මා, Asa Gatena Dasa Dahasak Nethu, Athi Mawa Rawatuwa, Daiwaya Ape, Dinaka Mage Divi Gamane, Es Deka Piyana-Remake, Hatharakendare palu, Hinahenna Sewwandiye, Hitha Handana Welawe, Klementina, Mage Wela Langa Unnu Oya",
    "email": ""
  },
  {
    "Name": "සමන් ද සිල්වා ",
    "Birth Date": "",
    "City": "මොරටුව",
    "Biography": "He is a veteran artist and a singer. A product of Nalanda College Colombo, Saman had conducted shows not only in Sri Lanka but all over the world",
    "Lyrics of a song": "නියරේ පිය නගලා\nමැණිකේ ඔබ දුර එනවා\nදැකලා වෙහෙස නිවී\n(සිත පිරුණා හද සෙනෙහස දැනුනා) //\n\nරන් ගොයම් කරල් පීදෙන ඔබේ දෙස නැමේ\nරන් රුවක් වගේ ඈතින් ඔබේ රුව මැවේ\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\n\nසුදු අතින් උයා මා වෙත ඇඹුල ගෙන ඔයා\nසෑම දා මෙසේ එනු මැන මල් සිනා සලා\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\nසිත පිරුණා හද සෙනෙහස දැනුනා ///",
    "Songs": "Aale Benda Mage, Neela Walawen, නියරේ පිය නගලා, Papara Papara, Pem Maligawe",
    "email": "saman.DeSilva@srilankasingers.com"
  },
  {
    "Name": "සම්පත් ශ්‍රි සෙනෙවිරත්න",
    "Birth Date": "",
    "City": "මොරටුව",
    "Biography": "ගයනා හා ර0ගන ශිල්පී සම්පත් ශ්‍රි සෙනෙවිරත්න මුල් වරට ප්‍රස0ග වේදිකාවට පිවිසියේමනුවර ලේක් සමාජ ශාලාවෙනි. බි ශ්‍රෙණියෙ ගුවන් විදුලි ගායෙකු වන් මොහු හින්දි ගී සදහා ද එක සේ ජන්ප්‍රියය. ඔහු පිදුම් ලද සම්මනයන් අතර: 1983 රාජ්‍ය සම්මනයෙන් ද, 1984-1992 යෞවන් සම්මානෙයෙන්ද, 1996 කලභුෂණ සම්මානෙයෙන්ද, 1992 ස්යොනාරා සම්මානයන්ද වේ. ච්ත්‍ර පටපසුබිම් ගයෙකුද වන මොහු 1985 වර්සෙයෙ සුන්දර රාත් නමින් ඒක පුද්ගල ගී ප්‍රසන්ගයක් ද පවත් වන ලදි විවිධ විදෙශයන්හි ස0චාරය කර ඇති මොහු සුමලි විජෙරත්න නෑමත්තීය සමග විවහකය",
    "Lyrics of a song": "නියරේ පිය නගලා\nමැණිකේ ඔබ දුර එනවා\nදැකලා වෙහෙස නිවී\n(සිත පිරුණා හද සෙනෙහස දැනුනා) //\n\nරන් ගොයම් කරල් පීදෙන ඔබේ දෙස නැමේ\nරන් රුවක් වගේ ඈතින් ඔබේ රුව මැවේ\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\n\nසුදු අතින් උයා මා වෙත ඇඹුල ගෙන ඔයා\nසෑම දා මෙසේ එනු මැන මල් සිනා සලා\nආදරේ දැනී මා හද සෝ සුසුම් නිවේ\nවාසනාව පා වෙලා ගියා\nනියරේ පිය නගලා.................\nසිත පිරුණා හද සෙනෙහස දැනුනා ///",
    "Songs": "විදුලියක් වගේ, පහන් වෙන්න, ඇසුරින් මිදුනත්, කොම්පඤ්ඤ වීදියේ",
    "email": "Sampth.SriSeneviratna@srilankasingers.com"
  },
  {
    "Name": "ශානිකා වනිගසේකර",
    "Birth Date": "",
    "City": "තිඹිරිගස්කටුව",
    "Biography": "",
    "Lyrics of a song": "මංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ කව්රුන් කවදා මා කැන්දාගෙන යාදෝ//\n\nමව්පිය සෙවන්නේ මා තනි වේවි මංගල යහනේ ඔබ සැතපෙවි මගෙ හිමි සදු කොහෙදො\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ..\n\nදින සති ගෙවිලා කල් ගත වීලා නෑ තව ආවේ ආදර සිතුවිලි සාගර පතුලේ සැගවී යාවේ පෙම් සිතිවිල්ලෙ සිත කැලඹිල්ලෙ සිහින තොටිල්ලේ මාලතවිල්ලේ මගෙ හිමි සදු කොහිදො\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ..\n\nකල වයසත් ගත වීගෙන යනවා ගෙදරට යාලු මල්සර දුන්නෙන් ආල වඩන්නේ කෙදිනද යාලු හිමි සදු හමු වී පෙම් මල පීදී සලු පිලි දෑතින් කුමරු වඩීවි රෑ සයනේ සිහිනේ\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ...\n\nමව්පිය සෙවනේ මා තනි වේවි\n\nමංගල නැකතේ දීගෙක ගිය මගෙ නංගෝ...",
    "Songs": "Oba Mauwe, Sidi Bidee Adare, Amma, Hitha Gawa Nawathinna, Ingi Bingi Karana, මංගල නැකතේ",
    "email": "Shanika.Wanigasekera@srilankasingers.com"
  },
  {
    "Name": "ශෙල්ටන් මුතුනමගේ",
    "Birth Date": "",
    "City": "මීගමුව",
    "Biography": "",
    "Lyrics of a song": "මහ සයුරේ ගැඹුරු දියේ ගෙවන පිනේ සත්තාඥා ශෝක නැවුල් නැහැ අපේ සිනේ සම්පත් සොයාලා ඔරුවේ නැගිලා අපි වෙරළ බලා පදිමු යාළුවේ\n\nඑලනා දැල මාළුන් පිරිලා සිතනා ලෙස වාසිය ලැබුනේ. හෙට හිරු නයනා දිනේ දිවි රැක දෙන්නටයි අල්\n\nමේක තමා ශෝක නැති මුහුදු විනේ\n\nමහ යුරේ.......\n\nදියඹේ රැය මේ ලෙස ගෙවලා\n\nසැනසීමෙන් ආපසු එන්නේ\n\nසැනසුම ආහ්ගේ ලෝකයේ අඹු දරුවන්ගෙ ආදරේ\n\nමේක නවා ශෝක නැති මුහුදු විනේ //\n\nමහ යුරේ.......//",
    "Songs": "SMaha Sayure Gamburu Diye, Mal Sinahawakin Obe Muwe, Me Dew Medure, amawa Illa, Wagu Nagen Sitha, මහ සයුරේ",
    "email": "shelton.muthunamage@srilankasingers.com"
  },
  {
    "Name": "ශර්ලි වයිජයන්ත",
    "Birth Date": "",
    "City": "ඉඹුල්ගොඩ",
    "Biography": "Shirley Waijayantha is one of the Popular Sri Lankan musician and singer",
    "Lyrics of a song": "ඈත සිතිජයේ හැඩට රුවින් දිලෙන තරුව ඔබ නම් මේඝ වලා සළු පට අතරින් මම ඔබ වෙත එන්නම්\n\n\nඉරට මුවාවෙන් සඳට මුවාවෙන් අපි ඉමුපිළිසඳරේ රන්දෝලාවෙන් කැඳවා යමි මම කුමරිය ඔබ මාගේ\n\n\nසඳළු තලාවේ මුනින් තලාවේ. කඳුලැල් පිරුනු නෙතින් සමුගන්නම් මම කුමරිය ඔබගෙන් ආයෙත් දකිනු රුසින් ඈත. තුෂාරා බිඳු අතරේ පිපුනු කසුම ඔබ නම් සඳ මඬලේ සඳ කුමරියනේ මම ඔබ සුරකින්නම් මම ඔබ සුරකින්නම්",
    "Songs": "Andara Kale, ඈත සිතිජයේ, Dora Kauluwen, Kawadada Aye Enne, Ma Hada Salena",
    "email": "shirley.waijayantha@srilankasingers.com"
  },
  {
    "Name": "සෝමසිරි මැදගෙදර",
    "Birth Date": "8-Nov",
    "City": "වලපනේ",
    "Biography": "සෝමසිරි මැදගෙදර (born 8 November), is a Sri Lankan singer. Having emerged from the youth choir as a group singer, Medagedara has been able to show his talents and sang several popular songs such as Sandai Tharui, Asa Imu Api, Issara Bedi Pema, Obage Dothin Pidu and Mathu Muthu Wasse. Medagedara was born on 8 November in Theripehe village, Walapane in Nuwara Eliya as the youngest child of a rural family. His father Medagedara Vidyaratne was a farmer. His mother Rankiri was a housewife who helped father for agriculture. Somasiri has five elder brothers. He completed education from Theripehe Siddhartha Vidyalaya. He learned music in the school under the teacher M.M.K Tissa. He is good at reciting Pel Kavi and Virindu songs in the village. He was married to longtime partner Neela Seneviratne. She met Medagedara in 1984 while working as an Assistant Youth Service Officer at the Maharagama Youth Center after leaving the Bellwood Aesthetic Resort. The couple has two sons – Yasas and Sahan Dhanushka; and one daughter, Yashoda Rasanjali. Yasas is also a singer and a sound engineer.",
    "Lyrics of a song": "මුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා\nපාළුවේ වැහි බීරමේ\nතනිවී බලා හිඳින්නේ\nකාටදෝ\nපවසන්නකෝ\nඔබගේ සෙනෙහෙ පුදන්නේ\nමා ලැබූ සිත් වේදනා\nඇයගේ ලොවේ පෙරදිනේ\nනෑ මැකී මතකෙන් මගේ\nඑය මා සිතේ දරන්නේ\nමුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා\nජීවිතේ හැම කාලයේ\nඔබගේ ලොවේ රැඳෙන්නේ\nරෑ දිවා දුක හා සැපේ\nහිඳිමි පලා නොයන්නේ\nමේ ලෙසේ තනි ජීවිතේ\nසැමදා ගෙවා පතන්නේ\nආදරේ පිළිගන්න බෑ\nයලි මා මුලා නොවන්නේ\nමුතු මුතු වැස්සේ\nපට කුඩයේ තනිවෙලා\nසුදු මුතු මැණිකේ\nකොහි යන්නේ සැරසිලා\nතෙමි තෙමි වැස්සේ\nඇයි ඉන්නේ හිනැහිලා\nයමු අපි හනිකේ\nඑක කුඩයේ සැඟවිලා",
    "Songs": "Adara Suba, Adaren Pathu, Ahinsakaviya Obata Nowe, Apa Ekkala Sarasavi, Aradanawan, Asa Imu Api, Asarana Sithakata, Atha Ime Sita, Bakmase, Battikurulla, මුතු මුතු වැස්සේ",
    "email": "somasiri.medagedara@srilankasingers.com"
  },
  {
    "Name": "සුජාතා අත්තනායක",
    "Birth Date": "12-May-42",
    "City": "කැලණිය",
    "Biography": "Kala Suri Visharadha ආචාර්ය Mudunkotuwa Munasinghe Arachchige Sujatha Perera (born 12 May 1942), colloquially known as සුජාතා අත්තනායක , is a Sri Lankan songstress and playback singer. She is a prominent playback singer in Sinhala cinema and also in Sri Lankan and Indian Tamil cinema. Considered as the golden bell of Sinhala music, she holds the record for the most number of cassettes produced by a Sri Lankan songstress with more than 115 cassettes in a career spanning more than seven decades. She is the first female music director in Sri Lanka. She contributed for nearly 400 Sinhala films and 20 Sri Lankan-Indian Tamil Films as a playback singer. She sang more than 6000 Sinhala songs and more than 1000 songs in 9 different languages. She was born on 12 May 1942 in Kelaniya as the third of the family with five siblings. Her father Mudunkotuwa Munasinghe Arachchige Dharmadasa Perera was a police sergeant. Her mother Gertrude Margaret Wolboff aka Vimala Kantha was a tower hall actress and singer. She started education in 1947 from Wedamulla Maha Vidyalaya, Kelaniya. She has two sisters and two brothers. Her sister Ranjani Perera is a renowned dance teacher and younger brother Susil Perera is a popular comedian and a musician. She is married to Navaratne Aththanayaka. She met Navaratne at the State College of Music. The couple has three sons - Hely Sajeewa, Chanaka, Samin. Her second son Captain Chanaka Sanjeewa died on September 25, 1992 in Pooneryn during Eelam War II. Since his death, Aththanayaka quit from singing and start to wear white sarees. After his son's death, she left Sri Lanka for America in 1992. Due to the huge fan demand, she performed a series of successful concerts titled Jeevana Vila Meda in 2012.",
    "Lyrics of a song": "ඉතිපි සෝ භගවා අරහං සම්මා සම්බුද්ධෝ...\nසම්මා සම්බුද්ධෝ... සම්මා සම්බුද්ධෝ...\n(මල් සුගන්දේ දම් සුගන්දේ සිල් සුළං රැල් පාවෙලා\nසම්බුදුන් සම්භාවනීයයි සාධු සාධු වන්දනා) //\n\n(මිහින්තලාවයි දහම් අමාවයි ශාන්ත අනුබුදු නාමයයි\nකාට කාටත් මේ කියන්නේ ශාසනේ ඉතිහාසයයි) //\n(රත්නමාලි සෑ රජුන්ගේ දෙව් බඹුන් පූජා ලබයි\nමේ මහා ගල් මුල් කියන්නේ ඒ උතුම් අභිමානයයි) //\nමල් සුගන්දේ දම් සුගන්දේ …………….\n\n(රැල් නගා හෝ ගා ගලන්නේ ජාතියේ ජය පානයයි\nසිංහලේ විස්මන් කියන්නේ මේ පොළොන්නරු දේශයයි) //\n(දා ගැබයි මහ මේඝයයි නිල්වන් ගුවන් ගැබ යා වුණේ\nගල් කුලින් සිත්තම් වුණාදෝ මෙත් සිහිල් කරුණා ගුණේ) //\nමල් සුගන්දේ දම් සුගන්දේ …………….\n\n(මහා රජුන් තුන් සිංහලේ එහෙමයි එදා දස්කම් කළේ\nඒ උතුම් දහමෙන් තමා ලේ මස් පවා විස්කම් කළේ) //\n(ධීරවීරයි පූජනීයයි නෑ නිමක් ගුණ ගායනේ\nසිව් මහා දෙවිදුන් රකීවී මේ අපේ බුදු ශාසනේ) //\nසිව් මහා දෙවිදුන් රකීවී මේ අපේ බුදු ශාසනේ ///",
    "Songs": "Adara Kadulali Dasa, Adare Charika, Adare Kalpana, Adare Kathandare, Adare Mandire Sandalu Thala Eliwela, Ade Obage Upandinaye, Ae Danda Dige, Aganthuka Kurulla Kohendo Awilla, මල් සුගන්දේ දම් සුගන්දේ",
    "email": "sujatha.attanayake@srilankasingers.com"
  },
  {
    "Name": "සුනිල් එදිරිසිංහ",
    "Birth Date": "19-Dec-49",
    "City": "කොළඹ",
    "Biography": "Patikirige සුනිල් Jayapreethi එදිරිසිංහ (born 19 December 1949) is a Sri Lankan classical musician. Edirisinghe won the presidential award for playback singing in 1983 for \"Maya Miringuva Pirunu Lo Thale\" from Adhishtanaya. He was awarded the Swarna Sankha Award for playback singing in 1988 for \"Thurulaka Hurathal\" from Mangala Thagga and in 1990 for \"Walakulak Gena Muwa Karamu\" from Saharave Sihinaya. He has also won the Sarasaviya Award for playback singing in 1988 for \"Thidasa Pure\" from Sandakada Pahana and in 2002 for \"Poronduwa\" from Poronduwa. Edirisinghe was born the youngest of seven children to Patikirige Edirisinghe and Ushettige Elizabeth Perera; he grew up in Waragoda Kelaniya amongst a blooming rubber industry. Edirisinghe began his schooling at Sri Dharmaloka Vidyalaya in 1955. He moved on to Sapugaskanda Maha Vidyalaya in 1968 and subsequently Delgoda Kalyana Pradeepa Pirivena where he studied for his A/L examamination. After completing his secondary education in 1969, Edirisinghe began working for the Government Printing Corporation. He debuted as a playback singer that year singing \"Sandakada Pahana\" for his brother Satischandra's film Matara Achchi. The song was composed by Victor Ratnayake and written by Wally Nanayakkara. Edirisinghe studied music at Visharada P.V. Nandasiri's Academy of Music and University of Laknaw, India in the early 1970s. In 1975 Edirisinghe graduated with first class honors from the prestigious Bhathkhande Academy of Music in India. He joined the Sri Lanka Broadcasting Corporation soon after. In 1980 Edirisinghe released his first cassette Chandra Mandala. To celebrate his 70th birthday, he has organized a felicitation ceremony will be held on 19 December 2019 at 3 pm at Sri Lanka Foundation Institution. Meanwhile, a book titled The Spiritual Tune of the Sunil with a scholarly exploration of what he has done with singing is published by Samudra Wettasinghe. Another book, written by Pushkara Wanniarachchi under the title Sunila Siritha - Sunil Edirisinghe Divi Sariya. In 2021, he released his first L.P. album with the tile \"Sunila Yamaya\". It features a concert presentation with eighteen popular songs and a few short dialogues.",
    "Lyrics of a song": "පාරු පාලමෙන් කොලඹට\nගැල් පේලිය සැපත්\nඋනාගෑස් පහට ලංවෙනකොට\nඅපි හොදටම හවස් උනා\nසෙක්කු වීදියේ කම්බා\nදැක උබ මට මතක් උනා\nකයිමන් දොර කොඩ ඉදපං\nමං එනතුරු සෙලෙස්තිනා\nකොලබ රටේ ඉපදුනාට මටම ඔබින සෙලෙස්තිනා\nබේරෙ වැවට හද පෑව්වා වාගේ මට උබේ සිනා\nකවාකුරුත්තාව ඇදං මුතු දෙපොටක් ගෙලේ දමා\nසාන්ත බස්තියන් ඇලේ පාරු පදිමු සෙලෙස්තිනා\nමහ මංකඩ කවි මඩුවක් හෙට හවසට පැවැත් වෙනා\nනං දරාපු කවි කාරයො එහි එන බව කතා උනා\nට්රෑම් කාර් එකේ ගිහින් කවි අහමුද සෙලෙස්තිනා.\nඉංගිරීසි රජින වගෙයි මට නම් උබ සෙලෙස්තිනා",
    "Songs": "Sanda Eliye, Sudumudu Shinayak, Hemihita Mata Ingi Bingi Pala, Sandu Illa, Samanala Siripa, Ada Deegeka Giya Nuba Mata, Ada Ipadunu Nawum Lowata, Ahasa Polawa Watapitawa, Ahasin Polawata Kada Watilada, Aluth Wassak, Amme Pembara, Andahere Handata Kan Demin, Andara Waten Ebena Sundari, පාරු පාලමෙන් කොලඹට",
    "email": "SunilEdirisinghe@srilankasingers.com"
  },
  {
    "Name": "සුනිල් පෙරේරා",
    "Birth Date": "14-Sep-52",
    "City": "නාරාහේන්පිට",
    "Biography": "Uswatta Liyanage Ivor Sylvester Sunil Perera (14 September 1952 – 6 September 2021), popularly as සුනිල් පෙරේරා, was a Sri Lankan vocalist, guitarist, songwriter and composer. Described as one of the most influential musicians in Sri Lankan music history, Perera was the leader and the lead vocalist of The Gypsies. He was associated with Sri Lanka's baila genre, and gained the nickname \"Baila Chakravarthy\". Perera was born on 14 September 1952 in a family with ten siblings. His father, Anton Perera, was in the military before becoming a musician and forming the original Gypsies band. Anton was a clerk at the government Postal Department and also run a sweet production company called \"Glucorasa\". His mother was Dorine Perera. He started his education at St. Sebastian's College, Moratuwa until grade four and then until finishing school in the St Peter's College, Colombo. During his school days he was also a member of the college band. When he was 11 years old, he became a guitarist. Perera was married to Geetha Kulatunga who was born on 18 March 1967, whom he met while she was studying for her O/L classes. She also meets Sunil while he is attending a concert. Kulatunga's father, Mahinda, is a sub-inspector with the Sri Lanka Police. On 25 October 1981, Perera was arrested by police in Homagama following reports from Kulatunga's parents that he had abducted her; the case was later dropped. When Kulatunga was aged 16, she and Perera got engaged. He had two sons: Sajith and Gayan, and two daughters: Rehana and Manisha. Eldest son Sajitha is married to the daughter of famous singer Dalreen Suby. His younger son, Gayan is a musician who formed the band \"Daddy\". His nephew, Lanthra Perera is also a musician and the founder-member of the band \"Doctor\". In August 2021, Perera tested positive for COVID-19 and rumors of his death started circulating on social media. In spite of treatment, on 5 September, he was re-admitted to hospital due to pneumonia and died in the early hours of 6 September 2021, one week before his 69th birthday.",
    "Lyrics of a song": "අනං මනං බෙහෙත් වලට ඇයි ගෙවන්නේ සල්ලි (ලොකු සල්ලි)\nඕන ලෙඩක් හොඳ වෙනවා බොන්න කොත්තමල්ලී (කොත්තමල්ලී)\nරුමේනියාවෙළු තියෙන්නේ හොඳම කොත්තමල්ලී\nලංකාවට ගෙන්නන්නේ අපේ අමල් මල්ලී (ලංකාවට ගෙන්නන්නේ අපේ අමල් මල්ලී)\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඔය ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ\nපොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nකොත්තමල්ලී\nතරුණ වෙන්න සමහර අය විටමින් පෙති බොතී (විටමින් බොතී)\nඑක්සසයිස් කරලා කරලා සමහරුන්ට හතී (අනේ හතී)\nඔය අරවා මේවා මොකුත් නොකර කොල්ලා වගේ ඉන්නේ\nමම තාමත් උදේ හවා කොත්තමල්ලී බොන්නේ\n(පනහා පැනලා උනත් එයා ෆිට් එකේම ඉන්නේ)\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඔය ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ පොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\n(මොනවද මල්ලි)\nකොත්තමල්ලී\nබොන්න නංගි මල්ලි, සැවොම කොත්තමල්ලී\nඅනේ ලෙඩට දුකට ඔබට පිහිට වෙන්නේ කොත්තමල්ලී\nඅපේ පුංචිකාලේ පොඩි උණක් හැදුන වේලේ\nමට මතක් වෙනවා අම්මා කොත්ත්මල්ලී පෙව්ව කාලේ\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nබොමු අපි කොත්තමල්ලී, මොකටද විස්කි බ්රැන්ඩි\nඕන නෑ සෝඩා, සැන්ඩි කොත්තමල්ලී\nඅයිස් කැට එපා මල්ලි, උණු උණු වෙම බොන්න මල්ලි\nබිව්වට කොත්තමල්ලී ඩෝප් වෙන්නේ නෑනේ මල්ලි\nඅපට හැදුණ හැම ලෙඩටම අම්මා දුන්න එකම බෙහෙත\nකොත්තමල්ලී\nමතට තිත",
    "Songs": "Adannepa Hithannepa, Adara Raththarane, Ahaganna-Owath Wadada, Aiyai Malli, Amma Amma Me Mata, Athamita Kasi, Aththa Panaththa, Cricket Mach Eka, Hina Hina Hina Wenna Hina, Hiru Kumarun, බොමු අපි කොත්තමල්ලී",
    "email": ""
  },
  {
    "Name": "ටි.එම්.ජයරත්න",
    "Birth Date": "13-Apr-44",
    "City": "දොඩන්ගොඩ",
    "Biography": "Tennakoon Mudiyanselage Jayaratne, also known as ටි.එම්.ජයරත්න (born 13 April 1944) in Dodangoda, Sri Lanka is a popular Sri Lankan vocalist and a violinist. He has received the Presidential Award of Sri Lanka in 1978, 1979, 1980 and 1987. In 2006 Jayaratne was awarded the best male singer award at the Raigam Tele Award Festival. Jayaratne studied at prestigious St.Anthony's College, Kandy and Maliyadeva College in Kurunegala. He was drawn into singing by the head of the Folk and Research unit at the Broadcasting Corporation C.J.S. Kulathilaka who asked him to vocalise several Sinhala folk songs that included \"Gana Thel Sadun\" to be broadcast over the radio. He recorded his first song in 1970. Jayaratne debuted as a playback singer with \"Lahiru Dahasak\" written by Sunil Ariyarathne and composed by Premasiri Khemadasa. In 1978 he released his first cassette Tharanga Volume - 01. At present, he has given his golden voice to 79 films. Among these films, Bambaru Awith of Dharmasena Pathiraja and Hansa Vilak of Dharmasiri Bandaranayake are considered as the best ever films in Sri Lankan history. In 1980 Jayaratne dueted with Sunila Abeysekera on \"Hemin Sare Piya Vida\" for the movie Hansa Vilak. The song was written by Dharmasena Pathiraja with music by Premasiri Khemadasa and became a popular song in Sri Lanka. His duets with Neela Wickramasinghe also became hugely popular hits. Also he has composed music for some songs but he achieved fame as a talented vocalist.",
    "Lyrics of a song": "වළා තීරයෙන් එහා කොහේද ලෝකයක්\nසොයා ඇදෙන් පැතුම් බිඟුන් අපේම ලෝකයක් - අපේම ලෝකයක්\n\nතරංගයක් ලෙසින් ඇදී බිඳී නොයන් සිතින්\nවසන්තයක් ලෙසින් උදාව එන්න ජීවිතෙන්\nවළා තීරයෙන් එහා ...........\n\nසිහිල් සහන් සුසුම් සරින් පවන් රොදක් ලෙසින්\nනැවුම් පැතුම් අරන් වඩින්න පෙම් උයන් දොරින්\nවළා තීරයෙන් එහා ...........",
    "Songs": "Adath Wassa Wahina Sande, Ae Neela Nethu Sala, Ahasa Usa Thuru, Akase Nisolmane, Akeekaru Hinawen, Amathaka Wenne Na, Ambare Dili Dili, Amma Sandaki, Anantha Sagaraye, Andara Yaye Gindara, වළා තීරයෙන් එහා",
    "email": "tm.jayarathne@srilankasingers.com"
  },
  {
    "Name": "උමාරියා සිංහවංශ",
    "Birth Date": "5-Jan-94",
    "City": "කොළඹ",
    "Biography": "Umaria Binthy Ayesha Sinhawansa (born 5 January 1994), popularly as උමාරියා සිංහවංශ, is a Sri Lankan pop, R&B and jazz singer. She is the youngest musician to be ever awarded A-Grade by Sri Lanka Broadcasting Corporation. Born in Colombo, Sri Lanka, Umaria began her music career at age 11 in the 2005, performing with her sister at various stages. She made her debut as a playback singer in the film Asai Man Piyabanna. And also she has won silver awards at Pan Asia Music International Music Competition and the Crimea Music Fest international competition. In 2020, her single \"Manda Pama\" was a super hit in Sri Lanka and reached 10 million views in a very short time. She was listed among the most viewed female artists on YouTube with 22 million views. And she is the most followed Sri Lanka singer on Instagram. She was received the honorary title ‘Kala Keerthi Abhimani’ by the All Ceylon Cultural Environment Protection Organization. Meanwhile, she received \"Aya Pranama Award\" for her contribution to the music and was awarded the 2021 SLIM-Nielsen Peoples Awards for the song of the year 2021.",
    "Lyrics of a song": "දෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nනෑ සත්තමයි\nඔබමයි මගේ ආදරේ\nසයුරෙන් මෙහා\nසිටියත් සදා පාළුවේ\nබොඳ වෙන්නෙපා දැන්\nඔබ ඇන්ද සිතුවම්\nහදේ\nපන්හිඳට හුරුවී\nකවි ලිව්වා මා මුළු රැයේ\nඉකිබින්ද සුසුමන්\nඔබ හින්දා වැලපෙයි\nමගේ ළයේ\nඑනකං බලා ඉන්නෙමි\nමේ දෙනුවන් අයා\nදෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nසඳ රේණු අතුරා\nගිනි දැල්වු අපෙ යහන මේ\nතුරුලේ හොවා මා\nඅඳුරේ කියූ ආදරේ\nමිණි මුතු එපා දැන්\nඔය දෑස මගේ ජීවිතේ\nප්රියේ\nඑනකං බලා ඉන්නෙමි\nමේ දෙනුවන් අයා\nදෙනුවන් පියා\nකඳුලින් ලියූ ආදරේ\nසිහිනෙන් වගේ\nඇවිදින් ගියා මේ රැයේ\nනෑ සත්තමයි\nඔබමයි මගේ ආදරේ\nසයුරෙන් මෙහා\nසිටියත් සදා පාළුවේ",
    "Songs": "Ayachana, Denimak Wage, දෙනුවන් පියා, Gum Nade Ranen Rane, Hanthana Sihine-Bala Walapemi, Hiru Mal, Kumuduniya Obai Mage, La Hiruge Eliye",
    "email": ""
  },
  {
    "Name": "ඩබ්. ඩී. අමරදේව",
    "Birth Date": "5-Dec-27",
    "City": "මොරටුව",
    "Biography": "ඩබ්. ඩී. අමරදේව උත්තර භාරතීය රාගධාරී සංගීතයෙන් සිංහල ගීත ක්‍ෂේත්‍රය පෝෂණය කල ‍‍ගෞරවණීය කලාකරුවෙකි. 1927 වර්ෂයේ දෙසැම්බර් පස් වන දින මොරටුවේදී මෙළොව එළිය දුටු, වනක්කුවත්ත මිටි වඩුගේ දොන් ඇල්බට් පෙරේරා, ප්‍රකට ගායන හා සංගීතඥයෙකු ලෙස ශ්‍රි ලංකාවේදී හඳුනා ගනු ලබන්නේ ඔහුගේ ආරෝපිත නාමය වූ අමරදේව නමිනි. සිතාරය, තබ්ලාව, හාර්මෝනියම වැනි ශාස්ත්‍රීය සංගීත භාණ්ඩ එක්කොට ගනිමින්, සිංහල ජන සංගීතය සහ භාරත ජනමූල සංගීතය ස්වකීය නිර්මාණ විෂයට දායක කර ගනී. දරුවන් හය දෙනෙකුගෙන් යුත් පවුලක බාලයා වු අමරදේව, දොන් ගිනෝරිස් පෙරේරා සහ මැගී වෙස්ලිනා මෙන්ඩිස්ට දාව උපත ලැබුවකු විය. කුඩාකල දී අමරදේව සංගීතමය ආභාෂය ලැබුවේ තම පියාගෙනි. එමෙන්ම ඔහුගේ වැඩිමහලූ සහෝදරයෙකු ඉන්දීය ශාස්ත්‍රිය සංගීත ගුරුවරයෙකුද වුයේය. අමරදේව අධ්‍යාපනය ලැබුවේ ශ්‍රි සද්ධර්මෝදය මිශ්‍ර පාසලෙනි. ඔහු ද්විතියික අධ්‍යාපනය ලැබුවේ පානදුර ශ්‍රී සුමංගල විද්‍යාලයෙනි. ඉන්පසු ඔහු කළුතර විද්‍යාලයටද බලපිටිය සිද්ධාර්ථ විද්‍යාලයටද ඇතුළත් වුයේය. ‘අශෝකමාලා’ චිත්‍රපටය රූපගත කරන අවධියේ එම චිත්‍රපටයේ සංගීත අධ්‍යක්‍ෂවරයාවු මෙහොමඞ් ගවුස් මාස්ටර් තම සංගීත කණ්ඩායමේ ප්‍රධාන වයලීන වාදකයා ලෙස අමරදේව සම්බන්ධ කර ගත්තේය. ‘අමරදේව’ යන නාමය ඔහු ලැබුවේ මහාචාර්ය එදිරිවීර සරච්චන්ද්‍රයන් අතිනි. ලක්නව් හි පිහිටි බාත්ඛන්ඬේ සංගීත විද්‍යා පීඨයෙන් අධ්‍යාපනය හැදැරූ අමරදේව පසුව ලංකාවට පැමිණ ශ්‍රි ලංකා ගුවන් විදුලි සංස්ථාව හා සම්බන්ධව කටයුතු කළේය. ලාංකීය ජන සංගීතයේ සංස්ථාපනය විමසා බැලීම සදහා 1950 මැදභාගයේදී සිය ජන ගායනා ව්‍යාපෘතිය වෙනුවෙන් \"පණීභාරත, කිරිගනිතා, ගුණමලා, උක්කුවා සහ සුරඹා\" වැනි උඩරට ශාස්ත්‍රීය නර්තන විශාරදයන්ගේ අනුදැනුම ලැබීය.එම සංගීත රටා එක් තනි තාලයක් වටා පමණක් ගෙතී ඇති බව හදුනා ගන්නා ඔහු, ඒවාට මධ්‍ය තාලයක් සදහා අනුගත වන පද මාලා එක් කිරීමට තීරණය කරයි.එහිදී එකල පැවැති ඇතැම් සීමා කිරීම් පසෙකලීමටද ඔහු පෙළඹෙයි.මේ අන්දමෙන් බාහිර තත්වයන්ගේද බලපෑම ලත්, සිංහල සංගීතයට අනන්‍ය වූ නියම ජන සංගීත සංස්කෘතියක් බිහිකරලීමට අමරදේව සමත්වෙයි. පසුව වික්ටර් රත්නායක,සුනිල් එදිරිසිංහ, සනත් නන්දසිරි වැනි කලාකරුවන් භාවිතයට යෙදුනු සරල ගී විශේෂය නිර්මාණය කිරීම සඳහාද ඔහු ක්‍රියාකාරීව දායක වෙයි. පිලිපීන රමෝන් මග්සයිසායි සම්මානය (2001), ඉන්දියානු පද්ම ශ්‍රි සම්මානය සහ ශ්‍රි ලංකාවේ කලාකීර්ති ජනාධිපති සම්මානය (1986), මෙන්ම දේශමාන්‍ය සම්මානය(1998) ආදී සම්මාන රැසක් දිනා ගැනීමටද අමරදේව සමත් වෙයි.එමෙන්ම 1967, යුනෙස්කෝ මැනිලා සිම්පෝසියම සහ, \"ගවුමි සලාම්\" නම් වූ මාලදිවයින් ජාතික ගීය සදහා 1972 දී බ්‍රිතාන්‍ය එළිසබෙත් රැජිනගේ ආරාධනයෙන් යුතුව තනුව නිර්මාණයට දායක වීම ආදියෙන්, ඔහු ජාත්‍යාන්තරය තුළ ලාංකේය අනන්‍යතාව සැළකොට සිටියේය. වඩු කාර්මිකයෙකු වූ වනක්කුවත්ත වඩුගේ දොන් ජිනෝරිස් පෙරේරා සහ බාලාපුවඩුගේ මැගී වෙස්ලිනා මෙන්ඩිස් යන මවුපිය යුවලට දාව, මොරටුව ප්‍රදේශයේදී අමරදේව උපත ලබන්නේ සත් දෙනෙකුගෙන් යුත් පවුලේ බාලම දරුවා ලෙසටයි. තම පියා බෞද්ධයෙකු වීමත් මව කතෝලික තැනැත්තියක් වීමත් නිසා බෞද්ධ හා කතෝලික හර පද්ධතීන් මිශ්‍රවුණු පවුලක ජීවත් වීමේ හැකියාව නිතැතින්ම අමරදේවට ලැබෙයි. අමරදෙව සංගීතය කෙරෙහි යොමු කරන්නේ මොරටුමුල්ල වඩු කාර්මික විද්‍යාලයේ වයලීන නිපදවන්නෙකු හා අලුත්වැඩියා කරන්නෙකු වූ ඔහුගේ පියා විසිනි. අමරදේව, කුඩා කළ තම මවගේ ස්තෝත්‍ර ගායන වලට හිතුමනාපයේ වයලීනයේ තත් හඬවන්නට පුරුදුව සිටියේය.ඔහුගේ වැඩිමහල් සොහොයුරා විසින් ඔහුට ඉන්දියානු ශාස්ත්‍රීය සංගීතය උගන්වනු ලැබීම අමරදෙවගේ සංගීත ජීවිතය ඔපවත් වීම සදහා පවුලෙන් ලද තවත් පිටුවහලක් විය. ඔහුට වයස අවුරුදු හත වන විට ජපන් ටින් වයලීනයක් පියාගෙන් ලද ත්‍යාගයක් වශයෙන් ඔහුට හිමිවේ. කොරළවැල්ලේ විහාරස්ථානයේ මාලාලංකාර නායක තෙරණුවන් යටතේ ස්වකීය මූලික අධ්‍යාපනය ලබන අමරදේවයන්ගේ සංගීත ප්‍රතිභාවේ අපූර්වත්වය දුටුවන්, විහාරස්ථානයේ කවි හා ගාථා ගායනා කිරීම සඳහා අමරදේවයන් හට ආරාධනා කරයි. අනතුරුව තම ග්‍රාමයේ ගීතිකා කණ්ඩායමේ නායකත්වය දැරීමටද අමරදේවයන්ට හැකියාව ලැබෙයි. ශ්‍රි සද්ධර්මෝදය බෞද්ධ මිශ්‍ර පාසලට ඇතුළත් වී අධ්‍යාපනය ලබන අමරදේව, මොරටු විද්‍යාලයෙන් පවත්වන ලැබූ කවි ගායනා තරගයකින් ජයග්‍රහණය ලබන්නේ මේ අතරදීය. එසේම කොළඹ කලා සංගමය විසින් මෙහෙය වූ ගායනා තරගයකින් ජයග්‍රහණය ලැබීමට අමරදේවයන් නායකත්වය දැරූ පාසල් ගායක කණ්ඩායමට හැකියාව උදාවේ. මෙම ජයග්‍රහණ වලින් උද්දාමය ලද අමරදේවයන්ගේ පාසල් ගුරුවරු, ඔහුව ලංකා ගුවන් විදුලි සේවයෙහි ගායක මඩුල්ලට ඇතුලත් කිරීමට ක්‍රියා කරයි. මේ අන්දමින් දක්ෂතා ප්‍රදර්ශනය කරන අමරදේව, 1945 වර්ෂයේදී ජන කලා මණ්ඩලය විසින් පවත්වන ලද ගායනා හා වයලීන වාදක තරගයකින් රන් පදක්කම දිනා ගැනීමට බුහුටි වෙයි. තම ප්‍රාථමික අධ්‍යාපනය නිමා කිරීමෙන් අනතුරුව ඉංග්‍රීසි භාෂාව සදහා ලද ශිෂ්‍යත්වයකින් පානදුර ශ්‍රී සුමංගල විද්‍යාලයට ඇතුළත් වීමේ හැකියාව අමරදේවයන්ට ලැබේ. එහිදී විදුහල්පති ඩැනිස්ටර් තෝමස් ප්‍රනාන්දු (ඩී.ටී. ප්‍රනාන්දු ) මහතා සමග දැන හැඳුනුම් කමක් ඇති කරගන්නා ඔහු, ඩී.ටී. ප්‍රනාන්දු මහතාගේ උපකාරීත්වයෙන් කළුතර විද්‍යාලයටත් ඉන් අනතුරුව, බලපිටිය සිද්ධාර්ථ විද්‍යාලයටත් ඇතුළත්ව අධ්‍යාපනය ලැබීමේ අවස්ථාව උදා කර ගනියි. මෙකලදී \"අශෝකමාලා\" චිත්‍රපටයේ රූගත කිරීම් ඇරඹෙන අතර, මොරටුවෙහි ජෙරාඩ්.ජේ.පීරිස් නැමැත්තෙකු විසින් අමරදේවයන්ව එම චිත්‍රපටයේ සංගීතය මෙහෙය වූ, මොහොමඩ් ගවුස් මාස්ටර් වෙත හඳුන්වා දෙනු ලබයි. අමරදේවයන්ගේ ශක්‍යතාවන් හඳුනාගන්නා ගවුස් මාස්ටර් විසින් තම වාදක මණ්ඩලයේ ප්‍රමුඛතම වයලීන වාදක ශිල්පියා බවට අමරදේව පත්කරනු ලබයි. ඩී.ටී. ප්‍රනාන්දු පවසන අන්දමට, ඔහුගේ සහොදරයා වූ කොරළවැල්ල පාසලේ සංගීත ගුරුවරයා වශයෙන් සේවය කළ ඩ්බ්.ජේ.ප්‍රනාන්දු විසින් අමරදේවයන්ගේ දක්ෂතාවන් හඳුනා ගනු ලබයි. අමරදේව පාසලේදී වයලීන වාදන සම්භන්ධයෙන් දක්වන බුහුටි බව ඔහුගේ නිරීක්ෂණයට ලක්වේ. පසුව අමරදේවගේ පියා ඔහුට වයලීනයක් තනා දෙන අතර, ඔහු පියා යටතේ වයලීන වාදනය හදාරනු ලබයි. ඔහු පසුව අශෝකමාලා චිත්‍රපටය සදහා මොහොමඩ් ගවුස් වෙත හදුන්වාදීම සිදුවන්නේ, ඩී.ටී.ප්‍රනාන්දු මහතාගේ උපකාර ඇතුව ඉගෙනීමේ කටයුතු සඳහා අමරදේව කළුතර බලා යාමෙන් වසර කිහිපයකට පසුවය. අශෝකමාලා චිත්‍රපටයේ පද රචකයා වශයෙන් කටයුතු කරන්නේ ඩී.ටී. ප්‍රනාන්දු මහතා වන අතර, ඔහු චිත්‍රපටයේ අධ්‍යක්ෂකවරයා වූ ශාන්තිකුමාර් සෙනෙවිරත්න මහතා සමග ඇති කරගෙන තිබූ දැඩි මිත්‍රත්වය මේ සදහා පිටුවහලක් වෙයි. තම උසස් අධ්‍යාපන කටයුතු සදහා 1950 වර්ෂයේ මැද භාගයේදී ඉන්දියාවේ ලක්නවු නුවර බාත්ඛන්ඩේ සංගීත අධ්‍යයනායතනයට ඇතුළත් වෙයි. අමරදේව ලංකාවට පැමිණි පසු දිනක් කළුතර සිට කොළඹ බලා ධාවනය වන බසයකට මොරටුවේදී ගොඩ වැදෙන අමරදේවයන්ට, බසයේ සිටින ඩී.ටී.ප්‍රනාන්දු මහතා මුණගැසෙන අතර එහිදී තමා සඳහා පද්‍ය රචනා කර දෙන ලෙසට අමරදේවයන් ඉල්ලා සිටියි. මෙහිදී බසය ධාවනය වන අතර ඩී.ටී.ප්‍රනාන්දු මහතා විසින් \"පීනමුකෝ කළුගගේ\" ගීතය රචනා කරන අතර, ඔහුට ගීතයේ අවසාන කොටස ගායනා කිරීමට නොහැකි වන්නේ බම්බලපිටිය ප්‍රදේශයේදී බසයෙන් බැසයාමට අමරදේවයන්ට සිදුවීම නිසයි. තම ඉගෙනීමේ කටයුතු අහවර කරන අමරදේව, මොහොමඩ් ගවුස් සමග එක්ව, චිත්‍රපටයක වැඩ සඳහා ඉන්දියාව බලා යයි. \"ඇයි යමෙකු කලේ ආලේ\" ගීතය සදහා ගායනයෙන්, නර්තනයෙන් හා රංගනයෙන් යන ත්‍රිවිධ අංශයෙන්ම දායක වීමට අමරදේව මෙහිදී සමත් වෙයි. ඉන්දියාවේ ලක්නවු නුවර බාත්ඛන්ඩේ අධ්‍යාබනායතනයෙහි ලැබූ පරිචයත් සමග, ලංකා ගුවන් විදුලියෙහි නිත්‍ය ගායකයෙකු ලෙස සේවයට එක් වීම තුළින්, ස්වකීය ප්‍රතිභාව හා දැක්ම මින් පෙර නොවූ තරම් වූ වඩා පුළුල් ශ්‍රාවක ගහණයක් වෙත සම්ප්‍රේශණය කිරීමේ හැකියාව ඔහුට උදා වේ. බාත්ඛන්ඩේ අධ්‍යයනායතනයෙහිදී ලබන සතතාභ්යාසයන්ගේ දැනුම ලබන දොන් ඇල්බර්ට් පෙරේරා ලංකාවට පැමිණෙන්නේ පණ්ඩිත් වනක්කු වඩුගේ දොන් අමරදේව ලෙසිනි. අමරණීය ආත්මයක් ලද දේවයාණන් යන අර්ථය ලද මේ නාමය ඔහුට ලබාදෙන්නේ මහාචාර්යය එදිරිවීර සරච්චන්ද්‍රයන් විසිනුයි. මේ සමය වන විට ශ්‍රි ලංකාව ස්වාධීන ජාතියක් ලෙස නිදහස ලැබූ මුල්ම අවදිය වූ අතර, ශ්‍රි ලාංකේය අනන්‍යයතාවක් සහිත සංගීත විදිය නම් කවරක්ද යන ගැටළුව, සමාජීය ප්‍රාඥයන්, කලාකරුවන් සහ පොදු මහජනතාව අතර විමසීමට බඳුන් දුන් තත්වයක් විය. මෙම තත්වයන්ට අනුකූලව, ස්වදෙශික ජන සංගීතය සමග, ඔහු ඉන්දියාවෙදී හැදෑරූ සංගීතයත් ඇසුරුකොට ගෙන වඩා සුඛනම්ය වූ සංගීත වහරක් මතුකොට ගැනීමට අමරදේව සමත් වෙයි. දකුණු ඉන්දියානු සහ ද්‍රවිඩ සංගීත ආකෘති පිළිබද අමරදේවයන් කළ පර්යේෂණාත්මක හැදෑරීම් ඔහුගේ සංගීත භාවිතාවේ නව මානයන් අතර වේ. ශ්‍රි ලංකාවේ අසහාය පද්‍ය රචකයෙකු වූ මහගම සේකරයන් හා එක්ව, අමරදෙවයන් විසින් කරන ලද ස්වර රචනා ශාස්ත්‍රීය සිංහල පද්‍යයේ ස්වර විභේදනයන් පිළිබඳ වූ ඔහුගේ අනන්‍ය ප්‍රතිභාව ගවේෂණය කරන්නක් වී තිබේ. මේ වන විට අමරදේවයන්ගේ සංගීත භාවිතාව සමස්ත ජාතියක භාවමය ආත්මය ප්‍රවර්ථනය කරන්නක් බවට පත්ව තිබේ. කාව්‍යමය නාට්‍ය (කරදිය, නළදමයන්ති ආදිය), චිත්‍රපටි (රන් මුතු දූව, ගම්පෙරෙළිය, රන් සළු, දෙළොවක් අතරේ, ගැටවරයෝ, රෑන ගිරවු, තුන්මං හංදිය ආදිය), නුර්ති (වෙස්සන්තර ) ආදී කෘතීන්ට මෙන්ම ගුවන් විදුලි හා රූපවාහිනී වැඩසටහන් වෙනුවෙන් ගීත දහස් ගණනක් ගායනා කිරීමට අමරදේවයන් හැකියාව ලැබීය. අමරදේව සහ ඔහුගේ බිරිය වන විමලාට දාව රන්ජන අමරදේව නමින් පුතෙකු සහ සුභානි අමරදේව - දක්ෂ ගායන ශිල්පිණියෙකි, ප්‍රියන්වදා අමරදේව නමින් දියණිවරුන් දෙදෙනෙකු සිටිති.",
    "Lyrics of a song": "සන්නාලියනේ සන්නාලියනේ මේ හිමිදිරි උදයේ \nසන්තෝසෙන් ඔබ හිනැහී හිනැහී කාටද ඇඳුම වියන්නේ \nමේ පොඩි ඇඳුම වියන්නේ \nමාලගිරා තටු සේම රුවින් යුතු නිල්වන් ඇඳුම වියන්නේ \nකාටද ඇඳුම වියන්නේ \nමාලගිරා තටු සේම රුවින් යුතු නිල්වන් ඇඳුම වියන්නේ \nඊයේ ඉපදුනු කුලුඳුල් දූටයි මේ පොඩි ඇඳුම වියන්නේ \n\nසන්නාලියනේ සන්නාලියනේ මේ හැන්දෑ යාමේ \nහැඩ වැඩ දමලා ලස්සන කරලා කාටද ඇඳුම වියන්නේ \nදිලිසෙන ඇඳුම වියන්නේ \nසැන්දෑ අහසේ රන්වන් පාටින් දිලිසෙන ඇඳුම වියන්නේ \nකාටද ඇඳුම වියන්නේ \nසැන්දෑ අහසේ රන්වන් පාටින් දිලිසෙන ඇඳුම වියන්නේ \nඒ කුලුඳුල් දූ දීගෙක දෙන්නයි මංගල ඇඳුම වියන්නේ \n\nසන්නාලියනේ සන්නාලියනේ සීතල හඳ එළියේ \nමැළැවුණු මුහුණින් වෙව්ලන දෑතින් කාටද සළුව වියන්නේ\nහීතල සළුව වියන්නේ \nකණකොක් තටුවේ සුදුමැලි පාටින් සීතල සළුව වියන්නේ \nකාටද සළුව වියන්නේ \nකණකොක් තටුවේ සුදුමැලි පාටින් සීතල සළුව වියන්නේ \nමියගිය ඇයගේ මිනිය වහන්නයි සීතල සළුව වියන්නේ",
    "Songs": "Aadare Hangum, Adavan wu Denethin, Aradhana, Kadu Muduna, Mindada Hee Sara, Sada Horen Horen, Wikasitha Pem, Abhisambodi Chanayen, Ai Kale Yameku Ale, Ama Ganga Galala, Apara Wu Aakase, Aradhana, Ase Mathuwana Kandulu Bindu Gena, Atheethayen Ganga Gala Basi, Athu Aga Dili Wanamal, සන්නාලියනේ සන්නාලියනේ",
    "email": ""
  }
]